{
  "languages": {
    "eng": {
      "name": "The Westminster Confession of Faith",
      "category": "Doctrine",
      "slug": "westminster-confession-of-faith",
      "description": "The original text of 1646 with the Assembly's proof texts included via inline citation.",
      "chapters": [
        {
          "id": 1,
          "title": "Of the Holy Scripture",
          "sections": [
            {
              "id": 1,
              "text": "Although the light of nature and the works of creation and providence do so far manifest the goodness, wisdom, and power of God, as to leave men unexcusable (Rom. 2:14, 15; Rom. 1:19, 20; Ps. 19:1, 2, 3; Rom. 1:32, 2:1); yet are they not sufficient to give that knowledge of God and of His will, which is necessary unto salvation (1 Cor. 1:21; 1 Cor. 2:13, 14). Therefore it pleased the Lord, at sundry times, and in divers manners, to reveal Himself, and to declare that His will unto His Church (Heb. 1:1); and afterwards, for the better preserving and propagating of the truth, and for the more sure establishment and comfort of the Church against the corruption of the flesh, and the malice of Satan and of the world, to commit the same wholly unto writing (Prov. 22:19, 20, 21; Luke 1:3, 4; Rom. 15:4; Matt. 4:4, 7, 10; Isa. 8:19, 20): which maketh the Holy Scripture to be most necessary (2 Tim. 3:15; 2 Pet. 1:19); those former ways of God’s revealing His will unto His people being now ceased (Heb. 1:1, 2)."
            },
            {
              "id": 2,
              "text": "Under the name of Holy Scripture, or the Word of God written, are now contained all the books of the Old and New Testament, which are these:\n\nOf the Old Testament:\n\nGenesis\nExodus\nLeviticus\nNumbers\nDeuteronomy\nJoshua\nJudges\nRuth\nI. Samuel\nII. Samuel\nI. Kings\nII. Kings\nI. Chronicles\nII. Chronicles\nEzra\nNehemiah\nEsther\nJob\nPsalms\nProverbs\nEcclesiastes\nThe Song of Songs\nIsaiah\nJeremiah\nLamentations\nEzekiel\nDaniel\nHosea\nJoel\nAmos\nObadiah\nJonah\nMicah\nNahum\nHabakkuk\nZephaniah\nHaggai\nZechariah\nMalachi\n\nOf the New Testament:\n\nThe Gospels according to\nMatthew\nMark\nLuke\nJohn\nThe Acts of the Apostles\nPaul’s Epistles\nTo the Romans\nCorinthians I.\nCorinthians II.\nGalatians\nEphesians\nPhilippians\nColossians\nThessalonians I.\nThessalonians II.\nTo Timothy I.\nTo Timothy II.\nTo Titus\nTo Philemon\nThe Epistle to the Hebrews\nThe Epistle of James\nThe first and second Epistles of Peter\nThe first, second, and third Epistles of John\nThe Epistle of Jude\nThe Revelation of John\n\nAll which are given by inspiration of God, to be the rule of faith and life (Luke 16:29, 31; Eph. 2:20; Rev. 22:18, 19; 2 Tim. 3:16)."
            },
            {
              "id": 3,
              "text": "The books commonly called Apocrypha, not being of divine inspiration, are no part of the canon of the Scripture; and therefore are of no authority in the Church of God, nor to be any otherwise approved, or made use of, than other human writings (Luke 24:27, 44; Rom. 3:2; 2 Pet. 1:21)."
            },
            {
              "id": 4,
              "text": "The authority of the Holy Scripture, for which it ought to be believed and obeyed, dependeth not upon the testimony of any man, or Church; but wholly upon God (who is truth itself) the author thereof: and therefore it is to be received because it is the Word of God (2 Pet. 1:19, 21; 2 Tim. 3:16; 1 John 5:9; 1 Thess. 2:13)."
            },
            {
              "id": 5,
              "text": "We may be moved and induced by the testimony of the Church to a high and reverent esteem of the Holy Scripture (1 Tim. 3:15). And the heavenliness of the matter, the efficacy of the doctrine, the majesty of the style, the consent of all the parts, the scope of the whole (which is, to give all glory to God), the full discovery it makes of the only way of man’s salvation, the many other incomparable excellencies, and the entire perfection thereof, are arguments whereby it doth abundantly evidence itself to be the Word of God: yet notwithstanding, our full persuasion and assurance of the infallible truth and divine authority thereof, is from the inward work of the Holy Spirit bearing witness by and with the Word in our hearts (1 John 2:20, 27; John 16:13, 14; 1 Cor. 2:10, 11, 12; Isa. 59:21)."
            },
            {
              "id": 6,
              "text": "The whole counsel of God concerning all things necessary for His own glory, man’s salvation, faith, and life, is either expressly set down in Scripture, or by good and necessary consequence may be deduced from Scripture: unto which nothing at any time is to be added, whether by new revelations of the Spirit, or traditions of men (2 Tim. 3:15, 16, 17; Gal. 1:8, 9; 2 Thess. 2:2). Nevertheless we acknowledge the inward illumination of the Spirit of God to be necessary for the saving understanding of such things as are revealed in the Word (John 6:45, 1 Cor. 2:9–12): and that there are some circumstances concerning the worship of God, and government of the Church, common to human actions and societies, which are to be ordered by the light of nature and Christian prudence, according to the general rules of the Word, which are always to be observed (1 Cor. 11:13, 14; 1 Cor. 14:26, 40)."
            },
            {
              "id": 7,
              "text": "All things in Scripture are not alike plain in themselves, nor alike clear unto all (2 Pet. 3:16): yet those things which are necessary to be known, believed, and observed for salvation, are so clearly propounded and opened in some place of Scripture or other, that not only the learned, but the unlearned, in a due use of the ordinary means, may attain unto a sufficient understanding of them (Psalm 119:105, 130)."
            },
            {
              "id": 8,
              "text": "The Old Testament in Hebrew (which was the native language of the people of God of old), and the New Testament in Greek (which, at the time of the writing of it was most generally known to the nations), being immediately inspired by God, and, by His singular care and providence kept pure in all ages, are therefore authentical (Matt. 5:18); so as, in all controversies of religion, the Church is finally to appeal unto them (Isa. 8:20; Acts 15:15; John 5:39, 46). But, because these original tongues are not known to all the people of God, who have right unto, and interest in the Scriptures, and are commanded, in the fear of God, to read and search them (John 5:39), therefore they are to be translated into the vulgar language of every nation unto which they come (1 Cor. 14:6, 9, 11, 12, 24, 27, 28), that the Word of God dwelling plentifully in all, they may worship Him in an acceptable manner (Col. 3:16); and, through patience and comfort of the Scriptures, may have hope (Rom. 15:4)."
            },
            {
              "id": 9,
              "text": "The infallible rule of interpretation of Scripture is the Scripture itself: and therefore, when there is a question about the true and full sense of any Scripture (which is not manifold, but one), it must be searched and known by other places that speak more clearly (2 Pet. 1:20, 21; Acts 15:15, 16)."
            },
            {
              "id": 10,
              "text": "The supreme judge by which all controversies of religion are to be determined, and all decrees of councils, opinions of ancient writers, doctrines of men, and private spirits, are to be examined; and in whose sentence we are to rest; can be no other but the Holy Spirit speaking in the Scripture (Matt. 22:29, 31; Eph. 2:20 with Acts 28:25)."
            }
          ]
        },
        {
          "id": 2,
          "title": "Of God, and of the Holy Trinity",
          "sections": [
            {
              "id": 1,
              "text": "There is but one only (Deut. 6:4; 1 Cor. 8:4, 6), living, and true God (1 Thess. 1:9; Jer. 10:10): who is infinite in being and perfection (Job 11:7, 8, 9; Job 26:14), a most pure spirit (John 4:24), invisible (1 Tim. 1:17), without body, parts (Deut. 4:15, 16; John 4:24, with Luke 24:39), or passions (Acts 14:11, 15), immutable (James 1:17; Mal. 3:6), immense (1 Kings 8:27; Jer. 23:23, 24), eternal (Ps. 90:2; 1 Tim. 1:17), incomprehensible (Ps. 145:3), almighty (Gen. 17:1; Rev. 4:8), most wise (Rom. 16:27), most holy (Isa. 6:3; Rev. 4:8), most free (Ps. 115:3), most absolute (Exod. 3:14), working all things according to the counsel of His own immutable and most righteous will (Eph. 1:11), for His own glory (Prov. 16:4; Rom. 11:36); most loving (1 John 4:8, 16), gracious, merciful, long-suffering, abundant in goodness and truth, forgiving iniquity, transgression, and sin (Exod. 34:6, 7); the rewarder of them that diligently seek Him (Heb. 11:6); and withal, most just and terrible in His judgments (Neh. 9:32, 33), hating all sin (Ps. 5:5, 6), and who will by no means clear the guilty (Nah. 1:2, 3; Exod. 34:7)."
            },
            {
              "id": 2,
              "text": "God hath all life (John 5:26), glory (Acts 7:2), goodness (Ps. 119:68), blessedness (1 Tim. 6:15; Rom. 9:5), in and of Himself; and is alone in and unto Himself all-sufficient, not standing in need of any creatures which He hath made (Acts 17:24, 25), nor deriving any glory from them (Job 22:2, 3), but only manifesting His own glory in, by, unto, and upon them: He is the alone fountain of all being, of whom, through whom, and to whom are all things (Rom 11:36); and hath most sovereign dominion over them, to do by them, for them, or upon them whatsoever Himself pleaseth (Rev. 4:11; 1 Tim. 6:15; Dan. 4:25, 35). In His sight all things are open and manifest (Heb. 4:13); His knowledge is infinite, infallible, and independent upon the creature (Rom. 11:33, 34; Ps. 147:5), so as nothing is to Him contingent, or uncertain (Acts 15:18; Ezek. 11:5). He is most holy in all His counsels, in all His works, and in all His commands (Ps. 145:17; Rom. 7:12). To Him is due from angels and men, and every other creature, whatsoever worship, service, or obedience He is pleased to require of them (Rev. 5:12, 13, 14)."
            },
            {
              "id": 3,
              "text": "In the unity of the Godhead there be three persons, of one substance, power, and eternity; God the Father, God the Son, and God the Holy Ghost (1 John 5:7; Matt. 3:16, 17; Matt. 28:19; 2 Cor. 13:14). The Father is of none, neither begotten, nor proceeding: the Son is eternally begotten of the Father (John 1:14, 18): the Holy Ghost eternally proceeding from the Father and the Son (John 15:26; Gal. 4:6.)."
            }
          ]
        },
        {
          "id": 3,
          "title": "Of God’s Eternal Decree",
          "sections": [
            {
              "id": 1,
              "text": "God from all eternity did, by the most wise and holy counsel of His own will, freely, and unchangeably ordain whatsoever comes to pass (Eph. 1:11; Rom. 11:33; Heb. 6:17; Rom. 9:15, 18): yet so, as thereby neither is God the author of sin (Jam. 1:13, 17; 1 John 1:5), nor is violence offered to the will of the creatures, nor is the liberty or contingency of second causes taken away, but rather established (Acts 2:23; Matt. 17:12; Acts 4:27, 28; John 19:11; Prov. 16:33)."
            },
            {
              "id": 2,
              "text": "Although God knows whatsoever may or can come to pass upon all supposed conditions (Acts 15:18; 1 Sam. 23:11, 12; Matt. 11:21, 23), yet hath He not decreed anything because He foresaw it as future, or as that which would come to pass upon such conditions (Rom. 9:11, 13, 16, 18)."
            },
            {
              "id": 3,
              "text": "By the decree of God, for the manifestation of His glory, some men and angels (1 Tim. 5:21; Matt. 25:41) are predestinated unto everlasting life, and others fore-ordained to everlasting death (Rom. 9:22, 23; Eph. 1:5, 6; Prov. 16:4)."
            },
            {
              "id": 4,
              "text": "These angels and men, thus predestinated, and fore-ordained, are particularly and unchangeably designed, and their number so certain and definite, that it cannot be either increased or diminished (2 Tim. 2:19; John 13:18)."
            },
            {
              "id": 5,
              "text": "Those of mankind that are predestinated unto life, God, before the foundation of the world was laid, according to His eternal and immutable purpose, and the secret counsel and good pleasure of His will, hath chosen, in Christ, unto everlasting glory (Eph. 1:4, 9, 11; Rom. 8:30; 2 Tim. 1:9; 1 Thess. 5:9), out of His mere free grace and love, without any foresight of faith or good works, or perseverance in either of them, or any other thing in the creature, as conditions, or causes moving Him thereunto (Rom. 9:11, 13, 16; Eph. 1:4, 9): and all to the praise of His glorious grace (Eph. 1:6, 12)."
            },
            {
              "id": 6,
              "text": "As God hath appointed the elect unto glory, so hath He, by the eternal and most free purpose of His will, fore-ordained all the means thereunto (1 Pet. 1:2; Eph. 1:4, 5; Eph. 2:10; 2 Thess. 2:13). Wherefore they who are elected, being fallen in Adam, are redeemed by Christ (1 Thess. 5:9, 10; Titus 2:14), are effectually called unto faith in Christ by His Spirit working in due season, are justified, adopted, sanctified (Rom. 8:30; Eph. 1:5; 2 Thess. 2:13), and kept by His power through faith, unto salvation (1 Pet. 1:5). Neither are any other redeemed by Christ, effectually called, justified, adopted, sanctified, and saved, but the elect only (John 17:9; Rom. 8:28 to the end; John 6:64, 65; John 10:26; John 8:47; 1 John 2:19)."
            },
            {
              "id": 7,
              "text": "The rest of mankind God was pleased, according to the unsearchable counsel of His own will, whereby He extendeth or withholdeth mercy, as He pleaseth, for the glory of His sovereign power over His creatures, to pass by; and to ordain them to dishonour and wrath, for their sin, to the praise of His glorious justice (Matt. 11:25, 26; Rom. 9:17, 18, 21, 22; 2 Tim. 2:19, 20; Jude ver. 4; 1 Pet. 2:8)."
            },
            {
              "id": 8,
              "text": "The doctrine of this high mystery of predestination is to be handled with special prudence and care (Rom. 9:20; Rom. 11:33; Deut. 29:29), that men attending the will of God revealed in His Word, and yielding obedience thereunto, may, from the certainty of their effectual vocation, be assured of their eternal election (2 Pet. 1:10). So shall this doctrine afford matter of praise, reverence, and admiration of God (Eph. 1:6; Rom. 11:33), and of humility, diligence, and abundant consolation to all that sincerely obey the Gospel (Rom. 11:5, 6, 20; 2 Pet. 1:10; Rom. 8:33; Luke 10:20)."
            }
          ]
        },
        {
          "id": 4,
          "title": "Of Creation",
          "sections": [
            {
              "id": 1,
              "text": "It pleased God the Father, Son, and Holy Ghost (Heb. 1:2; John 1:2, 3; Gen. 1:2; Job. 26:13; Job. 33:4), for the manifestation of the glory of His eternal power, wisdom, and goodness (Rom. 1:20; Jer. 10:12; Ps. 104:24; Ps. 33:5, 6), in the beginning, to create, or make of nothing, the world, and all things therein whether visible or invisible, in the space of six days; and all very good (Gen. 1 chap.; Heb. 11:3; Col. 1:16; Acts 17:24)."
            },
            {
              "id": 2,
              "text": "After God had made all other creatures, He created man, male and female (Gen. 1:27), with reasonable and immortal souls (Gen. 2:7 with Eccles. 12:7 & Luke 23:43 and Matt. 10:28), endued with knowledge, righteousness, and true holiness, after His own image (Gen. 1:26; Col. 3:10; Eph. 4:24); having the law of God written in their hearts (Rom. 2:14, 15), and power to fulfil it (Eccles. 7:29): and yet under a possibility of transgressing, being left to the liberty of their own will, which was subject unto change (Gen. 3:6; Eccles. 7:29). Beside this law written in their hearts, they received a command, not to eat of the tree of the knowledge of good and evil, which while they kept, they were happy in their communion with God(Gen. 2:17; Gen. 3:8, 9, 10, 11, 23), and had dominion over the creatures (Gen. 1:26, 28)."
            }
          ]
        },
        {
          "id": 5,
          "title": "Of Providence",
          "sections": [
            {
              "id": 1,
              "text": "God the great Creator of all things doth uphold (Heb. 1:3), direct, dispose, and govern all creatures, actions, and things (Dan. 4:34, 35; Ps. 135:6; Acts 17:25, 26, 28; Job 38–41), from the greatest even to the least (Matt. 10:29, 30, 31), by His most wise and holy providence (Prov. 15:3; Ps. 104:24; Ps. 145:17), according to His infallible fore-knowledge (Acts 15:18; Ps. 94:8, 9, 10, 11), and the free and immutable counsel of His own will (Eph. 1:11; Ps. 33:10, 11), to the praise of the glory of His wisdom, power, justice, goodness, and mercy (Isa. 63:14; Eph. 3:10; Rom. 9:17; Gen. 45:7; Ps. 145:7)."
            },
            {
              "id": 2,
              "text": "Although, in relation to the fore-knowledge and decree of God, the first Cause, all things come to pass immutably, and infallibly (Acts 2:23): yet, by the same providence, He ordereth them to fall out, according to the nature of second causes, either necessarily, freely, or contingently (Gen. 8:22; Jer. 31:35; Exod. 21:13 with Deut. 19:5; 1 Kings 22:28, 34; Isa. 10:6, 7)."
            },
            {
              "id": 3,
              "text": "God in His ordinary providence maketh use of means (Acts 27:31, 44; Isa. 55:10, 11; Hos. 2:21, 22), yet is free to work without (Hos. 1:7; Matt. 4:4; Job 34:20), above (Rom. 4:19, 20, 21), and against them at His pleasure (2 Kings 6:6; Dan. 3:27)."
            },
            {
              "id": 4,
              "text": "The almighty power, unsearchable wisdom, and infinite goodness of God so far manifest themselves in His providence, that it extendeth itself even to the first fall, and all other sins of angels and men (Rom. 11:32, 33, 34; 2 Sam. 24:1 with 1 Chron. 21:1; 1 Kings 22:22, 23; 1 Chron. 10:4, 13, 14; 2 Sam. 16:10; Acts 2:23; Acts 4:27, 28); and that not by a bare permission (Acts 14:16), but such as hath joined with it a most wise and powerful bounding (Ps. 76:10; 2 Kings 19:28), and otherwise ordering and governing of them, in a manifold dispensation, to His own holy ends (Gen. 50:20; Isa. 10:6, 7, 12); yet so, as the sinfulness thereof proceedeth only from the creature, and not from God, who, being most holy and righteous, neither is, nor can be, the author or approver of sin (James 1:13, 14, 17; 1 John 2:16; Ps. 50:21)."
            },
            {
              "id": 5,
              "text": "The most wise, righteous, and gracious God doth oftentimes leave for a season His own children to manifold temptations, and the corruption of their own hearts, to chastise them for their former sins, or to discover unto them the hidden strength of corruption, and deceitfulness of their hearts, that they may be humbled (2 Chron. 32:25, 26, 31; 2 Sam. 24:1); and, to raise them to a more close and constant dependence for their support upon Himself, and to make them more watchful against all future occasions of sin, and for sundry other just and holy ends (2 Cor. 12:7, 8, 9; Ps. 73 throughout; Ps. 77:1–12; Mark 14:66 to the end, with John 21:15, 16, 17)."
            },
            {
              "id": 6,
              "text": "As for those wicked and ungodly men whom God, as a righteous Judge, for former sins, doth blind and harden (Rom. 1:24, 26, 28; Rom. 11:7, 8), from them He not only withholdeth His grace, whereby they might have been enlightened in their understandings, and wrought upon in their hearts (Deut. 29:4); but sometimes also withdraweth the gifts which they had (Matt. 13:12; Matt. 25:29), and exposeth them to such objects as their corruption makes occasions of sin (Deut. 2:30; 2 Kings 8:12, 13); and, withal, gives them over to their own lusts, the temptations of the world, and the power of Satan (Ps. 81:11, 12; 2 Thess. 2:10, 11, 12): whereby it comes to pass that they harden themselves, even under those means which God useth for the softening of others (Exod. 7:3 with Exod. 8:15, 32; 2 Cor. 2:15, 16; Isa. 8:14; 1 Pet. 2:7, 8; Isa. 6:9, 10 with Acts 28:26, 27)."
            },
            {
              "id": 7,
              "text": "As the providence of God doth in general reach to all creatures, so after a most special manner, it taketh care of His Church, and disposeth all things to the good thereof (1 Tim. 4:10; Amos 9:8, 9; Rom. 8:28; Isa. 43:3, 4, 5, 14)."
            }
          ]
        },
        {
          "id": 6,
          "title": "Of the Fall of Man, of Sin, and of the Punishment thereof",
          "sections": [
            {
              "id": 1,
              "text": "Our first parents, being seduced by the subtilty and temptation of Satan, sinned, in eating the forbidden fruit (Gen. 3:13; 2 Cor. 11:3). This their sin God was pleased, according to His wise and holy counsel, to permit, having purposed to order it to His own glory (Rom. 11:32)."
            },
            {
              "id": 2,
              "text": "By this sin they fell from their original righteousness and communion, with God (Gen. 3:6, 7, 8; Eccles. 7:29; Rom. 3:23), and so became dead in sin (Gen. 2:17; Eph. 2:1), and wholly defiled in all the parts and faculties of soul and body (Tit. 1:15; Gen. 6:5; Jer. 17:9; Rom. 3:10 to 19)."
            },
            {
              "id": 3,
              "text": "They being the root of all mankind, the guilt of this sin was imputed (Gen. 1:27, 28 & Gen. 2:16, 17 and Acts 17:26 with Rom. 5:12, 15, 16, 17, 18, 19 and 1 Cor. 15:21, 22, 49), and the same death in sin and corrupted nature conveyed, to all their posterity descending from them by ordinary generation (Ps. 51:5; Gen. 5:3; Job 14:4, Job 15:14)."
            },
            {
              "id": 4,
              "text": "From this original corruption, whereby we are utterly indisposed, disabled, and made opposite to all good (Rom. 5:6; Rom. 8:7, Rom. 7:18; Col. 1:21), and wholly inclined to all evil (Gen. 6:5; Gen. 8:21; Rom. 3:10, 11, 12), do proceed all actual transgressions (James 1:14, 15; Eph. 2:2, 3; Matt. 15:19)."
            },
            {
              "id": 5,
              "text": "This corruption of nature, during this life, doth remain in those that are regenerated (1 John 1:8, 10; Rom. 7:14, 17, 18, 23; James 3:2; Prov. 20:9; Eccles. 7:20); and although it be, through Christ, pardoned and mortified, yet both itself and all the motions thereof are truly and properly sin (Rom. 7:5, 7, 8, 25; Gal. 5:17)."
            },
            {
              "id": 6,
              "text": "Every sin, both original and actual, being a transgression of the righteous law of God, and contrary thereunto (1 John 3:4), doth, in its own nature, bring guilt upon the sinner (Rom. 2:15; Rom. 3:9, 19); whereby he is bound over to the wrath of God (Ephes. 2:3), and curse of the law (Gal. 3:10), and so made subject to death (Rom. 6:23), with all miseries spiritual (Ephes. 4:18), temporal (Rom. 8:20; Lam. 3:39), and eternal (Matt. 25:41, 2 Thess. 1:9)."
            }
          ]
        },
        {
          "id": 7,
          "title": "Of God’s Covenant with Man",
          "sections": [
            {
              "id": 1,
              "text": "The distance between God and the creature is so great, that although reasonable creatures do owe obedience unto Him as their Creator, yet they could never have any fruition of Him as their blessedness and reward, but by some voluntary condescension on God’s part, which He hath been pleased to express by way of covenant (Isa. 40:13, 14, 15, 16, 17; Job. 9:32, 33; 1 Sam. 2:25; Ps. 113:5, 6; Ps. 100:2, 3; Job. 22:2, 3; Job 35:7, 8; Luke 17:10; Acts 17:24, 25)."
            },
            {
              "id": 2,
              "text": "The first covenant made with man was a covenant of works (Gal. 3:12), wherein life was promised to Adam, and in him to his posterity (Rom. 10:5, Rom. 5:12–20), upon condition of perfect and personal obedience (Gen. 2:17; Gal. 3:10)."
            },
            {
              "id": 3,
              "text": "Man by his fall having made himself incapable of life by that covenant, the Lord was pleased to make a second (Gal. 3:21; Rom. 8:3; Rom. 3:20, 21; Gen. 3:15; Isa. 42:6), commonly called the covenant of grace; wherein He freely offereth unto sinners life and salvation by Jesus Christ, requiring of them faith in Him, that they may be saved (Mark 16:15, 16; John 3:16; Rom. 10:6, 9; Gal. 3:11), and promising to give unto all those that are ordained unto life His Holy Spirit, to make them willing and able to believe (Ezek. 36:26, 27; John 6:44, 45)."
            },
            {
              "id": 4,
              "text": "This covenant of grace is frequently set forth in Scripture by the name of a Testament, in reference to the death of Jesus Christ the Testator, and to the everlasting inheritance, with all things belonging to it, therein bequeathed (Heb. 9:15, 16, 17; Heb. 7:22; Luke 22:20; 1 Cor. 11:25)."
            },
            {
              "id": 5,
              "text": "This covenant was differently administered in the time of the law, and in the time of the gospel (2 Cor. 3:6, 7, 8, 9.): under the law, it was administered by promises, prophecies, sacrifices, circumcision, the paschal lamb, and other types and ordinances delivered to the people of the Jews, all fore-signifying Christ to come (Heb. 8, 9, 10 chapters; Rom. 4:11; Col. 2:11, 12; 1 Cor. 5:7): which were, for that time, sufficient and efficacious, through the operation of the Spirit, to instruct and build up the elect in faith in the promised Messiah (1 Cor. 10:1, 2, 3, 4; Heb. 11:13; John 8:56), by whom they had full remission of sins, and eternal salvation; and is called, the Old Testament (Gal. 3:7, 8, 9, 14)."
            },
            {
              "id": 6,
              "text": "Under the gospel, when Christ, the substance (Col. 2:17), was exhibited, the ordinances in which this covenant is dispensed are the preaching of the Word, and the administration of the sacraments of Baptism and the Lord’s Supper (Matt. 28:19, 20; 1 Cor. 11:23, 24, 25): which, though fewer in number, and administered with more simplicity, and less outward glory; yet, in them, it is held forth in more fulness, evidence, and spiritual efficacy (Heb. 12:22–28; Jer. 31:33, 34), to all nations, both Jews and Gentiles (Matt. 28:19; Eph. 2:15, 16, 17, 18, 19); and is called the New Testament (Luke 22:20). There are not therefore two covenants of grace, differing in substance, but one and the same, under various dispensations (Gal. 3:14, 16; Rom 3:21, 22, 23, 30; Ps. 32:1 with Rom. 4:3, 6, 16, 17, 23, 24; Heb. 13:8; Acts 15:11)."
            }
          ]
        },
        {
          "id": 8,
          "title": "Of Christ the Mediator",
          "sections": [
            {
              "id": 1,
              "text": "It pleased God, in His eternal purpose, to choose and ordain the Lord Jesus, His only begotten Son, to be the Mediator between God and man (Isa. 42:1; 1 Pet. 1:19, 20; John 3:16; 1 Tim. 2:5); the Prophet (Acts 3:22), Priest (Heb. 5:5, 6), and King (Ps. 2:6; Luke 1:33), the Head and Saviour of His Church (Eph. 5:23), the Heir of all things (Heb. 1:2), and Judge of the world (Acts 17:31): unto whom He did from all eternity give a people, to be His seed (John 17:6; Ps. 22:30, Isa. 53:10), and to be by Him in time redeemed, called, justified, sanctified, and glorified (1 Tim. 2:6; Isa. 55:4, 5; 1 Cor. 1:30)."
            },
            {
              "id": 2,
              "text": "The Son of God, the second person in the Trinity, being very and eternal God, of one substance and equal with the Father, did, when the fulness of time was come, take upon Him man’s nature (John 1:1, 14; 1 John 5:20; Phil. 2:6; Gal. 4:4), with all the essential properties and common infirmities thereof, yet without sin (Heb. 2:14, 16, 17; Heb. 4:15): being conceived by the power of the Holy Ghost, in the womb of the virgin Mary, of her substance (Luke 1:27, 31, 35; Gal. 4:4). So that two whole, perfect, and distinct natures, the Godhead and the manhood, were inseparably joined together in one person, without conversion, composition, or confusion (Luke 1:35; Col. 2:9; Rom. 9:5; 1 Pet. 3:18; 1 Tim. 3:16). Which person is very God, and very man, yet one Christ, the only Mediator between God and man (Rom. 1:3, 4; 1 Tim. 2:5)."
            },
            {
              "id": 3,
              "text": "The Lord Jesus, in His human nature thus united to the divine, was sanctified and anointed with the Holy Spirit, above measure (Ps. 45:7; John 3:34), having in Him all the treasures of wisdom and knowledge (Col. 2:3); in whom it pleased the Father that all fulness should dwell (Col. 1:19); to the end that, being holy, harmless, undefiled, and full of grace and truth (Heb. 7:26; John 1:14), He might be thoroughly furnished to execute the office of a mediator and surety (Acts 10:38; Heb. 12:24; Heb. 7:22). Which office He took not unto Himself, but was thereunto called by His Father (Heb. 5:4, 5), who put all power and judgment into His hand, and gave Him commandment to execute the same (John 5:22, 27; Matt. 28:18; Acts 2:36)."
            },
            {
              "id": 4,
              "text": "This office the Lord Jesus did most willingly undertake (Ps. 40:7, 8 with Heb. 10:5–10; John 10:18; Phil. 2:8); which that He might discharge, He was made under the law (Gal. 4:4), and did perfectly fulfil it (Matt. 3:15; Matt. 5:17), endured most grievous torments immediately in His soul (Matt. 26:37, 38; Luke 22:44; Matt. 27:46), and most painful sufferings in His body (Matt. 26, 27 chapters); was crucified, and died (Phil. 2:8); was buried, and remained under the power of death; yet saw no corruption (Acts. 2:23, 24, 27; Acts 13:37; Rom. 6:9). On the third day He arose from the dead (1 Cor. 15:3, 4), with the same body in which He suffered (John 20:25, 27), with which also he ascended into heaven, and there sitteth at the right hand of His Father (Mark 16:19), making intercession (Rom. 8:34; Heb. 9:24; Heb. 7:25), and shall return to judge men and angels at the end of the world (Rom. 14:9, 10; Acts 1:11; Acts 10:42; Matt. 13:40, 41, 42; Jude 6; 2 Pet. 2:4)."
            },
            {
              "id": 5,
              "text": "The Lord Jesus, by His perfect obedience, and sacrifice of Himself, which He, through the eternal Spirit, once offered up unto God, hath fully satisfied the justice of His Father (Rom. 5:19; Heb. 9:14, 16; Heb. 10:14; Eph. 5:2; Rom. 3:25, 26); and purchased, not only reconciliation, but an everlasting inheritance in the kingdom of heaven, for all those whom the Father hath given unto Him (Dan. 9:24, 26; Col. 1:19, 20; Eph. 1:11, 14; John 17:2; Heb. 9:12, 15)."
            },
            {
              "id": 6,
              "text": "Although the work of redemption was not actually wrought by Christ till after His incarnation, yet the virtue, efficacy, and benefits thereof were communicated unto the elect in all ages successively from the beginning of the world, in and by those promises, types, and sacrifices, wherein He was revealed, and signified to be the seed of the woman which should bruise the serpent’s head; and the Lamb slain from the beginning of the world: being yesterday and to-day the same, and forever (Gal. 4:4, 5; Gen. 3:15; Rev. 13:8; Heb. 13:8)."
            },
            {
              "id": 7,
              "text": "Christ, in the work of mediation, acteth according to both natures, by each nature doing that which is proper to itself (Heb. 9:14; 1 Pet. 3:18): yet, by reason of the unity of the person, that which is proper to one nature, is sometimes in Scripture attributed to the person denominated by the other nature (Acts 20:28; John 3:13; 1 John 3:16)."
            },
            {
              "id": 8,
              "text": "To all those for whom Christ hath purchased redemption, He doth certainly and effectually apply and communicate the same (John 6:37, 39; John 10:15, 16), making intercession for them (1 John 2:1, 2; Rom. 8:34), and revealing unto them, in and by the Word, the mysteries of salvation (John 15:13, 15; Eph. 1:7, 8, 9; John 17:6), effectually persuading them by His Spirit to believe and obey, and governing their hearts by His Word and Spirit (John 14:26; Heb. 12:2; 2 Cor. 4:13; Rom. 8:9, 14; Rom. 15:18, 19; John 17:17); overcoming all their enemies by His almighty power and wisdom, in such manner, and ways, as are most consonant to His wonderful and unsearchable dispensation (Ps. 110:1; 1 Cor. 15:25, 26; Mal. 4:2, 3; Col. 2:15)."
            }
          ]
        },
        {
          "id": 9,
          "title": "Of Free Will",
          "sections": [
            {
              "id": 1,
              "text": "God hath endued the will of man with that natural liberty, that is neither forced, nor by any absolute necessity of nature determined to good or evil (Matt. 17:12; James 1:14; Deut. 30:19)."
            },
            {
              "id": 2,
              "text": "Man, in his state of innocency, had freedom and power to will and to do that which was good, and well pleasing to God (Eccles. 7:29; Gen. 1:26); but yet, mutably, so that he might fall from it (Gen. 2:16, 17; Gen. 3:6)"
            },
            {
              "id": 3,
              "text": "Man, by his fall into a state of sin, hath wholly lost all ability of will to any spiritual good accompanying salvation (Rom. 5:6; Rom 8:7; John 15:5): so as, a natural man, being altogether averse from that good (Rom. 3:10, 12), and dead in sin (Eph. 2:1, 5; Col. 2:13), is not able, by his own strength, to convert himself, or to prepare himself thereunto (John 6:44, 65; Eph. 2:2, 3, 4, 5; 1 Cor. 2:14; Titus 3:3, 4, 5)."
            },
            {
              "id": 4,
              "text": "When God converts a sinner, and translates him into the state of grace, He freeth him from his natural bondage under sin (Col. 1:13; John 8:34, 36); and, by His grace alone, enables him freely to will and to do that which is spiritually good (Phil. 2:13; Rom. 6:18, 22); yet so, as that by reason of his remaining corruption, he doth not perfectly, nor only, will that which is good, but doth also will that which is evil (Gal. 5:17; Rom. 7:15, 18, 19, 21, 23)."
            },
            {
              "id": 5,
              "text": "The will of man is made perfectly and immutably free to do good alone, in the state of glory only (Eph. 4:13; Heb. 12:23; 1 John 3:2; Jude 24)."
            }
          ]
        },
        {
          "id": 10,
          "title": "Of Effectual Calling",
          "sections": [
            {
              "id": 1,
              "text": "All those whom God hath predestinated unto life, and those only, He is pleased in His appointed and accepted time effectually to call (Rom. 8:30; Rom. 11:7; Eph. 1:10, 11), by His Word and Spirit (2 Thess. 2:13, 14; 2 Cor. 3:3, 6), out of that state of sin and death, in which they are by nature, to grace and salvation by Jesus Christ (Rom. 8:2; Eph. 2:1, 2, 3, 4, 5; 2 Tim. 1:9, 10); enlightening their minds spiritually and savingly to understand the things of God (Acts 26:18; 1 Cor. 2:10, 12; Eph. 1:17, 18), taking away their heart of stone, and giving unto them a heart of flesh (Ezek. 36:26); renewing their wills, and, by His almighty power determining them to that which is good (Ezek. 11:19; Phil. 2:13; Deut. 30:6; Ezek. 36:27), and effectually drawing them to Jesus Christ (Eph. 1:19; John 6:44, 45): yet so, as they come most freely, being made willing by His grace (Song. 1:4; Ps. 110:3; John 6:37; Rom. 6:16, 17, 18)."
            },
            {
              "id": 2,
              "text": "This effectual call is of God’s free and special grace alone, not from anything at all foreseen in man (2 Tim. 1:9; Tit. 3:4, 5; Eph. 2:4, 5, 8, 9; Rom. 9:11), who is altogether passive therein, until being quickened and renewed by the Holy Spirit (1 Cor. 2:14; Rom. 8:7; Eph. 2:5), he is thereby enabled to answer this call, and to embrace the grace offered and conveyed in it (John 6:37; Ezek. 36:27; John 5:25)."
            },
            {
              "id": 3,
              "text": "Elect infants, dying in infancy, are regenerated, and saved by Christ through the Spirit (Luke 18:15, 16, and Acts 2:38, 39 and John 3:3, 5 and 1 John 5:12 & Rom. 8:9 compared), who worketh when, and where, and how He pleaseth (John 3:8): so also, are all other elect persons who are uncapable of being outwardly called by the ministry of the Word (1 John 5:12; Acts 4:12)."
            },
            {
              "id": 4,
              "text": "Others, not elected, although they may be called by the ministry of the Word (Matt. 22:14), and may have some common operations of the Spirit (Matt. 7:22; Matt. 13:20, 21; Heb. 6:4, 5), yet they never truly come unto Christ, and therefore cannot be saved (John 6:64, 65, 66; John 8:24): much less can men, not professing the Christian religion, be saved in any other way whatsoever, be they never so diligent to frame their lives according to the light of nature, and the law of that religion they do profess (Acts 4:12; John 14:6; Eph. 2:12; John 4:22; John 17:3). And to assert and maintain that they may, is very pernicious, and to be detested (2 John 9, 10, 11; 1 Cor. 16:22; Gal. 1:6, 7, 8)."
            }
          ]
        },
        {
          "id": 11,
          "title": "Of Justification",
          "sections": [
            {
              "id": 1,
              "text": "Those whom God effectually calleth, He also freely justifieth (Rom. 8:30; Rom. 3:24); not by infusing righteousness into them, but by pardoning their sins, and by accounting and accepting their persons as righteous, not for anything wrought in them, or done by them, but for Christ’s sake alone; nor by imputing faith itself, the act of believing, or any other evangelical obedience to them, as their righteousness, but by imputing the obedience and satisfaction of Christ unto them (Rom. 4:5, 6, 7, 8; 2 Cor. 5:19, 21; Rom. 3:22, 24, 25, 27, 28; Tit. 3:5, 7; Eph. 1:7; Jer. 23:6; 1 Cor. 1:30, 31; Rom. 5:17, 18, 19), they receiving and resting on Him and His righteousness by faith; which faith they have not of themselves, it is the gift of God (Acts 10:43; Gal. 2:16; Phil. 3:19; Acts 13:38, 39; Eph. 2:7, 8)."
            },
            {
              "id": 2,
              "text": "Faith, thus receiving and resting on Christ and His righteousness, is the alone instrument of justification (John 1:12; Rom. 3:28; Rom. 5:1); yet is it not alone in the person justified, but is ever accompanied with all other saving graces, and is no dead faith, but worketh by love (Jam. 2:17, 22, 26; Gal. 5:6)."
            },
            {
              "id": 3,
              "text": "Christ, by His obedience and death, did fully discharge the debt of all those that are thus justified, and did make a proper, real, and full satisfaction to His Father’s justice in their behalf (Rom. 5:8, 9, 10, 19; 1 Tim. 2:5, 6; Heb. 10:10, 14; Dan. 9:24, 26; Isa. 53:4, 5, 6, 10, 11, 12). Yet, inasmuch as He was given by the Father for them (Rom. 8:32); and His obedience and satisfaction accepted in their stead (2 Cor. 5:21; Matt. 3:17; Eph. 5:2); and both freely, not for anything in them; their justification is only of free grace (Rom. 3:24; Eph. 1:7); that both the exact justice, and rich grace of God, might be glorified in the justification of sinners (Rom. 3:26; Eph. 2:7)."
            },
            {
              "id": 4,
              "text": "God did, from all eternity, decree to justify all the elect (Gal. 3:8; 1 Pet. 1:2, 19, 20; Rom. 8:30), and Christ did, in the fulness of time, die for their sins, and rise again for their justification (Gal. 4:4; 1 Tim. 2:6; Rom. 4:25): nevertheless, they are not justified, until the Holy Spirit doth, in due time, actually apply Christ unto them (Col. 1:21, 22; Gal. 2:16; Tit. 3:3, 4, 5, 6, 7)."
            },
            {
              "id": 5,
              "text":  "God doth continue to forgive the sins of those that are justified (Matt. 6:12; 1 John 1:7, 9; 1 John 2:1, 2): and although they can never fall from the state of justification (Luke 22:32; John 10:28; Heb. 10:14); yet they may, by their sins, fall under God’s fatherly displeasure, and not have the light of His countenance restored unto them, until they humble themselves, confess their sins, beg pardon, and renew their faith and repentance (Ps. 89:31, 32, 33; Ps. 51:7, 8, 9, 10, 11, 12; Ps. 32:5; Matt. 26:75; 1 Cor. 11:30, 32; Luke 1:20)."
            },
            {
              "id": 6,
              "text": "The justification of believers under the old testament was, in all these respects, one and the same with the justification of believers under the new testament (Gal. 3:9, 13, 14; Rom. 4:22, 23, 24; Heb. 13:8)."
            }
          ]
        },
        {
          "id": 12,
          "title": "Of Adoption",
          "text": "All those that are justified, God vouchsafeth, in and for His only Son Jesus Christ, to make partakers of the grace of adoption (Eph. 1:5): by which they are taken into the number, and enjoy the liberties and privileges of the children of God (Gal. 4:4, 5; Rom. 8:17; John 1:12), have His name put upon them (Jer. 14:9; 2 Cor. 6:18; Rev. 3:12), receive the spirit of adoption (Rom. 8:15), have access to the throne of grace with boldness (Eph. 3:12; Rom. 5:2), are enabled to cry, Abba, Father (Gal. 4:6), are pitied (Ps. 103:13), protected (Prov. 14:26), provided for (Matt. 6:30, 32; 1 Pet. 5:7), and chastened by Him as by a Father (Heb. 12:6); yet never cast off (Lam. 3:31), but sealed to the day of redemption (Eph. 4:30), and inherit the promises (Heb. 6:12), as heirs of everlasting salvation (1 Pet. 1:3, 4; Heb. 1:14)."
        },
        {
          "id": 13,
          "title": "Of Sanctification",
          "sections": [
            {
              "id": 1,
              "text": "They who are once effectually called and regenerated, having a new heart and a new spirit created in them, are further sanctified, really and personally, through the virtue of Christ’s death and resurrection (1 Cor. 6:11; Acts 20:32; Phil. 3:10; Rom. 6:5, 6), by His Word and Spirit dwelling in them (John 17:17; Eph. 5:26; 2 Thess. 2:13): the dominion of the whole body of sin is destroyed (Rom. 6:6, 14), and the several lusts thereof are more and more weakened and mortified (Gal. 5:24; Rom. 8:13); and they more and more quickened and strengthened in all saving graces (Col. 1:11; Eph. 3:16, 17, 18, 19), to the practice of true holiness, without which no man shall see the Lord (2 Cor. 7:1; Heb. 12:14)."
            },
            {
              "id": 2,
              "text": "This sanctification is throughout, in the whole man (1 Thess. 5:23); yet imperfect in this life, there abiding still some remnants of corruption in every part (1 John 1:10; Rom. 7:18, 23; Phil. 3:12): whence ariseth a continual and irreconcilable war; the flesh lusting against the Spirit, and the Spirit against the flesh (Gal. 5:17; 1 Pet. 2:11)."
            },
            {
              "id": 3,
              "text": "In which war, although the remaining corruption, for a time, may much prevail (Rom. 7:23); yet through the continual supply of strength from the sanctifying Spirit of Christ, the regenerate part doth overcome (Rom. 6:14; 1 John 5:4; Eph. 4:15, 16); and so, the saints grow in grace (2 Pet. 3:18; 2 Cor. 3:18), perfecting holiness in the fear of God (2 Cor. 7:1)."
            }
          ]
        },
        {
          "id": 14,
          "title": "Of Saving Faith",
          "sections": [
            {
              "id": 1,
              "text": "The grace of faith, whereby the elect are enabled to believe to the saving of their souls (Heb. 10:39), is the work of the Spirit of Christ in their hearts (2 Cor. 4:13; Eph. 1:17, 18, 19; Eph. 2:8); and is ordinarily wrought by the ministry of the Word (Rom. 10:14, 17): by which also, and by the administration of the sacraments, and prayer, it is increased and strengthened (1 Pet. 2:2; Acts 20:32; Rom. 4:11; Luke 17:5; Rom. 1:16, 17)."
            },
            {
              "id": 2,
              "text": "By this faith, a Christian believeth to be true whatsoever is revealed in the Word, for the authority of God Himself speaking therein (John 4:42; 1 Thess. 2:13; 1 John 5:10; Acts 24:14); and acteth differently upon that which each particular passage thereof containeth; yielding obedience to the commands (Rom. 16:26), trembling at the threatenings (Isa. 66:2), and embracing the promises of God for this life, and that which is to come (Heb. 11:13; 1 Tim. 4:8). But the principal acts of saving faith are accepting, receiving, and resting upon Christ alone for justification, sanctification, and eternal life, by virtue of the covenant of grace (John 1:12; Acts 16:31; Gal. 2:20; Acts 15:11)."
            },
            {
              "id": 3,
              "text": "This faith is different in degrees, weak or strong (Heb. 5:13, 14; Rom. 4:19, 20; Matt. 6:30; Matt. 8:10); may be often and many ways assailed, and weakened, but gets the victory (Luke 22:31, 32; Eph. 6:16; 1 John 5:4, 5); growing up in many to the attainment of a full assurance through Christ (Heb. 6:11, 12; Heb. 10:22; Col. 2:2), who is both the author and finisher of our faith (Heb. 12:2)."
            }
          ]
        },
        {
          "id": 15,
          "title": "Of Repentance unto Life",
          "sections": [
            {
              "id": 1,
              "text": "Repentance unto life is an evangelical grace (Zech. 12:10; Acts 11:18), the doctrine whereof is to be preached by every minister of the Gospel, as well as that of faith in Christ (Luke 24:47; Mark 1:15; Acts 20:21)."
            },
            {
              "id": 2,
              "text": "By it, a sinner, out of the sight and sense not only of the danger, but also of the filthiness and odiousness of his sins, as contrary to the holy nature and righteous law of God; and upon the apprehension of his mercy in Christ to such as are penitent, so grieves for, and hates his sins, as to turn from them all unto God (Ezek. 18:30, 31; Ezek. 36:31; Isa. 30:22; Ps. 51:4; Jer. 31:18, 19; Joel 2:12, 13; Amos 5:15; Ps. 119:128; 2 Cor. 7:11), purposing and endeavouring to walk with Him in all the ways of His commandments (Ps. 119:6, 59, 106; Luke 1:6; 2 Kings 23:25)."
            },
            {
              "id": 3,
              "text": "Although repentance be not to be rested in, as any satisfaction for sin, or any cause of the pardon thereof (Ezek. 36:31, 32; Ezek. 16:61, 62, 63), which is the act of God’s free grace in Christ (Hosea 14:2, 4; Rom. 3:24; Eph. 1:7); yet is it of such necessity to all sinners, that none may expect pardon without it (Luke 13:3, 5; Acts 17:30, 31)."
            },
            {
              "id": 4,
              "text": "As there is no sin so small, but it deserves damnation (Rom. 6:23; Rom. 5:12; Matt. 12:36), so there is no sin so great, that it can bring damnation upon those who truly repent (Isa. 55:7; Rom. 8:1; Isa. 1:16, 18)."
            },
            {
              "id": 5,
              "text": "Men ought not to content themselves with a general repentance, but it is every man’s duty to endeavour to repent of his particular sins, particularly (Ps. 19:13; Luke 19:8; 1 Tim. 1:13, 15)."
            },
            {
              "id": 6,
              "text": "As every man is bound to make private confession of his sins to God, praying for the pardon thereof (Ps. 51:4, 5, 7, 9, 14; Ps. 32:5, 6); upon which, and the forsaking of them, he shall find mercy (Prov. 28:13; 1 John 1:9): so, he that scandalizeth his brother, or the Church of Christ, ought to be willing, by a private or public confession, and sorrow for his sin, to declare his repentance to those that are offended (James 5:16; Luke 17:3, 4; Joshua 7:19; Ps. 51 throughout), who are thereupon to be reconciled to him, and in love to receive him (2 Cor. 2:8)."
            }
          ]
        },
        {
          "id": 16,
          "title": "Of Good Works",
          "sections": [
            {
              "id": 1,
              "text": "Good works are only such as God hath commanded in His holy Word (Micah 6:8; Rom. 12:2; Heb. 13:21), and not such as, without the warrant thereof, are devised by men, out of blind zeal, or upon any pretence of good intention (Matt. 15:9; Isa. 29:13; 1 Pet. 1:18; Rom. 10:2; John 16:2; 1 Sam. 15:21, 22, 23)."
            },
            {
              "id": 2,
              "text": "These good works, done in obedience to God’s commandments, are the fruits and evidences of a true and lively faith (James 2:18, 22): and by them believers manifest their thankfulness (Ps. 116:12, 13; 1 Pet. 2:9), strengthen their assurance (1 John 2:3, 5; 2 Pet. 1:5, 6, 7, 8, 9, 10), edify their brethren (2 Cor. 9:2; Matt. 5:16), adorn the profession of the Gospel (Tit. 2:5, 9, 10, 11, 12; 1 Tim. 6:1), stop the mouths of the adversaries (1 Pet. 2:15), and glorify God (1 Pet. 2:12; Phil. 1:11; John 15:8), whose workmanship they are, created in Christ Jesus thereunto (Eph. 2:10); that, having their fruit unto holiness, they may have the end, eternal life (Rom. 6:22)."
            },
            {
              "id": 3,
              "text": "Their ability to do good works is not at all of themselves, but wholly from the Spirit of Christ (John 15:4, 5; Ezek. 36:26, 27). And that they may be enabled thereunto, besides the graces they have already received, there is required an actual influence of the same Holy Spirit, to work in them to will and to do of His good pleasure (Phil. 2:13; Phil. 4:13; 2 Cor. 3:5): yet are they not hereupon to grow negligent, as if they were not bound to perform any duty, unless upon a special motion of the Spirit; but they ought to be diligent in stirring up the grace of God that is in them (Phil. 2:12; Heb. 6:11, 12; 2 Pet. 1:3, 5, 10, 11; Isa. 64:7; 2 Tim. 1:6; Acts 26:6, 7; Jude 20, 21)."
            },
            {
              "id": 4,
              "text": "They, who in their obedience attain to the greatest height which is possible in this life, are so far from being able to supererogate, and to do more than God requires, as that they fall short of much which in duty they are bound to do (Luke 17:10; Neh. 13:22; Job 9:2, 3; Gal. 5:17)."
            },
            {
              "id": 5,
              "text": "We cannot, by our best works, merit pardon of sin, or eternal life at the hand of God, by reason of the great disproportion that is between them and the glory to come; and the infinite distance that is between us and God, whom, by them, we can neither profit, nor satisfy for the debt of our former sins (Rom. 3:20; Rom. 4:2, 4, 6; Eph. 2:8, 9; Tit. 3:5, 6, 7; Rom. 8:18; Ps. 16:2; Job 22:2, 3; Job 35:7, 8), but when we have done all we can, we have done but our duty, and are unprofitable servants (Luke 17:10); and because, as they are good, they proceed from His Spirit (Gal. 5:22, 23); and as they are wrought by us, they are defiled, and mixed with so much weakness and imperfection, that they cannot endure the severity of God’s judgment (Isa. 64:6; Gal. 5:17; Rom. 7:15, 18; Ps. 143:2; Ps. 130:3)."
            },
            {
              "id": 6,
              "text": "Yet notwithstanding, the persons of believers being accepted through Christ, their good works also are accepted in Him (Eph. 1:6; 1 Pet. 2:5; Exod. 28:38; Gen. 4:4 with Heb. 11:4), not as though they were in this life wholly unblamable and unreproveable in God’s sight (Job. 9:20; Ps. 143:2); but that He, looking upon them in His Son, is pleased to accept and reward that which is sincere, although accompanied with many weaknesses and imperfections (Heb. 13:20, 21; 2 Cor. 8:12; Heb. 6:10; Matt. 25:21, 23)."
            },
            {
              "id": 7,
              "text": "Works done by unregenerate men, although, for the matter of them, they may be things which God commands, and of good use both to themselves and others (2 Kings 10:30, 31; 1 Kings 21:27, 29; Phil. 1:15, 16, 18): yet, because they proceed not from a heart purified by faith (Gen. 4:5 with Heb. 11:4; Heb. 11:6); nor are done in a right manner according to the Word (1 Cor. 13:3; Isa. 1:12); nor to a right end, the glory of God (Matt. 6:2, 5, 16); they are therefore sinful, and cannot please God, or make a man meet to receive grace from God (Hag. 2:14; Tit. 1:15; Amos 5:22, 23; Hosea 1:4; Rom. 9:16; Titus 3:5). And yet, their neglect of them is more sinful, and displeasing unto God (Ps. 14:4; Ps. 36:3; Job 21:14, 15; Matt. 25:41, 42, 43, 45; Matt. 23:23)."
            }
          ]
        },
        {
          "id": 17,
          "title": "Of the Perseverance of the Saints",
          "sections": [
            {
              "id": 1,
              "text": "They, whom God hath accepted in His Beloved, effectually called, and sanctified by His Spirit, can neither totally, nor finally, fall away from the state of grace: but shall certainly persevere therein to the end, and be eternally saved (Phil. 1:6; 2 Pet. 1:10; John 10:28, 29; 1 John 3:9; 1 Pet. 1:5, 9)."
            },
            {
              "id": 2,
              "text": "This perseverance of the saints depends not upon their own free will, but upon the immutability of the decree of election, flowing from the free and unchangeable love of God the Father (2 Tim. 2:18, 19; Jer. 31:3); upon the efficacy of the merit and intercession of Jesus Christ (Heb. 10:10, 14; Heb. 13:20, 21; Heb. 9:12, 13, 14, 15; Rom. 8:33 to the end; John 17:11, 24; Luke 22:32; Heb. 7:25); the abiding of the Spirit, and of the seed of God within them (John 14:16, 17; 1 John 2:27; 1 John 3:9); and the nature of the covenant of grace (Jer. 32:40): from all which ariseth also the certainty and infallibility thereof (John 10:28; 2 Thess. 3:3; 1 John 2:19)."
            },
            {
              "id": 3,
              "text": "Nevertheless, they may, through the temptations of Satan and of the world, the prevalency of corruption remaining in them, and the neglect of the means of their preservation, fall into grievous sins (Matt. 26:70, 72, 74); and, for a time, continue therein (Ps. 51 title and ver. 14): whereby they incur God’s displeasure (Isa. 64:5, 7, 9; 2 Sam. 11:27), and grieve His Holy Spirit (Eph. 4:30), come to be deprived of some measure of their graces and comforts (Ps. 51:8, 10, 12; Rev. 2:4; Song. 5:2, 3, 4, 6), have their hearts hardened (Isa. 63:17; Mark 6:52; Mark 16:14), and their consciences wounded (Ps. 32:3, 4; Ps. 51:8), hurt and scandalize others (2 Sam. 12:14), and bring temporal judgments upon themselves (Ps. 89:31, 32; 1 Cor. 11:32)."
            }
          ]
        },
        {
          "id": 18,
          "title": "Of the Assurance of Grace and Salvation",
          "sections": [
            {
              "id": 1,
              "text": "Although hypocrites and other unregenerate men may vainly deceive themselves with false hopes, and carnal presumptions of being in the favour of God, and estate of salvation (Job 8:13, 14; Mic. 3:11; Deut. 29:19; John 8:41); which hope of theirs shall perish (Matt. 7:22, 23): yet such as truly believe in the Lord Jesus, and love Him in sincerity, endeavouring to walk in all good conscience before Him, may, in this life, be certainly assured that they are in the state of grace (1 John 2:3; 1 John 3:14, 18, 19, 21, 24; 1 John 5:13), and may rejoice in the hope of the glory of God, which hope shall never make them ashamed (Rom. 5:2, 5)."
            },
            {
              "id": 2,
              "text": "This certainty is not a bare conjectural and probable persuasion, grounded upon a fallible hope (Heb. 6:11, 19); but an infallible assurance of faith, founded upon the divine truth of the promises of salvation (Heb. 6:17, 18), the inward evidence of those graces unto which these promises are made (2 Pet. 1:4, 5, 10, 11; 1 John 2:3; 1 John 3:14; 2 Cor. 1:12), the testimony of the Spirit of adoption witnessing with our spirits that we are the children of God (Rom. 8:15, 16): which Spirit is the earnest of our inheritance, whereby we are sealed to the day of redemption (Eph. 1:13, 14; Eph. 4:30; 2 Cor. 1:21, 22)."
            },
            {
              "id": 3,
              "text": "This infallible assurance doth not so belong to the essence of faith, but that a true believer may wait long, and conflict with many difficulties before he be partaker of it (1 John 5:13; Isa. 50:10; Mark 9:24; Ps. 88 throughout; Ps. 77:1–12): yet, being enabled by the Spirit to know the things which are freely given him of God, he may without extraordinary revelation, in the right use of ordinary means, attain thereunto (1 Cor. 2:12; 1 John 4:13; Heb. 6:11, 12; Eph. 3:17, 18, 19). And therefore it is the duty of everyone to give all diligence to make his calling and election sure (2 Pet. 1:10); that thereby his heart may be enlarged in peace and joy in the Holy Ghost, in love and thankfulness to God, and in strength and cheerfulness in the duties of obedience, the proper fruits of this assurance (Rom. 5:1, 2, 5; Rom. 14:17; Rom. 15:13; Eph. 1:3, 4; Ps. 4:6, 7; Ps. 119:32): so far is it from inclining men to looseness (1 John 2:1, 2; Rom. 6:1, 2; Tit. 2:11, 12, 14; 2 Cor. 7:1; Rom. 8:1, 12; 1 John 3:2, 3; Ps. 130:4; 1 John 1:6, 7)."
            },
            {
              "id": 4,
              "text": "True believers may have the assurance of their salvation divers ways shaken, diminished, and intermitted; as, by negligence in preserving of it, by falling into some special sin, which woundeth the conscience and grieveth the Spirit; by some sudden or vehement temptation, by God’s withdrawing the light of His countenance, and suffering even such as fear Him to walk in darkness and to have no light (Song. 5:2, 3, 6; Ps. 51:8, 12, 14; Eph. 4:30, 31; Ps. 77:1–10; Matt. 26:69, 70, 71, 72; Ps. 31:22; Ps. 88 throughout; Isa. 50:10): yet are they never so utterly destitute of that seed of God, and life of faith, that love of Christ and the brethren, that sincerity of heart, and conscience of duty, out of which, by the operation of the Spirit, this assurance may, in due time, be revived (1 John 3:9; Luke 22:32; Job 13:15; Ps. 73:15; Ps. 51:8, 12; Isa. 50:10); and by the which, in the mean time, they are supported from utter despair (Mic. 7:7, 8, 9; Jer. 32:40; Isa. 54:7, 8, 9, 10; Ps. 22:1; Ps. 88 throughout)."
            }
          ]
        },
        {
          "id": 19,
          "title": "Of the Law of God",
          "sections": [
            {
              "id": 1,
              "text": "God gave to Adam a law, as a covenant of works, by which He bound him and all his posterity to personal, entire, exact, and perpetual obedience; promised life upon the fulfilling, and threatened death upon the breach of it: and endued him with power and ability to keep it (Gen. 1:26, 27 with Gen. 2:17; Rom. 2:14, 15; Rom. 10:5; Rom. 5:12, 19; Gal. 3:10, 12; Eccles. 7:29; Job 28:28)."
            },
            {
              "id": 2,
              "text": "This law, after his fall, continued to be a perfect rule of righteousness, and, as such, was delivered by God upon Mount Sinai, in ten commandments, and written in two tables (James 1:25; James 2:8, 10, 11, 12; Rom. 13:8, 9; Deut. 5:32; Deut. 10:4; Ex. 34:1): the four first commandments containing our duty towards God; and the other six our duty to man (Matt. 22:37, 38, 39, 40)."
            },
            {
              "id": 3,
              "text": "Beside this law, commonly called moral, God was pleased to give to the people of Israel, as a church under age, ceremonial laws, containing several typical ordinances, partly of worship, prefiguring Christ, His graces, actions, sufferings, and benefits (Heb. 9 chap.; Heb. 10:1; Gal. 4:1, 2, 3; Col. 2:17); and partly holding forth divers instructions of moral duties (1 Cor. 5:7; 2 Cor. 6:17; Jude 23). All which ceremonial laws are now abrogated, under the new testament (Col. 2:14, 16, 17; Dan. 9:27; Eph. 2:15, 16)."
            },
            {
              "id": 4,
              "text": "To them also, as a body politic, He gave sundry judicial laws, which expired together with the State of that people; not obliging any other now, further than the general equity thereof may require (Ex. 21 chap.; Ex. 22:1–29; Gen. 49:10 with 1 Pet. 2:13, 14; Matt. 5:17, with Matt. 5:38, 39; 1 Cor. 9:8, 9, 10)."
            },
            {
              "id": 5,
              "text": "The moral law doth for ever bind all, as well justified persons as others, to the obedience thereof (Rom. 13:8, 9, 10; Eph. 6:2; 1 John 2:3, 4, 7, 8); and that, not only in regard of the matter contained in it, but also in respect of the authority of God the Creator, who gave it (James 2:10, 11): neither doth Christ, in the Gospel, any way dissolve, but much strengthen this obligation (Matt. 5:17, 18, 19; James 2:8; Rom. 3:31)."
            },
            {
              "id": 6,
              "text": "Although true believers be not under the law, as a covenant of works, to be thereby justified, or condemned (Rom. 6:14; Gal. 2:16; Gal. 3:13; Gal. 4:4, 5; Acts 13:39; Rom. 8:1); yet is it of great use to them, as well as to others; in that, as a rule of life informing them of the will of God, and their duty, it directs, and binds them to walk accordingly (Rom. 7:12, 22, 25; Ps. 119:4, 5, 6; 1 Cor. 7:19; Gal. 5:14, 16, 18, 19, 20, 21, 22, 23); discovering also the sinful pollutions of their nature, hearts, and lives (Rom. 7:7; Rom. 3:20); so as, examining themselves thereby, they may come to further conviction of, humiliation for, and hatred against sin (James 1:23, 24, 25; Rom. 7:9, 14, 24); together with a clearer sight of the need they have of Christ, and the perfection of His obedience (Gal. 3:24; Rom. 7:24, 25; Rom. 8:3, 4). It is likewise of use to the regenerate, to restrain their corruptions, in that it forbids sin (Jam. 2:11; Ps. 119:101, 104, 128): and the threatenings of it serve to show what even their sins deserve; and what afflictions, in this life, they may expect for them, although freed from the curse thereof threatened in the law (Ezra 9:13, 14; Ps. 89:30, 31, 32, 33, 34). The promises of it, in like manner, show them God’s approbation of obedience, and what blessings they may expect upon the performance thereof (Lev. 26:1–14 with 2 Cor. 6:16; Eph. 6:2, 3; Ps. 37:11 with Matt. 5:5; Ps. 19:11); although not as due to them by the law, as a covenant of works (Gal. 2:16; Luke 17:10). So as, a man’s doing good, and refraining from evil, because the law encourageth to the one and deterreth from the other, is no evidence of his being under the law; and not under grace (Rom. 6:12, 14; 1 Pet. 3:8, 9, 10, 11, 12, with Ps. 34:12, 13, 14, 15, 16; Heb. 12:28, 29)."
            },
            {
              "id": 7,
              "text": "Neither are the forementioned uses of the law contrary to the grace of the Gospel, but do sweetly comply with it (Gal. 3:21); the Spirit of Christ subduing and enabling the will of man to do that, freely and cheerfully, which the will of God, revealed in the law, requireth to be done (Ezek. 36:27; Heb. 8:10 with Jer. 31:33)."
            }
          ]
        },
        {
          "id": 20,
          "title": "Of Christian Liberty, and Liberty of Conscience",
          "sections": [
            {
              "id": 1,
              "text": "The liberty which Christ hath purchased for believers under the Gospel consists in their freedom from the guilt of sin, and condemning wrath of God, the curse of the moral law (Tit. 2:14; 1 Thess. 1:10; Gal. 3:13); and, in their being delivered from this present evil world, bondage to Satan, and dominion of sin (Gal. 1:4; Col. 1:13; Acts 26:18; Rom. 6:14); from the evil of afflictions, the sting of death, the victory of the grave, and everlasting damnation (Rom. 8:28; Ps. 119:71; 1 Cor. 15:54, 55, 56, 57; Rom. 8:1); as also, in their free access to God (Rom. 5:1, 2), and their yielding obedience unto Him, not out of slavish fear, but a child-like love and willing mind (Rom. 8:14, 15; 1 John 4:18). All which were common also to believers under the law (Gal. 3:9, 14). But, under the new testament, the liberty of Christians is further enlarged, in their freedom from the yoke of the ceremonial law, to which the Jewish Church was subjected (Gal. 4:1, 2, 3, 6, 7; Gal. 5:1; Acts 15:10, 11); and in greater boldness of access to the throne of grace (Heb. 4:14, 16; Heb. 10:19, 20, 21, 22), and in fuller communications of the free Spirit of God, than believers under the law did ordinarily partake of (John 7:38, 39; 2 Cor. 3:13, 17, 18)."
            },
            {
              "id": 2,
              "text": "God alone is Lord of the conscience (Jam. 4:12; Rom. 14:4), and hath left it free from the doctrines and commandments of men, which are in any thing contrary to His Word; or beside it, if matters of faith or worship (Acts 4:19; Acts 5:29; 1 Cor. 7:23; Matt. 23:8, 9, 10; 2 Cor. 1:24; Matt. 15:9). So that, to believe such doctrines, or to obey such commands, out of conscience (Col. 2:20, 22, 23; Gal. 1:10; Gal. 2:4, 5; Gal. 5:1), is to betray true liberty of conscience: and the requiring of an implicit faith, and an absolute and blind obedience is to destroy liberty of conscience, and reason also (Rom. 10:17; Rom. 14:23; Isa. 8:20; Acts 17:11; John 4:22; Hos. 5:11; Rev. 13:12, 16, 17; Jer. 8:9)."
            },
            {
              "id": 3,
              "text": "They who, upon pretence of Christian liberty, do practice any sin, or cherish any lust, do thereby destroy the end of Christian liberty, which is, that being delivered out of the hands of our enemies, we might serve the Lord, without fear, in holiness and righteousness before Him, all the days of our life (Gal. 5:13; 1 Pet. 2:16; 2 Pet. 2:19; John 8:34; Luke 1:74, 75)."
            },
            {
              "id": 4,
              "text": "And because the powers which God hath ordained, and the liberty which Christ hath purchased, are not intended by God to destroy, but mutually to uphold and preserve one another; they who, upon pretence of Christian liberty, shall oppose any lawful power, or the lawful exercise of it, whether it be civil or ecclesiastical, resist the ordinance of God (Matt. 12:25; 1 Pet. 2:13, 14, 16; Rom. 13:1–8; Heb. 13:17). And, for their publishing of such opinions, or maintaining of such practices, as are contrary to the light of nature, or to the known principles of Christianity, whether concerning faith, worship, or conversation; or, to the power of godliness; or, such erroneous opinions or practices, as either in their own nature, or in the manner of publishing or maintaining them, are destructive to the external peace and order which Christ hath established in the Church, they may lawfully be called to account, and proceeded against by the censures of the Church (Rom. 1:32 with 1 Cor. 5:1, 5, 11, 13; 2 John 10, 11, and 2 Thess. 3:14, and 1 Tim. 6:3, 4, 5, and Tit. 1:10, 11, 13, and Tit. 3:10 with Matt. 18:15, 16, 17; 1 Tim. 1:19, 20; Rev. 2:2, 14, 15, 20; Rev. 3:9), and by the power of the civil magistrate (Deut. 13:6–12; Rom. 13:3, 4 with 2 John 10, 11; Ezra 7:23, 25, 26, 27, 28; Rev. 17:12, 16, 17; Neh. 13:15, 17, 21, 22, 25, 30; 2 Kings 23:5, 6, 9, 20, 21; 2 Chron. 34:33; 2 Chron. 15:12, 13, 16; Dan. 3:29; 1 Tim. 2:2; Isa. 49:23; Zech. 13:2, 3)."
            }
          ]
        },
        {
          "id": 21,
          "title": "Of Religious Worship and the Sabbath-day",
          "sections": [
            {
              "id": 1,
              "text": "The light of nature showeth that there is a God, who hath lordship and sovereignty over all, is good, and doth good unto all, and is therefore to be feared, loved, praised, called upon, trusted in, and served, with all the heart, and with all the soul, and with all the might (Rom. 1:20; Acts 17:24; Ps. 119:68; Jer. 10:7; Ps. 31:23; Ps. 18:3; Rom. 10:12; Ps. 62:8; Josh. 24:14; Mark 12:33). But the acceptable way of worshipping the true God is instituted by Himself, and so limited by His own revealed will, that He may not be worshipped according to the imaginations and devices of men, or the suggestions of Satan, under any visible representation, or any other way not prescribed in the holy Scripture (Deut. 12:32; Matt. 15:9; Acts 17:25; Matt. 4:9, 10; Deut. 4:15–20; Exod. 20:4, 5, 6; Col. 2:23)."
            },
            {
              "id": 2,
              "text": "Religious worship is to be given to God, the Father, Son, and Holy Ghost; and to Him alone (Matt. 4:10 with John 5:23 and 2 Cor. 13:14); not to angels, saints, or any other creature (Col. 2:18, Rev. 19:10; Rom. 1:25): and since the fall, not without a Mediator; nor in the mediation of any other but of Christ alone (John 14:6; 1 Tim. 2:5; Eph. 2:18; Col. 3:17)."
            },
            {
              "id": 3,
              "text": "Prayer, with thanksgiving, being one special part of religious worship (Phil. 4:6), is by God required of all men (Ps. 65:2): and that it may be accepted, it is to be made in the name of the Son (John 14:13, 14; 1 Pet. 2:5), by the help of His Spirit (Rom. 8:26), according to His will (1 John 5:14), with understanding, reverence, humility, fervency, faith, love, and perseverance (Ps. 47:7; Eccles. 5:1, 2; Heb. 12:28; Gen. 18:27; James 5:16; James 1:6, 7; Mark 11:24; Matt. 6:12, 14, 15; Col. 4:2; Eph. 6:18); and, if vocal, in a known tongue (1 Cor. 14:14)."
            },
            {
              "id": 4,
              "text": "Prayer is to be made for things lawful (1 John 5:14); and for all sorts of men living, or that shall live hereafter (1 Tim. 2:1, 2; John 17:20; 2 Sam. 7:29; Ruth 4:12): but not for the dead (2 Sam. 12:21, 22, 23 with Luke 16:25, 26; Rev. 14:13), nor for those of whom it may be known that they have sinned the sin unto death (1 John 5:16)."
            },
            {
              "id": 5,
              "text": "The reading of the Scriptures with godly fear (Acts 15:21; Rev. 1:3), the sound preaching (2 Tim. 4:2) and conscionable hearing of the Word, in obedience unto God, with understanding, faith and reverence (James 1:22; Acts 10:33; Matt. 13:19; Heb. 4:2; Isa. 66:2); singing of psalms with grace in the heart (Col. 3:16; Eph. 5:19; James 5:13); as also, the due administration and worthy receiving of the sacraments instituted by Christ; are all parts of the ordinary religious worship of God (Matt. 28:19; 1 Cor. 11:23 to 29; Acts 2:42): beside religious oaths (Deut. 6:13 with Neh. 10:29), vows (Isa. 19:21 with Eccles. 5:4, 5), solemn fastings (Joel 2:12; Esther 4:16; Matt. 9:15; 1 Cor. 7:5), and thanksgivings, upon special occasions (Ps. 107 throughout; Esther 9:22), which are, in their several times and seasons, to be used in a holy and religious manner (Heb. 12:28)."
            },
            {
              "id": 6,
              "text": "Neither prayer, nor any other part of religious worship, is now under the Gospel either tied unto, or made more acceptable by any place in which it is performed, or towards which it is directed (John 4:21): but God is to be worshipped everywhere (Mal. 1:11; 1 Tim. 2:8), in spirit and truth (John 4:23, 24); as in private families (Jer. 10:25; Deut. 6:6, 7; Job 1:5; 2 Sam. 6:18, 20; 1 Pet. 3:7; Acts 10:2) daily (Matt. 6:11), and in secret each one by himself (Matt. 6:6; Eph. 6:18); so, more solemnly, in the public assemblies, which are not carelessly or wilfully to be neglected, or forsaken, when God, by His Word or providence, calls thereunto (Isa. 56:6, 7; Heb. 10:25; Prov. 1:20, 21, 24; Prov. 8:34; Acts 13:42; Luke 4:16; Acts 2:42)."
            },
            {
              "id": 7,
              "text": "As it is the law of nature, that, in general, a due proportion of time be set apart for the worship of God; so, in His Word, by a positive, moral, and perpetual commandment, binding all men, in all ages, He hath particularly appointed one day in seven, for a Sabbath, to be kept holy unto Him (Exod. 20:8, 10, 11; Isa. 56:2, 4, 6, 7): which, from the beginning of the world to the resurrection of Christ, was the last day of the week; and, from the resurrection of Christ, was changed into the first day of the week (Gen. 2:2, 3; 1 Cor. 16:1, 2; Acts 20:7), which, in Scripture, is called the Lord’s Day (Rev. 1:10), and is to be continued to the end of the world, as the Christian Sabbath (Exod. 20:8, 10, with Matt. 5:17, 18)."
            },
            {
              "id": 8,
              "text": "This Sabbath is then kept holy unto the Lord, when men, after a due preparing of their hearts, and ordering of their common affairs beforehand, do not only observe an holy rest, all the day, from their own works, words, and thoughts about their worldly employments and recreations (Exod. 20:8; Exod. 16:23, 25, 26, 29, 30; Exod. 31:15, 16, 17; Isa. 58:13; Neh. 13:15, 16, 17, 18, 19, 21, 22), but also are taken up the whole time in the public and private exercises of His worship, and in the duties of necessity and mercy (Isa. 58:13; Matt. 12:1–13)."
            }
          ]
        },
        {
          "id": 22,
          "title": "Of Lawful Oaths and Vows",
          "sections": [
            {
              "id": 1,
              "text": "A lawful oath is a part of religious worship (Deut. 10:20), wherein, upon just occasion, the person swearing solemnly calleth God to witness what he asserteth, or promiseth, and to judge him according to the truth or falsehood of what he sweareth (Exod. 20:7; Lev. 19:12; 2 Cor. 1:23, 2 Chron. 6:22, 23)."
            },
            {
              "id": 2,
              "text": "The name of God only is that by which men ought to swear; and therein it is to be used with all holy fear and reverence (Deut. 6:13). Therefore, to swear vainly or rashly, by that glorious and dreadful Name; or, to swear at all by any other thing, is sinful, and to be abhorred (Exod. 20:7; Jer. 5:7; Matt. 5:34, 37; James 5:12). Yet, as in matters of weight and moment, an oath is warranted by the Word of God, under the New Testament, as well as under the Old (Heb. 6:16; 2 Cor. 1:23; Isa. 65:16); so a lawful oath, being imposed by lawful authority, in such matters ought to be taken (1 Kings 8:31; Neh. 13:25; Ezra 10:5)."
            },
            {
              "id": 3,
              "text": "Whosoever taketh an oath ought duly to consider the weightiness of so solemn an act; and therein to avouch nothing, but what he is fully persuaded is the truth (Exod. 20:7; Jer. 4:2). Neither may any man bind himself by oath to anything but what is good and just, and what he believeth so to be, and what he is able and resolved to perform (Gen. 24:2, 3, 5, 6, 8, 9). Yet is it a sin to refuse an oath touching anything that is good and just, being imposed by lawful authority (Num. 5:19, 21; Neh. 5:12; Exod. 22:7, 8, 9, 10, 11)."
            },
            {
              "id": 4,
              "text": "An oath is to be taken in the plain and common sense of the words, without equivocation, or mental reservation (Jer. 4:2; Ps. 24:4). It cannot oblige to sin: but in anything not sinful, being taken, it binds to performance, although to a man’s own hurt (1 Sam. 25:22, 32, 33, 34; Ps. 15:4). Not is it to be violated, although made to heretics, or infidels (Ezek. 17:16, 18, 19; Josh. 9:18, 19 with 2 Sam. 21:1)."
            },
            {
              "id": 5,
              "text": "A vow is of the like nature with a promissory oath, and ought to be made with the like religious care, and to be performed with the like faithfulness (Isa. 19:21; Eccles. 5:4, 5, 6; Ps. 61:8; Ps. 66:13, 14)."
            },
            {
              "id": 6,
              "text": "It is not to be made to any creature, but to God alone (Ps. 76:11; Jer. 44:25, 26): and that it may be accepted, it is to be made voluntarily, out of faith, and conscience of duty, in way of thankfulness for mercy received, or for the obtaining of what we want; whereby we more strictly bind ourselves to necessary duties; or to other things, so far and so long as they may fitly conduce thereunto (Deut. 23:21, 22, 23; Ps. 50:14; Gen. 28:20, 21, 22; 1 Sam. 1:11; Ps. 66:13, 14; Ps. 132:2, 3, 4, 5)."
            },
            {
              "id": 7,
              "text": "No man may vow to do anything forbidden in the Word of God, or what would hinder any duty therein commanded, or which is not in his own power, and for the performance whereof he hath no promise of ability from God (Acts 23:12, 14; Mark 6:26; Numb. 30:5, 8, 12, 13). In which respects, Popish monastical vows of perpetual single life, professed poverty, and regular obedience, are so far from being degrees of higher perfection, that they are superstitious and sinful snares, in which no Christian may entangle himself (Matt. 19:11, 12; 1 Cor. 7:2, 9; Eph. 4:28; 1 Peter 4:2; 1 Cor. 7:23)."
            }
          ]
        },
        {
          "id": 23,
          "title": "Of the Civil Magistrate",
          "sections": [
            {
              "id": 1,
              "text": "God, the supreme Lord and King of all the world, hath ordained civil magistrates, to be, under Him, over the people, for His own glory, and the public good: and, to this end, hath armed them with the power of the sword, for the defence and encouragement of them that are good, and for the punishment of evil doers (Rom. 13:1, 2, 3, 4; 1 Pet. 2:13, 14)."
            },
            {
              "id": 2,
              "text": "It is lawful for Christians to accept and execute the office of a magistrate, when called thereunto (Prov. 8:15, 16; Rom. 13:1, 2, 4); in the managing whereof, as they ought especially to maintain piety, justice, and peace, according to the wholesome laws of each commonwealth (Ps. 2:10, 11, 12; 1 Tim. 2:2; Ps. 82:3, 4; 2 Sam. 23:3; 1 Pet. 2:13); so for that end, they may lawfully now, under the New Testament, wage war, upon just and necessary occasion (Luke 3:14; Rom. 13:4; Matt. 8:9, 10; Acts 10:1, 2; Rev. 17:14, 16)."
            },
            {
              "id": 3,
              "text": "The civil magistrate may not assume to himself the administration of the Word and sacraments, or the power of the keys of the kingdom of heaven (2 Chron. 26:18 with Matt. 18:17 and Matt. 16:19; 1 Cor. 12:28, 29; Eph. 4:11, 12; 1 Cor. 4:1, 2; Rom. 10:15; Heb. 5:4): yet he hath authority, and it is his duty, to take order, that unity and peace be. preserved in the Church, that the truth of God be kept pure and entire; that all blasphemies and heresies be suppressed; all corruptions and abuses in worship and discipline prevented or reformed; and all the ordinances of God duly settled, administrated, and observed (Isa. 49:23; Ps. 122:9; Ezra 7:23, 25, 26, 27, 28; Lev. 24:16; Deut. 13:5, 6, 12; 1 Kings 18:4; 1 Chron. 13:1–9; 2 Kings 23:1–26; 2 Chron. 34:33; 2 Chron. 15:12, 13). For the better effecting whereof, he hath power to call synods, to be present at them, and to provide that whatsoever is transacted in them be according to the mind of God (2 Chron. 19:8, 9, 10, 11; 2 Chron. 29, 30; Matt. 2:4, 5)."
            },
            {
              "id": 4,
              "text": "It is the duty of people to pray for magistrates (1 Tim. 2:1, 2), to honour their persons (1 Pet. 2:17), to pay them tribute or other dues (Rom. 13:6, 7), to obey their lawful commands, and to be subject to their authority, for conscience’ sake (Rom. 13:5; Tit. 3:1). Infidelity, or difference in religion, doth not make void the magistrates’ just and legal authority, nor free the people from their due obedience to them (1 Pet. 2:13, 14, 16): from which ecclesiastical persons are not exempted (Rom. 13:1; 1 Kings 2:35; Acts 25:9, 10, 11; 2 Pet. 2:1, 10, 11; Jude 8, 9, 10, 11), much less hath the Pope any power and jurisdiction over them in their dominions, or over any of their people; and, least of all, to deprive them of their dominions, or lives, if he shall judge them to be heretics, or upon any other pretence whatsoever (2 Thess. 2:4; Rev. 13:15, 16, 17)."
            }
          ]
        },
        {
          "id": 24,
          "title": "Of Marriage and Divorce",
          "sections": [
            {
              "id": 1,
              "text": "Marriage is to be between one man and one woman: neither is it lawful for any man to have more than one wife, nor for any woman to have more than one husband; at the same time (Gen. 2:24; Matt. 19:5, 6; Prov. 2:17)."
            },
            {
              "id": 2,
              "text": "Marriage was ordained for the mutual help of husband and wife (Gen. 2:18), for the increase of mankind with a legitimate issue, and of the Church with an holy seed (Mal. 2:15); and for preventing of uncleanness (1 Cor. 7:2, 9)."
            },
            {
              "id": 3,
              "text": "It is lawful for all sorts of people to marry, who are able with judgment to give their consent (Heb. 13:4; 1 Tim. 4:3; 1 Cor. 7:36, 37, 38; Gen. 24:57, 58). Yet is it the duty of Christians to marry only in the Lord (1 Cor. 7:39): and therefore such as profess the true reformed religion should not marry with infidels, papists, or other idolaters: neither should such as are godly be unequally yoked, by marrying with such as are notoriously wicked in their life, or maintain damnable heresies (Gen. 34:14; Exod. 34:16; Deut. 7:3, 4; 1 Kings 11:4; Neh. 13:25, 26, 27; Mal. 2:11, 12; 2 Cor. 6:14)."
            },
            {
              "id": 4,
              "text": "Marriage ought not to be within the degrees of consanguinity or affinity forbidden by the Word (Lev. 18; 1 Cor. 5:1; Amos 2:7); nor can such incestuous marriages ever be made lawful by any law of man or consent of parties, so as those persons may live together as man and wife (Mark 6:18; Lev. 18:24, 25, 26, 27, 28). The man may not marry any of his wife’s kindred nearer in blood than he may of his own; nor the woman of her husband’s kindred nearer in blood than of her own (Lev. 20:19, 20, 21)."
            },
            {
              "id": 5,
              "text": "Adultery or fornication committed after a contract, being detected before marriage, giveth just occasion to the innocent party to dissolve that contract (Matt. 1:18, 19, 20). In the case of adultery after marriage, it is lawful for the innocent party to sue out a divorce (Matt. 5:31, 32): and, after the divorce, to marry another, as if the offending party were dead (Matt. 19:9; Rom. 7:2, 3)."
            },
            {
              "id": 6,
              "text": "Although the corruption of man be such as is apt to study arguments unduly to put asunder those whom God hath joined together in marriage: yet nothing but adultery, or such wilful desertion as can no way be remedied by the Church or civil magistrate, is cause sufficient of dissolving the bond of marriage (Matt. 19:8, 9; 1 Cor. 7:15; Matt. 19:6): wherein, a public and orderly course of proceeding is to be observed; and the persons concerned in it not left to their own wills and discretion, in their own case (Deut. 24:1, 2, 3, 4)."
            }
          ]
        },
        {
          "id": 25,
          "title": "Of the Church",
          "sections": [
            {
              "id": 1,
              "text": "The catholic or universal Church which is invisible, consists of the whole number of the elect, that have been, are, or shall be gathered into one, under Christ the Head thereof; and is the spouse, the body, the fulness of Him that filleth all in all (Eph. 1:10, 22, 23; Eph. 5:23, 27, 32; Col. 1:18)."
            },
            {
              "id": 2,
              "text": "The visible Church, which is also catholic or universal under the Gospel (not confined to one nation as before under the law), consists of all those throughout the world that profess the true religion (1 Cor. 1:2; 1 Cor. 12:12, 13; Ps. 2:8; Rev. 7:9; Rom. 15:9, 10, 11, 12); and of their children (1 Cor. 7:14; Acts 2:39; Ezek. 16:20, 21; Rom. 11:16; Gen. 3:15; Gen. 17:7): and is the kingdom of the Lord Jesus Christ (Matt. 13:47; Isa. 9:7), the house and family of God (Eph. 2:19; Eph. 3:15), out of which there is no ordinary possibility of salvation (Acts 2:47)."
            },
            {
              "id": 3,
              "text": "Unto this catholic visible Church Christ hath given the ministry, oracles, and ordinances of God, for the gathering and perfecting of the saints, in this life, to the end of the world: and doth by His own presence and Spirit, according to His promise, make them effectual thereunto (1 Cor. 12:28; Eph. 4:11, 12, 13; Matt. 28:19, 20; Isa. 59:21)."
            },
            {
              "id": 4,
              "text": "This catholic Church hath been sometimes more, sometimes less visible (Rom. 11:3, 4; Rev. 12:6, 14). And particular Churches, which are members thereof, are more or less pure, according as the doctrine of the Gospel is taught and embraced, ordinances administered, and public worship performed more or less purely in them (Rev. 2, 3; 1 Cor. 5:6, 7)."
            },
            {
              "id": 5,
              "text": "The purest Churches under heaven are subject both to mixture and error (1 Cor. 13:12; Rev. 2, 3; Matt. 13:24, 25, 26, 27, 28, 29, 30, 47): and some have so degenerated, as to become no Churches of Christ, but synagogues of Satan (Rev. 18:2; Rom. 11:18, 19, 20, 21, 22). Nevertheless, there shall be always a Church on earth, to worship God according to His will (Matt. 16:18; Ps. 72:17; Ps. 102:28; Matt. 28:19, 20)."
            },
            {
              "id": 6,
              "text": "There is no other head of the Church, but the Lord Jesus Christ (Col. 1:18; Eph. 1:22); nor can the Pope of Rome, in any sense, be head thereof; but is that Antichrist, that man of sin, and son of perdition, that exalteth himself, in the Church, against Christ and all that is called God (Matt. 23:8, 9, 10; 2 Thess. 2:3, 4, 8, 9; Rev. 13:6)."
            }
          ]
        },
        {
          "id": 26,
          "title": "Of the Communion of the Saints",
          "sections": [
            {
              "id": 1,
              "text": "All saints, that are united to Jesus Christ their Head by His Spirit and by faith, have fellowship with Him in His grace, sufferings, death, resurrection, and glory (John 1:3; Eph. 3:16, 17, 18, 19; John 1:16; Eph. 2:5, 6; Phil. 3:10; Rom. 6:5, 6; 2 Tim. 2:12): and, being united to one another in love, they have communion in each other’s gifts and graces (Eph. 4:15, 16; 1 Cor. 12:7; 1 Cor. 3:21, 22, 23; Col. 2:19), and are obliged to the performance of such duties, public and private, as do conduce to their mutual good, both in the inward and outward man (1 Thess. 5:11, 14; Rom. 1:11, 12, 14; 1 John 3:16, 17, 18; Gal. 6:10)."
            },
            {
              "id": 2,
              "text": "Saints by profession are bound to maintain a holy fellowship and communion in the worship of God; and in performing such other spiritual services as tend to their mutual edification (Heb. 10:24, 25; Acts 2:42, 46; Isa. 2:3; 1 Cor. 11:20); as also in relieving each other in outward things, according to their several abilities, and necessities. Which communion, as God offereth opportunity, is to be extended unto all those who, in every place, call upon the name of the Lord Jesus (Acts 2:44, 45; 1 John 3:17; 2 Cor. 8, 9; Acts 11:29, 30)."
            },
            {
              "id": 3,
              "text": "This communion which the saints have with Christ, doth not make them, in any wise, partakers of the substance of His Godhead; or to be equal with Christ, in any respect: either of which to affirm is impious and blasphemous (Col. 1:18, 19; 1 Cor. 8:6; Isa. 42:8; 1 Tim. 6:15, 16; Ps. 45:7, with Heb. 1:8, 9). Nor doth their communion one with another, as saints, take away, or infringe the title or propriety which each man hath in his goods and possessions (Exod. 20:15; Eph. 4:28; Acts 5:4)."
            }
          ]
        },
        {
          "id": 27,
          "title": "Of the Sacraments",
          "sections": [
            {
              "id": 1,
              "text": "Sacraments are holy signs and seals of the covenant of grace (Rom. 4:11; Gen. 17:7, 10), immediately instituted by God (Matt. 28:19; 1 Cor. 11:23), to represent Christ and His benefits; and to confirm our interest in Him (1 Cor. 10:16; 1 Cor. 11:25, 26; Gal. 3:17); as also, to put a visible difference between those that belong unto the Church, and the rest of the world (Rom. 15:8; Exod. 12:48; Gen. 34:14); and solemnly to engage them to the service of God in Christ, according to His Word (Rom. 6:3, 4; 1 Cor. 10:16, 21)."
            },
            {
              "id": 2,
              "text": "There is in every sacrament a spiritual relation, or sacramental union, between the sign and the thing signified: whence it comes to pass, that the names and effects of the one are attributed to the other (Gen. 17:10; Matt. 26:27, 28; Tit. 3:5)."
            },
            {
              "id": 3,
              "text": "The grace which is exhibited in or by the sacraments rightly used, is not conferred by any power in them; neither doth the efficacy of a sacrament depend upon the piety or intention of him that doth administer it (Rom. 2:28, 29; 1 Pet. 3:21): but upon the work of the Spirit (Matt. 3:11; 1 Cor. 12:13), and the word of institution, which contains, together with a precept authorizing the use thereof, a promise of benefit to worthy receivers (Matt. 26:27, 28; Matt. 28:19, 20)."
            },
            {
              "id": 4,
              "text": "There are only two sacraments ordained by Christ our Lord in the Gospel; that is to say, Baptism and the Supper of the Lord: neither of which may be dispensed by any but by a minister of the Word lawfully ordained (Matt. 28:19; 1 Cor. 11:20, 23, 1 Cor. 4:1; Heb. 5:4)."
            },
            {
              "id": 5,
              "text": "The sacraments of the Old Testament, in regard to the spiritual things thereby signified and exhibited, were, for substance, the same with those of the New (1 Cor. 10:1, 2, 3, 4)."
            }
          ]
        },
        {
          "id": 28,
          "title": "Of Baptism",
          "sections": [
            {
              "id": 1,
              "text": "Baptism is a sacrament of the New Testament, ordained by Jesus Christ (Matt. 28:19), not only for the solemn admission of the party baptized into the visible Church (1 Cor. 12:13); but also, to be unto him a sign and seal of the covenant of grace (Rom. 4:11 with Col. 2:11, 12), of his ingrafting into Christ (Gal. 3:27; Rom. 6:5), of regeneration (Tit. 3:5), of remission of sins (Mark 1:4), and of his giving up unto God through Jesus Christ, to walk in the newness of life (Rom. 6:3, 4). Which sacrament is, by Christ’s own appointment, to be continued in His Church until the end of the world (Matt. 28:19, 20)."
            },
            {
              "id": 2,
              "text": "The outward element to be used in this sacrament is water, wherewith the party is to be baptized, in the name of the Father, and of the Son, and of the Holy Ghost, by a minister of the Gospel, lawfully called thereunto (Matt. 3:11; John 1:33; Matt. 28:19, 20)."
            },
            {
              "id": 3,
              "text": "Dipping of the person into the water is not necessary; but Baptism is rightly administered by pouring or sprinkling water upon the person (Heb. 9:10, 19, 20, 21, 22; Acts 2:41; Acts 16:33; Mark 7:4)."
            },
            {
              "id": 4,
              "text": "Not only those that do actually profess faith in and obedience unto Christ (Mark 16:15, 16; Acts 8:37, 38), but also the infants of one or both believing parents, are to be baptized (Gen. 17:7, 9, 10 with Gal. 3:9, 14 and Col. 2:11, 12 & Acts 2:38, 39 & Rom. 4:11, 12; 1 Cor. 7:14; Matt. 28:19; Mark 10:13, 14, 15, 16; Luke 18:15)."
            },
            {
              "id": 5,
              "text": "Although it be a great sin to contemn or neglect this ordinance (Luke 7:30 with Exod. 4:24, 25, 26), yet grace and salvation are not so inseparably annexed unto it, as that no person can be regenerated or saved without it (Rom. 4:11; Acts 10:2, 4, 22, 31, 45, 47); or, that all that are baptized are undoubtedly regenerated (Acts 8:13, 23)."
            },
            {
              "id": 6,
              "text": "The efficacy of Baptism is not tied to that moment of time wherein it is administered (John 3:5, 8); yet notwithstanding, by the right use of this ordinance, the grace promised is not only offered, but really exhibited and conferred, by the Holy Ghost, to such (whether of age or infants) as that grace belongeth unto, according to the counsel of God’s own will, in His appointed time (Gal. 3:27; Titus 3:5; Eph. 5:25, 26; Acts 2:38, 41)."
            },
            {
              "id": 7,
              "text": "The sacrament of Baptism is but once to be administered unto any person (Titus 3:5)."
            }
          ]
        },
        {
          "id": 29,
          "title": "Of the Lord’s Supper",
          "sections": [
            {
              "id": 1,
              "text": "Our Lord Jesus, in the night wherein He was betrayed, instituted the sacrament of His body and blood, called the Lord’s Supper, to be observed in His Church, unto the end of the world, for the perpetual remembrance of the sacrifice of Himself in His death; the sealing all benefits thereof unto true believers, their spiritual nourishment and growth in Him, their further engagement in and to all duties which they owe unto Him; and to be a bond and pledge of their communion with Him, and with each other, as members of His mystical body (1 Cor. 11:23, 24, 25, 26; 1 Cor. 10:16, 17, 21; 1 Cor. 12:13)."
            },
            {
              "id": 2,
              "text": "In this sacrament, Christ is not offered up to His Father; nor any real sacrifice made at all for remission of sins of the quick or dead (Heb. 9:22, 25, 26, 28); but only a commemoration of that one offering up of Himself, by Himself, upon the cross, once for all: and a spiritual oblation of all possible praise unto God for the same (1 Cor. 11:24, 25, 26; Matt. 26:26, 27): so that the Popish sacrifice of the mass (as they call it) is most abominably injurious to Christ’s one, only sacrifice, the alone propitiation for all the sins of His elect (Heb. 7:23, 24, 27; Heb. 10:11, 12, 14, 18)."
            },
            {
              "id": 3,
              "text": "The Lord Jesus hath, in this ordinance, appointed His ministers to declare His word of institution to the people; to pray, and bless the elements of bread and wine, and thereby to set them apart from a common to a holy use; and to take and break the bread, to take the cup, and (they communicating also themselves) to give both to the communicants (Matt. 26:26, 27, 28 & Mark 14:22, 23, 24 and Luke 22:19, 20 with 1 Cor. 11:23, 24, 25, 26); but to none who are not then present in the congregation (Acts. 20:7; 1 Cor. 11:20)."
            },
            {
              "id": 4,
              "text": "Private masses, or receiving this sacrament by a priest or any other alone (1 Cor. 10:16); as likewise, the denial of the cup to the people (Mark 14:23; 1 Cor. 11:25, 26, 27, 28, 29), worshipping the elements, the lifting them up or carrying them about for adoration, and the reserving them for any pretended religious use; are all contrary to the nature of this sacrament, and to the institution of Christ (Matt. 15:9)."
            },
            {
              "id": 5,
              "text": "The outward elements in this sacrament, duly set apart to the uses ordained by Christ, have such relation to Him crucified, as that, truly, yet sacramentally only, they are sometimes called by the name of the things they represent, to wit, the body and blood of Christ (Matt. 26:26, 27, 28); albeit in substance and nature they still remain truly and only bread and wine, as they were before (1 Cor. 11:26, 27, 28; Matt. 26:29)."
            },
            {
              "id": 6,
              "text": "That doctrine which maintains a change of the substance of bread and wine into the substance of Christ’s body and blood (commonly called transubstantiation) by consecration of a priest, or by any other way, is repugnant, not to Scripture alone, but even to common sense and reason; overthroweth the nature of the sacrament, and hath been, and is the cause of manifold superstitions; yea, of gross idolatries (Acts 3:21 with 1 Cor. 11:24, 25, 26; Luke 24:6, 39)."
            },
            {
              "id": 7,
              "text": "Worthy receivers outwardly partaking of the visible elements in this sacrament (1 Cor. 11:28), do then also, inwardly by faith, really and indeed, yet not carnally and corporally, but spiritually, receive and feed upon Christ crucified, and all benefits of His death: the body and blood of Christ being then, not corporally or carnally, in, with, or under the bread and wine; yet, as really, but spiritually, present to the faith of believers in that ordinance, as the elements themselves are to their outward senses (1 Cor. 10:16)."
            },
            {
              "id": 8,
              "text": "Although ignorant and wicked men receive the outward elements in this sacrament: yet they receive not the thing signified thereby, but by their unworthy coming thereunto are guilty of the body and blood of the Lord to their own damnation. Wherefore, all ignorant and ungodly persons, as they are unfit to enjoy communion with Him, so are they unworthy of the Lord’s table; and cannot, without great sin against Christ while they remain such, partake of these holy mysteries (1 Cor. 11:27, 28, 29; 2 Cor. 6:14, 15, 16), or be admitted thereunto (1 Cor. 5:6, 7, 13; 2 Thess. 3:6, 14, 15; Matt. 7:6)."
            }
          ]
        },
        {
          "id": 30,
          "title": "Of Church Censures",
          "sections": [
            {
              "id": 1,
              "text": "The Lord Jesus, as King and Head of His Church, hath therein appointed a government, in the hand of Church officers, distinct from the civil magistrate (Isa. 9:6, 7; 1 Tim. 5:17; 1 Thess. 5:12; Acts 20:17, 28; Heb. 13:7, 17, 24; 1 Cor. 12:28; Matt. 28:18, 19, 20)."
            },
            {
              "id": 2,
              "text": "To these officers the keys of the kingdom of heaven are committed: by virtue whereof, they have power respectively to retain, and remit sins; to shut that kingdom against the impenitent, both by the Word and censures; and to open it unto penitent sinners, by the ministry of the Gospel, and by absolution from censures, as occasion shall require (Matt. 16:19; Matt. 18:17, 18; John 20:21, 22, 23; 2 Cor. 2:6, 7, 8)."
            },
            {
              "id": 3,
              "text": "Church censures are necessary, for the reclaiming and gaining of offending brethren, for deterring of others from the like offences, for purging out of that leaven which might infect the whole lump, for vindicating the honour of Christ, and the holy profession of the Gospel, and for preventing the wrath of God, which might justly fall upon the Church, if they should suffer His covenant and the seals thereof to be profaned by notorious and obstinate offenders (1 Cor. 5 chap.; 1 Tim. 5:20; Matt. 7:6; 1 Tim. 1:20; 1 Cor. 11:27 to the end, with Jude 23)."
            },
            {
              "id": 4,
              "text": "For the better attaining of these ends, the officers of the Church are to proceed by admonition; suspension from the sacrament of the Lord’s Supper for a season; and by excommunication from the Church; according to the nature of the crime, and demerit of the person (1 Thess. 5:12; 2 Thess. 3:6, 14, 15; 1 Cor. 5:4, 5, 13; Matt. 18:17; Tit. 3:10)."
            }
          ]
        },
        {
          "id": 31,
          "title": "Of Synods and Councils",
          "sections": [
            {
              "id": 1,
              "text": "For the better government, and further edification of the Church, there ought to be such assemblies as are commonly called synods or councils (Acts 15:2, 4, 6)."
            },
            {
              "id": 2,
              "text": "As magistrates may lawfully call a synod of ministers, and other fit persons, to consult and advise with, about matters of religion (Isa. 49:23; 1 Tim. 2:1, 2; 2 Chron. 19:8, 9, 10, 11; 2 Chron. 29, 30 chaps.; Matt. 2:4, 5; Prov. 11:14); so, if magistrates be open enemies to the Church, the ministers of Christ of themselves, by virtue of their office, or they, with other fit persons upon delegation from their Churches, may meet together in such assemblies (Acts 15:2, 4, 22, 23, 25)."
            },
            {
              "id": 3,
              "text": "It belongs to synods and councils, ministerially to determine controversies of faith and cases of conscience; to set down rules and directions for the better ordering of the public worship of God, and government of his Church; to receive complaints in cases of maladministration, and authoritatively to determine the same: which decrees and determinations, if consonant to the Word of God, are to be received with reverence and submission; not only for their agreement with the Word, but also for the power whereby they are made, as being an ordinance of God appointed thereunto in His Word (Acts 15:15, 19, 24, 27, 28, 29, 30, 31; Acts 16:4; Matt. 18:17, 18, 19, 20)."
            },
            {
              "id": 4,
              "text": "All synods or councils, since the Apostles’ times, whether general or particular, may err; and many have erred. Therefore they are not to be made the rule of faith, or practice; but to be used as a help in both (Eph. 2:20; Acts 17:11; 1 Cor. 2:5; 2 Cor. 1:24)."
            },
            {
              "id": 5,
              "text": "Synods and councils are to handle, or conclude, nothing, but that which is ecclesiastical: and are not to intermeddle with civil affairs which concern the commonwealth; unless by way of humble petition, in cases extraordinary; or by way of advice, for satisfaction of conscience, if they be thereunto required by the civil magistrate (Luke 12:13, 14; John 18:36)."
            }
          ]
        },
        {
          "id": 32,
          "title": "Of the State of Man After Death, and of the Resurrection of the Dead",
          "sections": [
            {
              "id": 1,
              "text": "The bodies of men, after death, return to dust and see corruption (Gen. 3:19; Acts 13:36): but their souls (which neither die nor sleep) having an immortal subsistence, immediately return to God who gave them (Luke 23:43; Eccles. 12:7): the souls of the righteous, being then made perfect in holiness, are received into the highest heavens, where they behold the face of God, in light and glory, waiting for the full redemption of their bodies (Heb. 12:23; 2 Cor. 5:1, 6, 8; Phil. 1:23, with Acts 3:21 & Eph. 4:10). And the souls of the wicked are cast into hell, where they remain in torments and utter darkness, reserved to the judgment of the great day (Luke 16:23, 24; Acts 1:25; Jude 6, 7; 1 Pet. 3:19). Beside these two places, for souls separated from their bodies, the Scripture acknowledgeth none."
            },
            {
              "id": 2,
              "text": "At the last day, such as are found alive shall not die, but be changed (1 Thess. 4:17; 1 Cor. 15:51, 52): and all the dead shall be raised up, with the selfsame bodies, and none other, although with different qualities, which shall be united again to their souls for ever (Job 19:26, 27; 1 Cor. 15:42, 43, 44)."
            },
            {
              "id": 3,
              "text": "The bodies of the unjust shall, by the power of Christ, be raised to dishonour: the bodies of the just, by His Spirit, unto honour; and be made conformable to His own glorious body (Acts 24:15; John 5:28, 29; 1 Cor. 15:43; Phil. 3:21)."
            }
          ]
        },
        {
          "id": 33,
          "title": "Of the Last Judgment",
          "sections": [
            {
              "id": 1,
              "text": "God hath appointed a day, wherein He will judge the world in righteousness, by Jesus Christ (Acts 17:31), to whom all power and judgment is given of the Father (John 5:22, 27). In which day, not only the apostate angels shall be judged (1 Cor. 6:3; Jude 6; 2 Pet. 2:4), but likewise all persons that have lived upon earth shall appear before the tribunal of Christ, to give an account of their thoughts, words, and deeds; and to receive according to what they have done in the body, whether good or evil (2 Cor. 5:10; Eccles. 12:14; Rom. 2:16; Rom. 14:10, 12; Matt. 12:36, 37)."
            },
            {
              "id": 2,
              "text": "The end of God’s appointing this day is for the manifestation of the glory of His mercy, in the eternal salvation of the elect; and of His justice, in the damnation of the reprobate who are wicked and disobedient. For then shall the righteous go into everlasting life, and receive that fulness of joy and refreshing, which shall come from the presence of the Lord: but the wicked who know not God, and obey not the Gospel of Jesus Christ, shall be cast into eternal torments, and be punished with everlasting destruction from the presence of the Lord, and from the glory of His power (Matt. 25:31 to the end; Rom. 2:5, 6; Rom. 9:22, 23; Matt. 25:21; Acts 3:19; 2 Thess. 1:7, 8, 9, 10)."
            },
            {
              "id": 3,
              "text": "As Christ would have us to be certainly persuaded that there shall be a day of judgment, both to deter all men from sin, and for the greater consolation of the godly in their adversity (2 Pet. 3:11, 14; 2 Cor. 5:10, 11; 2 Thess. 1:5, 6, 7; Luke 21:27, 28; Rom. 8:23, 24, 25); so will He have that day unknown to men, that they may shake off all carnal security, and be always watchful, because they know not at what hour the Lord will come; and may be ever prepared to say, Come, Lord Jesus, come quickly, Amen (Matt. 24:36, 42, 43, 44; Mark 13:35, 36, 37; Luke 12:35, 36; Rev. 22:20)."
            }
          ]
        }
      ]
    },
    "esp": {
      "name": "Confesión de Fe de Westminster",
      "category": "Doctrina",
      "slug": "confesion-de-fe-de-westminster",
      "description": "Una traducción del texto original de 1646 con los textos de prueba de la Asamblea incluidos en las citas.",
      "chapters": [
        {
          "id": 1,
          "title": "De las Santas Escrituras",
          "sections": [
            {
              "id": 1,
              "text": "Aunque la luz de la naturaleza y las obras de creación y de providencia manifiestan la bondad, sabiduría, y poder de Dios de tal manera que los hombres quedan sin excusa (Romanos 2:14, 15; Romanos 1:19, 20; Salmos 19:1-3; Romanos 1:32 y 2:1); sin embargo, no son suficientes para dar aquel conocimiento de Dios y de su voluntad que es necesario para la salvación (1 Corintios 1:21 y 2:13, 14); por lo que le agradó a Dios en varios tiempos y de diversas maneras revelarse a sí mismo y declarar su voluntad a su Iglesia (Hebreos 1:1); y además, para conservar y propagar mejor la verdad y para el mayor consuelo y establecimiento de la Iglesia contra la corrupción de la carne, malicia de Satanás y del mundo, le agradó dejar esa revelación por escrito (Lucas 1:3, 4; Romanos 15:4; Mateo 4:4, 7, 10; Isaías 8:19, 20; Proverbios 22:14-21): por todo lo cual las Santas Escrituras son muy necesarias (2 Timoteo 3:15; 2 Pedro 1:19); y tanto más cuanto que han cesado ya los modos anteriores por los cuales Dios reveló su voluntad a su Iglesia (Hebreos 1:1, 2)."
            },
            {
              "id": 2,
              "text": "Bajo el nombre de Santas Escrituras o la Palabra de Dios escrita, se encuentran todos los libros del\nAntiguo y Nuevo Testamento, y los cuales son:\n\nDel Antiguo Testamento:\n\nGénesis\nÉxodo\nLevítico\nNúmeros\nDeuteronomio\nJosué\nJueces\nRut\nI. Samuel\nII. Samuel\nI. Reyes\nII. Reyes\nI. Crónicas\nII. Crónicas\nEsdras\nNehemías\nEster\nJob\nSalmos\nProverbios\nEclesiastés\nCantares\nIsaías\nJeremías\nLamentaciones\nEzequiel\nDaniel\nOseas\nJoel\nAmós\nAbdias\nJonás\nMiqueas\nNahum\nHabacuc\nSofonías\nHageo\nZacarías\nMalaquías\n\nDel Nuevo Testamento:\n\nLos Evangelios según\nMateo\nMarcos\nLucas\nJuan\nLos Hechos de los Apóstoles\nLas Epístolas de Pablo\nA los Romanos\nCorintios I.\nCorintios II.\nGálatas\nEfesios\nFilipenses\nColosenses\nTesalonicenses I.\nTesalonicenses II.\nA Timoteo I.\nA Timoteo II.\nA Tito\nA Filemón\nLa Epístola a los Hebreos\nLa Epístola de Santiago\nLa primera y segunda epístolas de Pedro\nLa primera, segunda y tercera epístolas de Juan\nLa epístola de Judas\nLa Revelación de Juan\n\nTodos estos fueron dados por inspiración de Dios para que sean la regla de fe y de conducta (Lucas 16:29, 31; Efesios 2:20; Apocalipsis 22:18, 19; 2 Timoteo 3:16)."
            },
            {
              "id": 3,
              "text": "Los libros comúnmente llamados Apócrifos, por no ser de inspiración divina, no forman parte del Canon de las Santas Escrituras, y por lo tanto no son de autoridad para la Iglesia de Dios, ni deben aceptarse ni usarse sino de la misma manera que otros escritos humanos (2 Pedro 1:21; Romanos 3:2; Lucas 24:27, 44.)."
            },
            {
              "id": 4,
              "text": "La autoridad de las Santas Escrituras, por la que ellas deben ser creídas y obedecidas, no depende del testimonio de ningún hombre o iglesia, sino exclusivamente del testimonio de Dios (quien en sí mismo es la verdad), el autor de ellas; y deben ser creídas, porque son la Palabra de Dios (2 Pedro 1:19, 21; 2 Timoteo 3:16; 1 Juan 5:9; 1 Tesal. 2:13)."
            },
            {
              "id": 5,
              "text": "El testimonio de la Iglesia puede movernos e inducirnos a tener para las Santas Escrituras una estimación alta y reverencial (1 Timoteo 3:15); a la vez que el carácter celestial del contenido de la Biblia, la eficacia de su doctrina, la majestad de su estilo, la armonía de todas sus partes, el fin que se propone alcanzar en todo el (que es el de dar toda gloria a Dios), el claro descubrimiento que hace del único modo por el cual puede alcanzar la salvación el hombre y las muchas otras incomparables excelencias y su entera perfección son todos argumentos por los cuales la Biblia demuestra abundantemente que es la Palabra de Dios. Sin embargo, nuestra persuasión y completa seguridad de que su verdad es infalible y su autoridad divina proviene de la obra del Espíritu Santo, quien da testimonio a nuestro corazón con la palabra divina y por medio de ella (1 Juan 2:20, 27; Juan 16:13, 14; 1 Corintios 2:10, 11; Isaías 59:21)."
            },
            {
              "id": 6,
              "text": "El consejo completo de Dios tocante a todas las cosas necesarias para su propia gloria y para la salvación, fe y vida del hombre, está expresamente expuesto en las Escrituras, o se puede deducir de ellas por buena y necesaria consecuencia, y, a esta revelación de su voluntad, nada ha de añadirse, ni por nuevas relaciones del Espíritu, ni por las tradiciones de los hombres (2 Timoteo 3:15-17; Gálatas 1:8, 9; 2 Tes. 2:2). Sin embargo, confesamos que la iluminación interna del Espíritu de Dios es necesaria para que se entiendan de una manera salvadora las cosas reveladas en la Palabra (Juan 6:45; 1 Corintios 2:9-12), y que hay algunas circunstancias tocantes a la adoración de Dios y al gobierno de la iglesia, comunes a las acciones y sociedades humanas, que deben arreglarse conforme a la luz de la naturaleza y de la prudencia cristiana, pero guardando siempre las reglas generales de la Palabra que han de observarse siempre (1 Corintios 11:13, 14, y 14:26, 40)."
            },
            {
              "id": 7,
              "text": "Las cosas contenidas en las Escrituras, no todas son igualmente claras ni se entienden con la misma facilidad por todos (2 Pedro 3:16); sin embargo, las cosas que necesariamente deben saberse, creerse y guardarse para conseguir la salvación, se proponen y declaran en uno u otro lugar de las Escrituras, de tal manera que no solo los eruditos, sino aún los que no lo son, pueden adquirir un conocimiento suficiente de tales cosas por el debido uso de los medios ordinarios (Salmo 119:105, 130)."
            },
            {
              "id": 8,
              "text": "El Antiguo Testamento se escribió en hebreo (que era el idioma común del pueblo de Dios antiguamente), y el Nuevo Testamento en griego (que en el tiempo en que fue escrito era el idioma más conocido entre las naciones).En aquellas lenguas fueron inspirados directamente por Dios, y guardados puros en todos los siglos por su cuidado y providencia especiales (Mateo 5:18), y por eso son auténticos. Por esta razón debe apelarse finalmente  a los originales en esos idiomas en toda controversia (Isaías 8:20; Hechos 15:15). Como estos idiomas originales no se conocen por todo el pueblo de Dios, el cual tiene el derecho de poseer las Escrituras y gran interés de ellas, a las que según el mandamiento debe leer y escudriñar en el temor de Dios (Juan 5:39, 46), por lo tanto la Biblia debe ser traducida a la lengua vulgar de toda nación a donde sea llevada (1 Corintios 14:6, 9, 11, 12, 24, 27, 28), para que morando abundantemente la Palabra de Dios en todos, puedan adorar a Dios de una manera aceptable (Colosenses 3:16) y para que por la paciencia y consolación de las Escrituras, tengan esperanza (Romanos 15:4)."
            },
            {
              "id": 9,
              "text": "La regla infalible para interpretar la Biblia, es la Biblia misma, y por tanto, cuando hay dificultad respecto al sentido verdadero y pleno de un pasaje cualquiera (cuyo significado no es múltiple, sino uno solo), éste se debe buscar y establecer por otros pasajes que hablen con más claridad del asunto (Hechos 15:15, 16; 2 Pedro 1:20, 21)."
            },
            {
              "id": 10,
              "text": "El Juez Supremo por el cual deben decidirse todas las controversias religiosas, todos los decretos de los concilios, las opiniones de los hombres antiguos, las doctrinas de hombres y de espíritus privados, y en cuya sentencia debemos descansar, no es ningún otro más que el Espíritu Santo que habla en las Escrituras (Mateo 22:29,31; Efesios 2:20 con Hechos 15:16)."
            }
          ]
        },
        {
          "id": 2,
          "title": "Of God, and of the Holy Trinity",
          "sections": [
            {
              "id": 1,
              "text": "There is but one only (Deut. 6:4; 1 Cor. 8:4, 6), living, and true God (1 Thess. 1:9; Jer. 10:10): who is infinite in being and perfection (Job 11:7, 8, 9; Job 26:14), a most pure spirit (John 4:24), invisible (1 Tim. 1:17), without body, parts (Deut. 4:15, 16; John 4:24, with Luke 24:39), or passions (Acts 14:11, 15), immutable (James 1:17; Mal. 3:6), immense (1 Kings 8:27; Jer. 23:23, 24), eternal (Ps. 90:2; 1 Tim. 1:17), incomprehensible (Ps. 145:3), almighty (Gen. 17:1; Rev. 4:8), most wise (Rom. 16:27), most holy (Isa. 6:3; Rev. 4:8), most free (Ps. 115:3), most absolute (Exod. 3:14), working all things according to the counsel of His own immutable and most righteous will (Eph. 1:11), for His own glory (Prov. 16:4; Rom. 11:36); most loving (1 John 4:8, 16), gracious, merciful, long-suffering, abundant in goodness and truth, forgiving iniquity, transgression, and sin (Exod. 34:6, 7); the rewarder of them that diligently seek Him (Heb. 11:6); and withal, most just and terrible in His judgments (Neh. 9:32, 33), hating all sin (Ps. 5:5, 6), and who will by no means clear the guilty (Nah. 1:2, 3; Exod. 34:7)."
            },
            {
              "id": 2,
              "text": "God hath all life (John 5:26), glory (Acts 7:2), goodness (Ps. 119:68), blessedness (1 Tim. 6:15; Rom. 9:5), in and of Himself; and is alone in and unto Himself all-sufficient, not standing in need of any creatures which He hath made (Acts 17:24, 25), nor deriving any glory from them (Job 22:2, 3), but only manifesting His own glory in, by, unto, and upon them: He is the alone fountain of all being, of whom, through whom, and to whom are all things (Rom 11:36); and hath most sovereign dominion over them, to do by them, for them, or upon them whatsoever Himself pleaseth (Rev. 4:11; 1 Tim. 6:15; Dan. 4:25, 35). In His sight all things are open and manifest (Heb. 4:13); His knowledge is infinite, infallible, and independent upon the creature (Rom. 11:33, 34; Ps. 147:5), so as nothing is to Him contingent, or uncertain (Acts 15:18; Ezek. 11:5). He is most holy in all His counsels, in all His works, and in all His commands (Ps. 145:17; Rom. 7:12). To Him is due from angels and men, and every other creature, whatsoever worship, service, or obedience He is pleased to require of them (Rev. 5:12, 13, 14)."
            },
            {
              "id": 3,
              "text": "In the unity of the Godhead there be three persons, of one substance, power, and eternity; God the Father, God the Son, and God the Holy Ghost (1 John 5:7; Matt. 3:16, 17; Matt. 28:19; 2 Cor. 13:14). The Father is of none, neither begotten, nor proceeding: the Son is eternally begotten of the Father (John 1:14, 18): the Holy Ghost eternally proceeding from the Father and the Son (John 15:26; Gal. 4:6.)."
            }
          ]
        },
        {
          "id": 3,
          "title": "Of God’s Eternal Decree",
          "sections": [
            {
              "id": 1,
              "text": "God from all eternity did, by the most wise and holy counsel of His own will, freely, and unchangeably ordain whatsoever comes to pass (Eph. 1:11; Rom. 11:33; Heb. 6:17; Rom. 9:15, 18): yet so, as thereby neither is God the author of sin (Jam. 1:13, 17; 1 John 1:5), nor is violence offered to the will of the creatures, nor is the liberty or contingency of second causes taken away, but rather established (Acts 2:23; Matt. 17:12; Acts 4:27, 28; John 19:11; Prov. 16:33)."
            },
            {
              "id": 2,
              "text": "Although God knows whatsoever may or can come to pass upon all supposed conditions (Acts 15:18; 1 Sam. 23:11, 12; Matt. 11:21, 23), yet hath He not decreed anything because He foresaw it as future, or as that which would come to pass upon such conditions (Rom. 9:11, 13, 16, 18)."
            },
            {
              "id": 3,
              "text": "By the decree of God, for the manifestation of His glory, some men and angels (1 Tim. 5:21; Matt. 25:41) are predestinated unto everlasting life, and others fore-ordained to everlasting death (Rom. 9:22, 23; Eph. 1:5, 6; Prov. 16:4)."
            },
            {
              "id": 4,
              "text": "These angels and men, thus predestinated, and fore-ordained, are particularly and unchangeably designed, and their number so certain and definite, that it cannot be either increased or diminished (2 Tim. 2:19; John 13:18)."
            },
            {
              "id": 5,
              "text": "Those of mankind that are predestinated unto life, God, before the foundation of the world was laid, according to His eternal and immutable purpose, and the secret counsel and good pleasure of His will, hath chosen, in Christ, unto everlasting glory (Eph. 1:4, 9, 11; Rom. 8:30; 2 Tim. 1:9; 1 Thess. 5:9), out of His mere free grace and love, without any foresight of faith or good works, or perseverance in either of them, or any other thing in the creature, as conditions, or causes moving Him thereunto (Rom. 9:11, 13, 16; Eph. 1:4, 9): and all to the praise of His glorious grace (Eph. 1:6, 12)."
            },
            {
              "id": 6,
              "text": "As God hath appointed the elect unto glory, so hath He, by the eternal and most free purpose of His will, fore-ordained all the means thereunto (1 Pet. 1:2; Eph. 1:4, 5; Eph. 2:10; 2 Thess. 2:13). Wherefore they who are elected, being fallen in Adam, are redeemed by Christ (1 Thess. 5:9, 10; Titus 2:14), are effectually called unto faith in Christ by His Spirit working in due season, are justified, adopted, sanctified (Rom. 8:30; Eph. 1:5; 2 Thess. 2:13), and kept by His power through faith, unto salvation (1 Pet. 1:5). Neither are any other redeemed by Christ, effectually called, justified, adopted, sanctified, and saved, but the elect only (John 17:9; Rom. 8:28 to the end; John 6:64, 65; John 10:26; John 8:47; 1 John 2:19)."
            },
            {
              "id": 7,
              "text": "The rest of mankind God was pleased, according to the unsearchable counsel of His own will, whereby He extendeth or withholdeth mercy, as He pleaseth, for the glory of His sovereign power over His creatures, to pass by; and to ordain them to dishonour and wrath, for their sin, to the praise of His glorious justice (Matt. 11:25, 26; Rom. 9:17, 18, 21, 22; 2 Tim. 2:19, 20; Jude ver. 4; 1 Pet. 2:8)."
            },
            {
              "id": 8,
              "text": "The doctrine of this high mystery of predestination is to be handled with special prudence and care (Rom. 9:20; Rom. 11:33; Deut. 29:29), that men attending the will of God revealed in His Word, and yielding obedience thereunto, may, from the certainty of their effectual vocation, be assured of their eternal election (2 Pet. 1:10). So shall this doctrine afford matter of praise, reverence, and admiration of God (Eph. 1:6; Rom. 11:33), and of humility, diligence, and abundant consolation to all that sincerely obey the Gospel (Rom. 11:5, 6, 20; 2 Pet. 1:10; Rom. 8:33; Luke 10:20)."
            }
          ]
        },
        {
          "id": 4,
          "title": "Of Creation",
          "sections": [
            {
              "id": 1,
              "text": "It pleased God the Father, Son, and Holy Ghost (Heb. 1:2; John 1:2, 3; Gen. 1:2; Job. 26:13; Job. 33:4), for the manifestation of the glory of His eternal power, wisdom, and goodness (Rom. 1:20; Jer. 10:12; Ps. 104:24; Ps. 33:5, 6), in the beginning, to create, or make of nothing, the world, and all things therein whether visible or invisible, in the space of six days; and all very good (Gen. 1 chap.; Heb. 11:3; Col. 1:16; Acts 17:24)."
            },
            {
              "id": 2,
              "text": "After God had made all other creatures, He created man, male and female (Gen. 1:27), with reasonable and immortal souls (Gen. 2:7 with Eccles. 12:7 & Luke 23:43 and Matt. 10:28), endued with knowledge, righteousness, and true holiness, after His own image (Gen. 1:26; Col. 3:10; Eph. 4:24); having the law of God written in their hearts (Rom. 2:14, 15), and power to fulfil it (Eccles. 7:29): and yet under a possibility of transgressing, being left to the liberty of their own will, which was subject unto change (Gen. 3:6; Eccles. 7:29). Beside this law written in their hearts, they received a command, not to eat of the tree of the knowledge of good and evil, which while they kept, they were happy in their communion with God(Gen. 2:17; Gen. 3:8, 9, 10, 11, 23), and had dominion over the creatures (Gen. 1:26, 28)."
            }
          ]
        },
        {
          "id": 5,
          "title": "Of Providence",
          "sections": [
            {
              "id": 1,
              "text": "God the great Creator of all things doth uphold (Heb. 1:3), direct, dispose, and govern all creatures, actions, and things (Dan. 4:34, 35; Ps. 135:6; Acts 17:25, 26, 28; Job 38–41), from the greatest even to the least (Matt. 10:29, 30, 31), by His most wise and holy providence (Prov. 15:3; Ps. 104:24; Ps. 145:17), according to His infallible fore-knowledge (Acts 15:18; Ps. 94:8, 9, 10, 11), and the free and immutable counsel of His own will (Eph. 1:11; Ps. 33:10, 11), to the praise of the glory of His wisdom, power, justice, goodness, and mercy (Isa. 63:14; Eph. 3:10; Rom. 9:17; Gen. 45:7; Ps. 145:7)."
            },
            {
              "id": 2,
              "text": "Although, in relation to the fore-knowledge and decree of God, the first Cause, all things come to pass immutably, and infallibly (Acts 2:23): yet, by the same providence, He ordereth them to fall out, according to the nature of second causes, either necessarily, freely, or contingently (Gen. 8:22; Jer. 31:35; Exod. 21:13 with Deut. 19:5; 1 Kings 22:28, 34; Isa. 10:6, 7)."
            },
            {
              "id": 3,
              "text": "God in His ordinary providence maketh use of means (Acts 27:31, 44; Isa. 55:10, 11; Hos. 2:21, 22), yet is free to work without (Hos. 1:7; Matt. 4:4; Job 34:20), above (Rom. 4:19, 20, 21), and against them at His pleasure (2 Kings 6:6; Dan. 3:27)."
            },
            {
              "id": 4,
              "text": "The almighty power, unsearchable wisdom, and infinite goodness of God so far manifest themselves in His providence, that it extendeth itself even to the first fall, and all other sins of angels and men (Rom. 11:32, 33, 34; 2 Sam. 24:1 with 1 Chron. 21:1; 1 Kings 22:22, 23; 1 Chron. 10:4, 13, 14; 2 Sam. 16:10; Acts 2:23; Acts 4:27, 28); and that not by a bare permission (Acts 14:16), but such as hath joined with it a most wise and powerful bounding (Ps. 76:10; 2 Kings 19:28), and otherwise ordering and governing of them, in a manifold dispensation, to His own holy ends (Gen. 50:20; Isa. 10:6, 7, 12); yet so, as the sinfulness thereof proceedeth only from the creature, and not from God, who, being most holy and righteous, neither is, nor can be, the author or approver of sin (James 1:13, 14, 17; 1 John 2:16; Ps. 50:21)."
            },
            {
              "id": 5,
              "text": "The most wise, righteous, and gracious God doth oftentimes leave for a season His own children to manifold temptations, and the corruption of their own hearts, to chastise them for their former sins, or to discover unto them the hidden strength of corruption, and deceitfulness of their hearts, that they may be humbled (2 Chron. 32:25, 26, 31; 2 Sam. 24:1); and, to raise them to a more close and constant dependence for their support upon Himself, and to make them more watchful against all future occasions of sin, and for sundry other just and holy ends (2 Cor. 12:7, 8, 9; Ps. 73 throughout; Ps. 77:1–12; Mark 14:66 to the end, with John 21:15, 16, 17)."
            },
            {
              "id": 6,
              "text": "As for those wicked and ungodly men whom God, as a righteous Judge, for former sins, doth blind and harden (Rom. 1:24, 26, 28; Rom. 11:7, 8), from them He not only withholdeth His grace, whereby they might have been enlightened in their understandings, and wrought upon in their hearts (Deut. 29:4); but sometimes also withdraweth the gifts which they had (Matt. 13:12; Matt. 25:29), and exposeth them to such objects as their corruption makes occasions of sin (Deut. 2:30; 2 Kings 8:12, 13); and, withal, gives them over to their own lusts, the temptations of the world, and the power of Satan (Ps. 81:11, 12; 2 Thess. 2:10, 11, 12): whereby it comes to pass that they harden themselves, even under those means which God useth for the softening of others (Exod. 7:3 with Exod. 8:15, 32; 2 Cor. 2:15, 16; Isa. 8:14; 1 Pet. 2:7, 8; Isa. 6:9, 10 with Acts 28:26, 27)."
            },
            {
              "id": 7,
              "text": "As the providence of God doth in general reach to all creatures, so after a most special manner, it taketh care of His Church, and disposeth all things to the good thereof (1 Tim. 4:10; Amos 9:8, 9; Rom. 8:28; Isa. 43:3, 4, 5, 14)."
            }
          ]
        },
        {
          "id": 6,
          "title": "Of the Fall of Man, of Sin, and of the Punishment thereof",
          "sections": [
            {
              "id": 1,
              "text": "Our first parents, being seduced by the subtilty and temptation of Satan, sinned, in eating the forbidden fruit (Gen. 3:13; 2 Cor. 11:3). This their sin God was pleased, according to His wise and holy counsel, to permit, having purposed to order it to His own glory (Rom. 11:32)."
            },
            {
              "id": 2,
              "text": "By this sin they fell from their original righteousness and communion, with God (Gen. 3:6, 7, 8; Eccles. 7:29; Rom. 3:23), and so became dead in sin (Gen. 2:17; Eph. 2:1), and wholly defiled in all the parts and faculties of soul and body (Tit. 1:15; Gen. 6:5; Jer. 17:9; Rom. 3:10 to 19)."
            },
            {
              "id": 3,
              "text": "They being the root of all mankind, the guilt of this sin was imputed (Gen. 1:27, 28 & Gen. 2:16, 17 and Acts 17:26 with Rom. 5:12, 15, 16, 17, 18, 19 and 1 Cor. 15:21, 22, 49), and the same death in sin and corrupted nature conveyed, to all their posterity descending from them by ordinary generation (Ps. 51:5; Gen. 5:3; Job 14:4, Job 15:14)."
            },
            {
              "id": 4,
              "text": "From this original corruption, whereby we are utterly indisposed, disabled, and made opposite to all good (Rom. 5:6; Rom. 8:7, Rom. 7:18; Col. 1:21), and wholly inclined to all evil (Gen. 6:5; Gen. 8:21; Rom. 3:10, 11, 12), do proceed all actual transgressions (James 1:14, 15; Eph. 2:2, 3; Matt. 15:19)."
            },
            {
              "id": 5,
              "text": "This corruption of nature, during this life, doth remain in those that are regenerated (1 John 1:8, 10; Rom. 7:14, 17, 18, 23; James 3:2; Prov. 20:9; Eccles. 7:20); and although it be, through Christ, pardoned and mortified, yet both itself and all the motions thereof are truly and properly sin (Rom. 7:5, 7, 8, 25; Gal. 5:17)."
            },
            {
              "id": 6,
              "text": "Every sin, both original and actual, being a transgression of the righteous law of God, and contrary thereunto (1 John 3:4), doth, in its own nature, bring guilt upon the sinner (Rom. 2:15; Rom. 3:9, 19); whereby he is bound over to the wrath of God (Ephes. 2:3), and curse of the law (Gal. 3:10), and so made subject to death (Rom. 6:23), with all miseries spiritual (Ephes. 4:18), temporal (Rom. 8:20; Lam. 3:39), and eternal (Matt. 25:41, 2 Thess. 1:9)."
            }
          ]
        },
        {
          "id": 7,
          "title": "Of God’s Covenant with Man",
          "sections": [
            {
              "id": 1,
              "text": "The distance between God and the creature is so great, that although reasonable creatures do owe obedience unto Him as their Creator, yet they could never have any fruition of Him as their blessedness and reward, but by some voluntary condescension on God’s part, which He hath been pleased to express by way of covenant (Isa. 40:13, 14, 15, 16, 17; Job. 9:32, 33; 1 Sam. 2:25; Ps. 113:5, 6; Ps. 100:2, 3; Job. 22:2, 3; Job 35:7, 8; Luke 17:10; Acts 17:24, 25)."
            },
            {
              "id": 2,
              "text": "The first covenant made with man was a covenant of works (Gal. 3:12), wherein life was promised to Adam, and in him to his posterity (Rom. 10:5, Rom. 5:12–20), upon condition of perfect and personal obedience (Gen. 2:17; Gal. 3:10)."
            },
            {
              "id": 3,
              "text": "Man by his fall having made himself incapable of life by that covenant, the Lord was pleased to make a second (Gal. 3:21; Rom. 8:3; Rom. 3:20, 21; Gen. 3:15; Isa. 42:6), commonly called the covenant of grace; wherein He freely offereth unto sinners life and salvation by Jesus Christ, requiring of them faith in Him, that they may be saved (Mark 16:15, 16; John 3:16; Rom. 10:6, 9; Gal. 3:11), and promising to give unto all those that are ordained unto life His Holy Spirit, to make them willing and able to believe (Ezek. 36:26, 27; John 6:44, 45)."
            },
            {
              "id": 4,
              "text": "This covenant of grace is frequently set forth in Scripture by the name of a Testament, in reference to the death of Jesus Christ the Testator, and to the everlasting inheritance, with all things belonging to it, therein bequeathed (Heb. 9:15, 16, 17; Heb. 7:22; Luke 22:20; 1 Cor. 11:25)."
            },
            {
              "id": 5,
              "text": "This covenant was differently administered in the time of the law, and in the time of the gospel (2 Cor. 3:6, 7, 8, 9.): under the law, it was administered by promises, prophecies, sacrifices, circumcision, the paschal lamb, and other types and ordinances delivered to the people of the Jews, all fore-signifying Christ to come (Heb. 8, 9, 10 chapters; Rom. 4:11; Col. 2:11, 12; 1 Cor. 5:7): which were, for that time, sufficient and efficacious, through the operation of the Spirit, to instruct and build up the elect in faith in the promised Messiah (1 Cor. 10:1, 2, 3, 4; Heb. 11:13; John 8:56), by whom they had full remission of sins, and eternal salvation; and is called, the Old Testament (Gal. 3:7, 8, 9, 14)."
            },
            {
              "id": 6,
              "text": "Under the gospel, when Christ, the substance (Col. 2:17), was exhibited, the ordinances in which this covenant is dispensed are the preaching of the Word, and the administration of the sacraments of Baptism and the Lord’s Supper (Matt. 28:19, 20; 1 Cor. 11:23, 24, 25): which, though fewer in number, and administered with more simplicity, and less outward glory; yet, in them, it is held forth in more fulness, evidence, and spiritual efficacy (Heb. 12:22–28; Jer. 31:33, 34), to all nations, both Jews and Gentiles (Matt. 28:19; Eph. 2:15, 16, 17, 18, 19); and is called the New Testament (Luke 22:20). There are not therefore two covenants of grace, differing in substance, but one and the same, under various dispensations (Gal. 3:14, 16; Rom 3:21, 22, 23, 30; Ps. 32:1 with Rom. 4:3, 6, 16, 17, 23, 24; Heb. 13:8; Acts 15:11)."
            }
          ]
        },
        {
          "id": 8,
          "title": "Of Christ the Mediator",
          "sections": [
            {
              "id": 1,
              "text": "It pleased God, in His eternal purpose, to choose and ordain the Lord Jesus, His only begotten Son, to be the Mediator between God and man (Isa. 42:1; 1 Pet. 1:19, 20; John 3:16; 1 Tim. 2:5); the Prophet (Acts 3:22), Priest (Heb. 5:5, 6), and King (Ps. 2:6; Luke 1:33), the Head and Saviour of His Church (Eph. 5:23), the Heir of all things (Heb. 1:2), and Judge of the world (Acts 17:31): unto whom He did from all eternity give a people, to be His seed (John 17:6; Ps. 22:30, Isa. 53:10), and to be by Him in time redeemed, called, justified, sanctified, and glorified (1 Tim. 2:6; Isa. 55:4, 5; 1 Cor. 1:30)."
            },
            {
              "id": 2,
              "text": "The Son of God, the second person in the Trinity, being very and eternal God, of one substance and equal with the Father, did, when the fulness of time was come, take upon Him man’s nature (John 1:1, 14; 1 John 5:20; Phil. 2:6; Gal. 4:4), with all the essential properties and common infirmities thereof, yet without sin (Heb. 2:14, 16, 17; Heb. 4:15): being conceived by the power of the Holy Ghost, in the womb of the virgin Mary, of her substance (Luke 1:27, 31, 35; Gal. 4:4). So that two whole, perfect, and distinct natures, the Godhead and the manhood, were inseparably joined together in one person, without conversion, composition, or confusion (Luke 1:35; Col. 2:9; Rom. 9:5; 1 Pet. 3:18; 1 Tim. 3:16). Which person is very God, and very man, yet one Christ, the only Mediator between God and man (Rom. 1:3, 4; 1 Tim. 2:5)."
            },
            {
              "id": 3,
              "text": "The Lord Jesus, in His human nature thus united to the divine, was sanctified and anointed with the Holy Spirit, above measure (Ps. 45:7; John 3:34), having in Him all the treasures of wisdom and knowledge (Col. 2:3); in whom it pleased the Father that all fulness should dwell (Col. 1:19); to the end that, being holy, harmless, undefiled, and full of grace and truth (Heb. 7:26; John 1:14), He might be thoroughly furnished to execute the office of a mediator and surety (Acts 10:38; Heb. 12:24; Heb. 7:22). Which office He took not unto Himself, but was thereunto called by His Father (Heb. 5:4, 5), who put all power and judgment into His hand, and gave Him commandment to execute the same (John 5:22, 27; Matt. 28:18; Acts 2:36)."
            },
            {
              "id": 4,
              "text": "This office the Lord Jesus did most willingly undertake (Ps. 40:7, 8 with Heb. 10:5–10; John 10:18; Phil. 2:8); which that He might discharge, He was made under the law (Gal. 4:4), and did perfectly fulfil it (Matt. 3:15; Matt. 5:17), endured most grievous torments immediately in His soul (Matt. 26:37, 38; Luke 22:44; Matt. 27:46), and most painful sufferings in His body (Matt. 26, 27 chapters); was crucified, and died (Phil. 2:8); was buried, and remained under the power of death; yet saw no corruption (Acts. 2:23, 24, 27; Acts 13:37; Rom. 6:9). On the third day He arose from the dead (1 Cor. 15:3, 4), with the same body in which He suffered (John 20:25, 27), with which also he ascended into heaven, and there sitteth at the right hand of His Father (Mark 16:19), making intercession (Rom. 8:34; Heb. 9:24; Heb. 7:25), and shall return to judge men and angels at the end of the world (Rom. 14:9, 10; Acts 1:11; Acts 10:42; Matt. 13:40, 41, 42; Jude 6; 2 Pet. 2:4)."
            },
            {
              "id": 5,
              "text": "The Lord Jesus, by His perfect obedience, and sacrifice of Himself, which He, through the eternal Spirit, once offered up unto God, hath fully satisfied the justice of His Father (Rom. 5:19; Heb. 9:14, 16; Heb. 10:14; Eph. 5:2; Rom. 3:25, 26); and purchased, not only reconciliation, but an everlasting inheritance in the kingdom of heaven, for all those whom the Father hath given unto Him (Dan. 9:24, 26; Col. 1:19, 20; Eph. 1:11, 14; John 17:2; Heb. 9:12, 15)."
            },
            {
              "id": 6,
              "text": "Although the work of redemption was not actually wrought by Christ till after His incarnation, yet the virtue, efficacy, and benefits thereof were communicated unto the elect in all ages successively from the beginning of the world, in and by those promises, types, and sacrifices, wherein He was revealed, and signified to be the seed of the woman which should bruise the serpent’s head; and the Lamb slain from the beginning of the world: being yesterday and to-day the same, and forever (Gal. 4:4, 5; Gen. 3:15; Rev. 13:8; Heb. 13:8)."
            },
            {
              "id": 7,
              "text": "Christ, in the work of mediation, acteth according to both natures, by each nature doing that which is proper to itself (Heb. 9:14; 1 Pet. 3:18): yet, by reason of the unity of the person, that which is proper to one nature, is sometimes in Scripture attributed to the person denominated by the other nature (Acts 20:28; John 3:13; 1 John 3:16)."
            },
            {
              "id": 8,
              "text": "To all those for whom Christ hath purchased redemption, He doth certainly and effectually apply and communicate the same (John 6:37, 39; John 10:15, 16), making intercession for them (1 John 2:1, 2; Rom. 8:34), and revealing unto them, in and by the Word, the mysteries of salvation (John 15:13, 15; Eph. 1:7, 8, 9; John 17:6), effectually persuading them by His Spirit to believe and obey, and governing their hearts by His Word and Spirit (John 14:26; Heb. 12:2; 2 Cor. 4:13; Rom. 8:9, 14; Rom. 15:18, 19; John 17:17); overcoming all their enemies by His almighty power and wisdom, in such manner, and ways, as are most consonant to His wonderful and unsearchable dispensation (Ps. 110:1; 1 Cor. 15:25, 26; Mal. 4:2, 3; Col. 2:15)."
            }
          ]
        },
        {
          "id": 9,
          "title": "Of Free Will",
          "sections": [
            {
              "id": 1,
              "text": "God hath endued the will of man with that natural liberty, that is neither forced, nor by any absolute necessity of nature determined to good or evil (Matt. 17:12; James 1:14; Deut. 30:19)."
            },
            {
              "id": 2,
              "text": "Man, in his state of innocency, had freedom and power to will and to do that which was good, and well pleasing to God (Eccles. 7:29; Gen. 1:26); but yet, mutably, so that he might fall from it (Gen. 2:16, 17; Gen. 3:6)"
            },
            {
              "id": 3,
              "text": "Man, by his fall into a state of sin, hath wholly lost all ability of will to any spiritual good accompanying salvation (Rom. 5:6; Rom 8:7; John 15:5): so as, a natural man, being altogether averse from that good (Rom. 3:10, 12), and dead in sin (Eph. 2:1, 5; Col. 2:13), is not able, by his own strength, to convert himself, or to prepare himself thereunto (John 6:44, 65; Eph. 2:2, 3, 4, 5; 1 Cor. 2:14; Titus 3:3, 4, 5)."
            },
            {
              "id": 4,
              "text": "When God converts a sinner, and translates him into the state of grace, He freeth him from his natural bondage under sin (Col. 1:13; John 8:34, 36); and, by His grace alone, enables him freely to will and to do that which is spiritually good (Phil. 2:13; Rom. 6:18, 22); yet so, as that by reason of his remaining corruption, he doth not perfectly, nor only, will that which is good, but doth also will that which is evil (Gal. 5:17; Rom. 7:15, 18, 19, 21, 23)."
            },
            {
              "id": 5,
              "text": "The will of man is made perfectly and immutably free to do good alone, in the state of glory only (Eph. 4:13; Heb. 12:23; 1 John 3:2; Jude 24)."
            }
          ]
        },
        {
          "id": 10,
          "title": "Of Effectual Calling",
          "sections": [
            {
              "id": 1,
              "text": "All those whom God hath predestinated unto life, and those only, He is pleased in His appointed and accepted time effectually to call (Rom. 8:30; Rom. 11:7; Eph. 1:10, 11), by His Word and Spirit (2 Thess. 2:13, 14; 2 Cor. 3:3, 6), out of that state of sin and death, in which they are by nature, to grace and salvation by Jesus Christ (Rom. 8:2; Eph. 2:1, 2, 3, 4, 5; 2 Tim. 1:9, 10); enlightening their minds spiritually and savingly to understand the things of God (Acts 26:18; 1 Cor. 2:10, 12; Eph. 1:17, 18), taking away their heart of stone, and giving unto them a heart of flesh (Ezek. 36:26); renewing their wills, and, by His almighty power determining them to that which is good (Ezek. 11:19; Phil. 2:13; Deut. 30:6; Ezek. 36:27), and effectually drawing them to Jesus Christ (Eph. 1:19; John 6:44, 45): yet so, as they come most freely, being made willing by His grace (Song. 1:4; Ps. 110:3; John 6:37; Rom. 6:16, 17, 18)."
            },
            {
              "id": 2,
              "text": "This effectual call is of God’s free and special grace alone, not from anything at all foreseen in man (2 Tim. 1:9; Tit. 3:4, 5; Eph. 2:4, 5, 8, 9; Rom. 9:11), who is altogether passive therein, until being quickened and renewed by the Holy Spirit (1 Cor. 2:14; Rom. 8:7; Eph. 2:5), he is thereby enabled to answer this call, and to embrace the grace offered and conveyed in it (John 6:37; Ezek. 36:27; John 5:25)."
            },
            {
              "id": 3,
              "text": "Elect infants, dying in infancy, are regenerated, and saved by Christ through the Spirit (Luke 18:15, 16, and Acts 2:38, 39 and John 3:3, 5 and 1 John 5:12 & Rom. 8:9 compared), who worketh when, and where, and how He pleaseth (John 3:8): so also, are all other elect persons who are uncapable of being outwardly called by the ministry of the Word (1 John 5:12; Acts 4:12)."
            },
            {
              "id": 4,
              "text": "Others, not elected, although they may be called by the ministry of the Word (Matt. 22:14), and may have some common operations of the Spirit (Matt. 7:22; Matt. 13:20, 21; Heb. 6:4, 5), yet they never truly come unto Christ, and therefore cannot be saved (John 6:64, 65, 66; John 8:24): much less can men, not professing the Christian religion, be saved in any other way whatsoever, be they never so diligent to frame their lives according to the light of nature, and the law of that religion they do profess (Acts 4:12; John 14:6; Eph. 2:12; John 4:22; John 17:3). And to assert and maintain that they may, is very pernicious, and to be detested (2 John 9, 10, 11; 1 Cor. 16:22; Gal. 1:6, 7, 8)."
            }
          ]
        },
        {
          "id": 11,
          "title": "Of Justification",
          "sections": [
            {
              "id": 1,
              "text": "Those whom God effectually calleth, He also freely justifieth (Rom. 8:30; Rom. 3:24); not by infusing righteousness into them, but by pardoning their sins, and by accounting and accepting their persons as righteous, not for anything wrought in them, or done by them, but for Christ’s sake alone; nor by imputing faith itself, the act of believing, or any other evangelical obedience to them, as their righteousness, but by imputing the obedience and satisfaction of Christ unto them (Rom. 4:5, 6, 7, 8; 2 Cor. 5:19, 21; Rom. 3:22, 24, 25, 27, 28; Tit. 3:5, 7; Eph. 1:7; Jer. 23:6; 1 Cor. 1:30, 31; Rom. 5:17, 18, 19), they receiving and resting on Him and His righteousness by faith; which faith they have not of themselves, it is the gift of God (Acts 10:43; Gal. 2:16; Phil. 3:19; Acts 13:38, 39; Eph. 2:7, 8)."
            },
            {
              "id": 2,
              "text": "Faith, thus receiving and resting on Christ and His righteousness, is the alone instrument of justification (John 1:12; Rom. 3:28; Rom. 5:1); yet is it not alone in the person justified, but is ever accompanied with all other saving graces, and is no dead faith, but worketh by love (Jam. 2:17, 22, 26; Gal. 5:6)."
            },
            {
              "id": 3,
              "text": "Christ, by His obedience and death, did fully discharge the debt of all those that are thus justified, and did make a proper, real, and full satisfaction to His Father’s justice in their behalf (Rom. 5:8, 9, 10, 19; 1 Tim. 2:5, 6; Heb. 10:10, 14; Dan. 9:24, 26; Isa. 53:4, 5, 6, 10, 11, 12). Yet, inasmuch as He was given by the Father for them (Rom. 8:32); and His obedience and satisfaction accepted in their stead (2 Cor. 5:21; Matt. 3:17; Eph. 5:2); and both freely, not for anything in them; their justification is only of free grace (Rom. 3:24; Eph. 1:7); that both the exact justice, and rich grace of God, might be glorified in the justification of sinners (Rom. 3:26; Eph. 2:7)."
            },
            {
              "id": 4,
              "text": "God did, from all eternity, decree to justify all the elect (Gal. 3:8; 1 Pet. 1:2, 19, 20; Rom. 8:30), and Christ did, in the fulness of time, die for their sins, and rise again for their justification (Gal. 4:4; 1 Tim. 2:6; Rom. 4:25): nevertheless, they are not justified, until the Holy Spirit doth, in due time, actually apply Christ unto them (Col. 1:21, 22; Gal. 2:16; Tit. 3:3, 4, 5, 6, 7)."
            },
            {
              "id": 5,
              "text":  "God doth continue to forgive the sins of those that are justified (Matt. 6:12; 1 John 1:7, 9; 1 John 2:1, 2): and although they can never fall from the state of justification (Luke 22:32; John 10:28; Heb. 10:14); yet they may, by their sins, fall under God’s fatherly displeasure, and not have the light of His countenance restored unto them, until they humble themselves, confess their sins, beg pardon, and renew their faith and repentance (Ps. 89:31, 32, 33; Ps. 51:7, 8, 9, 10, 11, 12; Ps. 32:5; Matt. 26:75; 1 Cor. 11:30, 32; Luke 1:20)."
            },
            {
              "id": 6,
              "text": "The justification of believers under the old testament was, in all these respects, one and the same with the justification of believers under the new testament (Gal. 3:9, 13, 14; Rom. 4:22, 23, 24; Heb. 13:8)."
            }
          ]
        },
        {
          "id": 12,
          "title": "Of Adoption",
          "text": "All those that are justified, God vouchsafeth, in and for His only Son Jesus Christ, to make partakers of the grace of adoption (Eph. 1:5): by which they are taken into the number, and enjoy the liberties and privileges of the children of God (Gal. 4:4, 5; Rom. 8:17; John 1:12), have His name put upon them (Jer. 14:9; 2 Cor. 6:18; Rev. 3:12), receive the spirit of adoption (Rom. 8:15), have access to the throne of grace with boldness (Eph. 3:12; Rom. 5:2), are enabled to cry, Abba, Father (Gal. 4:6), are pitied (Ps. 103:13), protected (Prov. 14:26), provided for (Matt. 6:30, 32; 1 Pet. 5:7), and chastened by Him as by a Father (Heb. 12:6); yet never cast off (Lam. 3:31), but sealed to the day of redemption (Eph. 4:30), and inherit the promises (Heb. 6:12), as heirs of everlasting salvation (1 Pet. 1:3, 4; Heb. 1:14)."
        },
        {
          "id": 13,
          "title": "Of Sanctification",
          "sections": [
            {
              "id": 1,
              "text": "They who are once effectually called and regenerated, having a new heart and a new spirit created in them, are further sanctified, really and personally, through the virtue of Christ’s death and resurrection (1 Cor. 6:11; Acts 20:32; Phil. 3:10; Rom. 6:5, 6), by His Word and Spirit dwelling in them (John 17:17; Eph. 5:26; 2 Thess. 2:13): the dominion of the whole body of sin is destroyed (Rom. 6:6, 14), and the several lusts thereof are more and more weakened and mortified (Gal. 5:24; Rom. 8:13); and they more and more quickened and strengthened in all saving graces (Col. 1:11; Eph. 3:16, 17, 18, 19), to the practice of true holiness, without which no man shall see the Lord (2 Cor. 7:1; Heb. 12:14)."
            },
            {
              "id": 2,
              "text": "This sanctification is throughout, in the whole man (1 Thess. 5:23); yet imperfect in this life, there abiding still some remnants of corruption in every part (1 John 1:10; Rom. 7:18, 23; Phil. 3:12): whence ariseth a continual and irreconcilable war; the flesh lusting against the Spirit, and the Spirit against the flesh (Gal. 5:17; 1 Pet. 2:11)."
            },
            {
              "id": 3,
              "text": "In which war, although the remaining corruption, for a time, may much prevail (Rom. 7:23); yet through the continual supply of strength from the sanctifying Spirit of Christ, the regenerate part doth overcome (Rom. 6:14; 1 John 5:4; Eph. 4:15, 16); and so, the saints grow in grace (2 Pet. 3:18; 2 Cor. 3:18), perfecting holiness in the fear of God (2 Cor. 7:1)."
            }
          ]
        },
        {
          "id": 14,
          "title": "Of Saving Faith",
          "sections": [
            {
              "id": 1,
              "text": "The grace of faith, whereby the elect are enabled to believe to the saving of their souls (Heb. 10:39), is the work of the Spirit of Christ in their hearts (2 Cor. 4:13; Eph. 1:17, 18, 19; Eph. 2:8); and is ordinarily wrought by the ministry of the Word (Rom. 10:14, 17): by which also, and by the administration of the sacraments, and prayer, it is increased and strengthened (1 Pet. 2:2; Acts 20:32; Rom. 4:11; Luke 17:5; Rom. 1:16, 17)."
            },
            {
              "id": 2,
              "text": "By this faith, a Christian believeth to be true whatsoever is revealed in the Word, for the authority of God Himself speaking therein (John 4:42; 1 Thess. 2:13; 1 John 5:10; Acts 24:14); and acteth differently upon that which each particular passage thereof containeth; yielding obedience to the commands (Rom. 16:26), trembling at the threatenings (Isa. 66:2), and embracing the promises of God for this life, and that which is to come (Heb. 11:13; 1 Tim. 4:8). But the principal acts of saving faith are accepting, receiving, and resting upon Christ alone for justification, sanctification, and eternal life, by virtue of the covenant of grace (John 1:12; Acts 16:31; Gal. 2:20; Acts 15:11)."
            },
            {
              "id": 3,
              "text": "This faith is different in degrees, weak or strong (Heb. 5:13, 14; Rom. 4:19, 20; Matt. 6:30; Matt. 8:10); may be often and many ways assailed, and weakened, but gets the victory (Luke 22:31, 32; Eph. 6:16; 1 John 5:4, 5); growing up in many to the attainment of a full assurance through Christ (Heb. 6:11, 12; Heb. 10:22; Col. 2:2), who is both the author and finisher of our faith (Heb. 12:2)."
            }
          ]
        },
        {
          "id": 15,
          "title": "Of Repentance unto Life",
          "sections": [
            {
              "id": 1,
              "text": "Repentance unto life is an evangelical grace (Zech. 12:10; Acts 11:18), the doctrine whereof is to be preached by every minister of the Gospel, as well as that of faith in Christ (Luke 24:47; Mark 1:15; Acts 20:21)."
            },
            {
              "id": 2,
              "text": "By it, a sinner, out of the sight and sense not only of the danger, but also of the filthiness and odiousness of his sins, as contrary to the holy nature and righteous law of God; and upon the apprehension of his mercy in Christ to such as are penitent, so grieves for, and hates his sins, as to turn from them all unto God (Ezek. 18:30, 31; Ezek. 36:31; Isa. 30:22; Ps. 51:4; Jer. 31:18, 19; Joel 2:12, 13; Amos 5:15; Ps. 119:128; 2 Cor. 7:11), purposing and endeavouring to walk with Him in all the ways of His commandments (Ps. 119:6, 59, 106; Luke 1:6; 2 Kings 23:25)."
            },
            {
              "id": 3,
              "text": "Although repentance be not to be rested in, as any satisfaction for sin, or any cause of the pardon thereof (Ezek. 36:31, 32; Ezek. 16:61, 62, 63), which is the act of God’s free grace in Christ (Hosea 14:2, 4; Rom. 3:24; Eph. 1:7); yet is it of such necessity to all sinners, that none may expect pardon without it (Luke 13:3, 5; Acts 17:30, 31)."
            },
            {
              "id": 4,
              "text": "As there is no sin so small, but it deserves damnation (Rom. 6:23; Rom. 5:12; Matt. 12:36), so there is no sin so great, that it can bring damnation upon those who truly repent (Isa. 55:7; Rom. 8:1; Isa. 1:16, 18)."
            },
            {
              "id": 5,
              "text": "Men ought not to content themselves with a general repentance, but it is every man’s duty to endeavour to repent of his particular sins, particularly (Ps. 19:13; Luke 19:8; 1 Tim. 1:13, 15)."
            },
            {
              "id": 6,
              "text": "As every man is bound to make private confession of his sins to God, praying for the pardon thereof (Ps. 51:4, 5, 7, 9, 14; Ps. 32:5, 6); upon which, and the forsaking of them, he shall find mercy (Prov. 28:13; 1 John 1:9): so, he that scandalizeth his brother, or the Church of Christ, ought to be willing, by a private or public confession, and sorrow for his sin, to declare his repentance to those that are offended (James 5:16; Luke 17:3, 4; Joshua 7:19; Ps. 51 throughout), who are thereupon to be reconciled to him, and in love to receive him (2 Cor. 2:8)."
            }
          ]
        },
        {
          "id": 16,
          "title": "Of Good Works",
          "sections": [
            {
              "id": 1,
              "text": "Good works are only such as God hath commanded in His holy Word (Micah 6:8; Rom. 12:2; Heb. 13:21), and not such as, without the warrant thereof, are devised by men, out of blind zeal, or upon any pretence of good intention (Matt. 15:9; Isa. 29:13; 1 Pet. 1:18; Rom. 10:2; John 16:2; 1 Sam. 15:21, 22, 23)."
            },
            {
              "id": 2,
              "text": "These good works, done in obedience to God’s commandments, are the fruits and evidences of a true and lively faith (James 2:18, 22): and by them believers manifest their thankfulness (Ps. 116:12, 13; 1 Pet. 2:9), strengthen their assurance (1 John 2:3, 5; 2 Pet. 1:5, 6, 7, 8, 9, 10), edify their brethren (2 Cor. 9:2; Matt. 5:16), adorn the profession of the Gospel (Tit. 2:5, 9, 10, 11, 12; 1 Tim. 6:1), stop the mouths of the adversaries (1 Pet. 2:15), and glorify God (1 Pet. 2:12; Phil. 1:11; John 15:8), whose workmanship they are, created in Christ Jesus thereunto (Eph. 2:10); that, having their fruit unto holiness, they may have the end, eternal life (Rom. 6:22)."
            },
            {
              "id": 3,
              "text": "Their ability to do good works is not at all of themselves, but wholly from the Spirit of Christ (John 15:4, 5; Ezek. 36:26, 27). And that they may be enabled thereunto, besides the graces they have already received, there is required an actual influence of the same Holy Spirit, to work in them to will and to do of His good pleasure (Phil. 2:13; Phil. 4:13; 2 Cor. 3:5): yet are they not hereupon to grow negligent, as if they were not bound to perform any duty, unless upon a special motion of the Spirit; but they ought to be diligent in stirring up the grace of God that is in them (Phil. 2:12; Heb. 6:11, 12; 2 Pet. 1:3, 5, 10, 11; Isa. 64:7; 2 Tim. 1:6; Acts 26:6, 7; Jude 20, 21)."
            },
            {
              "id": 4,
              "text": "They, who in their obedience attain to the greatest height which is possible in this life, are so far from being able to supererogate, and to do more than God requires, as that they fall short of much which in duty they are bound to do (Luke 17:10; Neh. 13:22; Job 9:2, 3; Gal. 5:17)."
            },
            {
              "id": 5,
              "text": "We cannot, by our best works, merit pardon of sin, or eternal life at the hand of God, by reason of the great disproportion that is between them and the glory to come; and the infinite distance that is between us and God, whom, by them, we can neither profit, nor satisfy for the debt of our former sins (Rom. 3:20; Rom. 4:2, 4, 6; Eph. 2:8, 9; Tit. 3:5, 6, 7; Rom. 8:18; Ps. 16:2; Job 22:2, 3; Job 35:7, 8), but when we have done all we can, we have done but our duty, and are unprofitable servants (Luke 17:10); and because, as they are good, they proceed from His Spirit (Gal. 5:22, 23); and as they are wrought by us, they are defiled, and mixed with so much weakness and imperfection, that they cannot endure the severity of God’s judgment (Isa. 64:6; Gal. 5:17; Rom. 7:15, 18; Ps. 143:2; Ps. 130:3)."
            },
            {
              "id": 6,
              "text": "Yet notwithstanding, the persons of believers being accepted through Christ, their good works also are accepted in Him (Eph. 1:6; 1 Pet. 2:5; Exod. 28:38; Gen. 4:4 with Heb. 11:4), not as though they were in this life wholly unblamable and unreproveable in God’s sight (Job. 9:20; Ps. 143:2); but that He, looking upon them in His Son, is pleased to accept and reward that which is sincere, although accompanied with many weaknesses and imperfections (Heb. 13:20, 21; 2 Cor. 8:12; Heb. 6:10; Matt. 25:21, 23)."
            },
            {
              "id": 7,
              "text": "Works done by unregenerate men, although, for the matter of them, they may be things which God commands, and of good use both to themselves and others (2 Kings 10:30, 31; 1 Kings 21:27, 29; Phil. 1:15, 16, 18): yet, because they proceed not from a heart purified by faith (Gen. 4:5 with Heb. 11:4; Heb. 11:6); nor are done in a right manner according to the Word (1 Cor. 13:3; Isa. 1:12); nor to a right end, the glory of God (Matt. 6:2, 5, 16); they are therefore sinful, and cannot please God, or make a man meet to receive grace from God (Hag. 2:14; Tit. 1:15; Amos 5:22, 23; Hosea 1:4; Rom. 9:16; Titus 3:5). And yet, their neglect of them is more sinful, and displeasing unto God (Ps. 14:4; Ps. 36:3; Job 21:14, 15; Matt. 25:41, 42, 43, 45; Matt. 23:23)."
            }
          ]
        },
        {
          "id": 17,
          "title": "Of the Perseverance of the Saints",
          "sections": [
            {
              "id": 1,
              "text": "They, whom God hath accepted in His Beloved, effectually called, and sanctified by His Spirit, can neither totally, nor finally, fall away from the state of grace: but shall certainly persevere therein to the end, and be eternally saved (Phil. 1:6; 2 Pet. 1:10; John 10:28, 29; 1 John 3:9; 1 Pet. 1:5, 9)."
            },
            {
              "id": 2,
              "text": "This perseverance of the saints depends not upon their own free will, but upon the immutability of the decree of election, flowing from the free and unchangeable love of God the Father (2 Tim. 2:18, 19; Jer. 31:3); upon the efficacy of the merit and intercession of Jesus Christ (Heb. 10:10, 14; Heb. 13:20, 21; Heb. 9:12, 13, 14, 15; Rom. 8:33 to the end; John 17:11, 24; Luke 22:32; Heb. 7:25); the abiding of the Spirit, and of the seed of God within them (John 14:16, 17; 1 John 2:27; 1 John 3:9); and the nature of the covenant of grace (Jer. 32:40): from all which ariseth also the certainty and infallibility thereof (John 10:28; 2 Thess. 3:3; 1 John 2:19)."
            },
            {
              "id": 3,
              "text": "Nevertheless, they may, through the temptations of Satan and of the world, the prevalency of corruption remaining in them, and the neglect of the means of their preservation, fall into grievous sins (Matt. 26:70, 72, 74); and, for a time, continue therein (Ps. 51 title and ver. 14): whereby they incur God’s displeasure (Isa. 64:5, 7, 9; 2 Sam. 11:27), and grieve His Holy Spirit (Eph. 4:30), come to be deprived of some measure of their graces and comforts (Ps. 51:8, 10, 12; Rev. 2:4; Song. 5:2, 3, 4, 6), have their hearts hardened (Isa. 63:17; Mark 6:52; Mark 16:14), and their consciences wounded (Ps. 32:3, 4; Ps. 51:8), hurt and scandalize others (2 Sam. 12:14), and bring temporal judgments upon themselves (Ps. 89:31, 32; 1 Cor. 11:32)."
            }
          ]
        },
        {
          "id": 18,
          "title": "Of the Assurance of Grace and Salvation",
          "sections": [
            {
              "id": 1,
              "text": "Although hypocrites and other unregenerate men may vainly deceive themselves with false hopes, and carnal presumptions of being in the favour of God, and estate of salvation (Job 8:13, 14; Mic. 3:11; Deut. 29:19; John 8:41); which hope of theirs shall perish (Matt. 7:22, 23): yet such as truly believe in the Lord Jesus, and love Him in sincerity, endeavouring to walk in all good conscience before Him, may, in this life, be certainly assured that they are in the state of grace (1 John 2:3; 1 John 3:14, 18, 19, 21, 24; 1 John 5:13), and may rejoice in the hope of the glory of God, which hope shall never make them ashamed (Rom. 5:2, 5)."
            },
            {
              "id": 2,
              "text": "This certainty is not a bare conjectural and probable persuasion, grounded upon a fallible hope (Heb. 6:11, 19); but an infallible assurance of faith, founded upon the divine truth of the promises of salvation (Heb. 6:17, 18), the inward evidence of those graces unto which these promises are made (2 Pet. 1:4, 5, 10, 11; 1 John 2:3; 1 John 3:14; 2 Cor. 1:12), the testimony of the Spirit of adoption witnessing with our spirits that we are the children of God (Rom. 8:15, 16): which Spirit is the earnest of our inheritance, whereby we are sealed to the day of redemption (Eph. 1:13, 14; Eph. 4:30; 2 Cor. 1:21, 22)."
            },
            {
              "id": 3,
              "text": "This infallible assurance doth not so belong to the essence of faith, but that a true believer may wait long, and conflict with many difficulties before he be partaker of it (1 John 5:13; Isa. 50:10; Mark 9:24; Ps. 88 throughout; Ps. 77:1–12): yet, being enabled by the Spirit to know the things which are freely given him of God, he may without extraordinary revelation, in the right use of ordinary means, attain thereunto (1 Cor. 2:12; 1 John 4:13; Heb. 6:11, 12; Eph. 3:17, 18, 19). And therefore it is the duty of everyone to give all diligence to make his calling and election sure (2 Pet. 1:10); that thereby his heart may be enlarged in peace and joy in the Holy Ghost, in love and thankfulness to God, and in strength and cheerfulness in the duties of obedience, the proper fruits of this assurance (Rom. 5:1, 2, 5; Rom. 14:17; Rom. 15:13; Eph. 1:3, 4; Ps. 4:6, 7; Ps. 119:32): so far is it from inclining men to looseness (1 John 2:1, 2; Rom. 6:1, 2; Tit. 2:11, 12, 14; 2 Cor. 7:1; Rom. 8:1, 12; 1 John 3:2, 3; Ps. 130:4; 1 John 1:6, 7)."
            },
            {
              "id": 4,
              "text": "True believers may have the assurance of their salvation divers ways shaken, diminished, and intermitted; as, by negligence in preserving of it, by falling into some special sin, which woundeth the conscience and grieveth the Spirit; by some sudden or vehement temptation, by God’s withdrawing the light of His countenance, and suffering even such as fear Him to walk in darkness and to have no light (Song. 5:2, 3, 6; Ps. 51:8, 12, 14; Eph. 4:30, 31; Ps. 77:1–10; Matt. 26:69, 70, 71, 72; Ps. 31:22; Ps. 88 throughout; Isa. 50:10): yet are they never so utterly destitute of that seed of God, and life of faith, that love of Christ and the brethren, that sincerity of heart, and conscience of duty, out of which, by the operation of the Spirit, this assurance may, in due time, be revived (1 John 3:9; Luke 22:32; Job 13:15; Ps. 73:15; Ps. 51:8, 12; Isa. 50:10); and by the which, in the mean time, they are supported from utter despair (Mic. 7:7, 8, 9; Jer. 32:40; Isa. 54:7, 8, 9, 10; Ps. 22:1; Ps. 88 throughout)."
            }
          ]
        },
        {
          "id": 19,
          "title": "Of the Law of God",
          "sections": [
            {
              "id": 1,
              "text": "God gave to Adam a law, as a covenant of works, by which He bound him and all his posterity to personal, entire, exact, and perpetual obedience; promised life upon the fulfilling, and threatened death upon the breach of it: and endued him with power and ability to keep it (Gen. 1:26, 27 with Gen. 2:17; Rom. 2:14, 15; Rom. 10:5; Rom. 5:12, 19; Gal. 3:10, 12; Eccles. 7:29; Job 28:28)."
            },
            {
              "id": 2,
              "text": "This law, after his fall, continued to be a perfect rule of righteousness, and, as such, was delivered by God upon Mount Sinai, in ten commandments, and written in two tables (James 1:25; James 2:8, 10, 11, 12; Rom. 13:8, 9; Deut. 5:32; Deut. 10:4; Ex. 34:1): the four first commandments containing our duty towards God; and the other six our duty to man (Matt. 22:37, 38, 39, 40)."
            },
            {
              "id": 3,
              "text": "Beside this law, commonly called moral, God was pleased to give to the people of Israel, as a church under age, ceremonial laws, containing several typical ordinances, partly of worship, prefiguring Christ, His graces, actions, sufferings, and benefits (Heb. 9 chap.; Heb. 10:1; Gal. 4:1, 2, 3; Col. 2:17); and partly holding forth divers instructions of moral duties (1 Cor. 5:7; 2 Cor. 6:17; Jude 23). All which ceremonial laws are now abrogated, under the new testament (Col. 2:14, 16, 17; Dan. 9:27; Eph. 2:15, 16)."
            },
            {
              "id": 4,
              "text": "To them also, as a body politic, He gave sundry judicial laws, which expired together with the State of that people; not obliging any other now, further than the general equity thereof may require (Ex. 21 chap.; Ex. 22:1–29; Gen. 49:10 with 1 Pet. 2:13, 14; Matt. 5:17, with Matt. 5:38, 39; 1 Cor. 9:8, 9, 10)."
            },
            {
              "id": 5,
              "text": "The moral law doth for ever bind all, as well justified persons as others, to the obedience thereof (Rom. 13:8, 9, 10; Eph. 6:2; 1 John 2:3, 4, 7, 8); and that, not only in regard of the matter contained in it, but also in respect of the authority of God the Creator, who gave it (James 2:10, 11): neither doth Christ, in the Gospel, any way dissolve, but much strengthen this obligation (Matt. 5:17, 18, 19; James 2:8; Rom. 3:31)."
            },
            {
              "id": 6,
              "text": "Although true believers be not under the law, as a covenant of works, to be thereby justified, or condemned (Rom. 6:14; Gal. 2:16; Gal. 3:13; Gal. 4:4, 5; Acts 13:39; Rom. 8:1); yet is it of great use to them, as well as to others; in that, as a rule of life informing them of the will of God, and their duty, it directs, and binds them to walk accordingly (Rom. 7:12, 22, 25; Ps. 119:4, 5, 6; 1 Cor. 7:19; Gal. 5:14, 16, 18, 19, 20, 21, 22, 23); discovering also the sinful pollutions of their nature, hearts, and lives (Rom. 7:7; Rom. 3:20); so as, examining themselves thereby, they may come to further conviction of, humiliation for, and hatred against sin (James 1:23, 24, 25; Rom. 7:9, 14, 24); together with a clearer sight of the need they have of Christ, and the perfection of His obedience (Gal. 3:24; Rom. 7:24, 25; Rom. 8:3, 4). It is likewise of use to the regenerate, to restrain their corruptions, in that it forbids sin (Jam. 2:11; Ps. 119:101, 104, 128): and the threatenings of it serve to show what even their sins deserve; and what afflictions, in this life, they may expect for them, although freed from the curse thereof threatened in the law (Ezra 9:13, 14; Ps. 89:30, 31, 32, 33, 34). The promises of it, in like manner, show them God’s approbation of obedience, and what blessings they may expect upon the performance thereof (Lev. 26:1–14 with 2 Cor. 6:16; Eph. 6:2, 3; Ps. 37:11 with Matt. 5:5; Ps. 19:11); although not as due to them by the law, as a covenant of works (Gal. 2:16; Luke 17:10). So as, a man’s doing good, and refraining from evil, because the law encourageth to the one and deterreth from the other, is no evidence of his being under the law; and not under grace (Rom. 6:12, 14; 1 Pet. 3:8, 9, 10, 11, 12, with Ps. 34:12, 13, 14, 15, 16; Heb. 12:28, 29)."
            },
            {
              "id": 7,
              "text": "Neither are the forementioned uses of the law contrary to the grace of the Gospel, but do sweetly comply with it (Gal. 3:21); the Spirit of Christ subduing and enabling the will of man to do that, freely and cheerfully, which the will of God, revealed in the law, requireth to be done (Ezek. 36:27; Heb. 8:10 with Jer. 31:33)."
            }
          ]
        },
        {
          "id": 20,
          "title": "Of Christian Liberty, and Liberty of Conscience",
          "sections": [
            {
              "id": 1,
              "text": "The liberty which Christ hath purchased for believers under the Gospel consists in their freedom from the guilt of sin, and condemning wrath of God, the curse of the moral law (Tit. 2:14; 1 Thess. 1:10; Gal. 3:13); and, in their being delivered from this present evil world, bondage to Satan, and dominion of sin (Gal. 1:4; Col. 1:13; Acts 26:18; Rom. 6:14); from the evil of afflictions, the sting of death, the victory of the grave, and everlasting damnation (Rom. 8:28; Ps. 119:71; 1 Cor. 15:54, 55, 56, 57; Rom. 8:1); as also, in their free access to God (Rom. 5:1, 2), and their yielding obedience unto Him, not out of slavish fear, but a child-like love and willing mind (Rom. 8:14, 15; 1 John 4:18). All which were common also to believers under the law (Gal. 3:9, 14). But, under the new testament, the liberty of Christians is further enlarged, in their freedom from the yoke of the ceremonial law, to which the Jewish Church was subjected (Gal. 4:1, 2, 3, 6, 7; Gal. 5:1; Acts 15:10, 11); and in greater boldness of access to the throne of grace (Heb. 4:14, 16; Heb. 10:19, 20, 21, 22), and in fuller communications of the free Spirit of God, than believers under the law did ordinarily partake of (John 7:38, 39; 2 Cor. 3:13, 17, 18)."
            },
            {
              "id": 2,
              "text": "God alone is Lord of the conscience (Jam. 4:12; Rom. 14:4), and hath left it free from the doctrines and commandments of men, which are in any thing contrary to His Word; or beside it, if matters of faith or worship (Acts 4:19; Acts 5:29; 1 Cor. 7:23; Matt. 23:8, 9, 10; 2 Cor. 1:24; Matt. 15:9). So that, to believe such doctrines, or to obey such commands, out of conscience (Col. 2:20, 22, 23; Gal. 1:10; Gal. 2:4, 5; Gal. 5:1), is to betray true liberty of conscience: and the requiring of an implicit faith, and an absolute and blind obedience is to destroy liberty of conscience, and reason also (Rom. 10:17; Rom. 14:23; Isa. 8:20; Acts 17:11; John 4:22; Hos. 5:11; Rev. 13:12, 16, 17; Jer. 8:9)."
            },
            {
              "id": 3,
              "text": "They who, upon pretence of Christian liberty, do practice any sin, or cherish any lust, do thereby destroy the end of Christian liberty, which is, that being delivered out of the hands of our enemies, we might serve the Lord, without fear, in holiness and righteousness before Him, all the days of our life (Gal. 5:13; 1 Pet. 2:16; 2 Pet. 2:19; John 8:34; Luke 1:74, 75)."
            },
            {
              "id": 4,
              "text": "And because the powers which God hath ordained, and the liberty which Christ hath purchased, are not intended by God to destroy, but mutually to uphold and preserve one another; they who, upon pretence of Christian liberty, shall oppose any lawful power, or the lawful exercise of it, whether it be civil or ecclesiastical, resist the ordinance of God (Matt. 12:25; 1 Pet. 2:13, 14, 16; Rom. 13:1–8; Heb. 13:17). And, for their publishing of such opinions, or maintaining of such practices, as are contrary to the light of nature, or to the known principles of Christianity, whether concerning faith, worship, or conversation; or, to the power of godliness; or, such erroneous opinions or practices, as either in their own nature, or in the manner of publishing or maintaining them, are destructive to the external peace and order which Christ hath established in the Church, they may lawfully be called to account, and proceeded against by the censures of the Church (Rom. 1:32 with 1 Cor. 5:1, 5, 11, 13; 2 John 10, 11, and 2 Thess. 3:14, and 1 Tim. 6:3, 4, 5, and Tit. 1:10, 11, 13, and Tit. 3:10 with Matt. 18:15, 16, 17; 1 Tim. 1:19, 20; Rev. 2:2, 14, 15, 20; Rev. 3:9), and by the power of the civil magistrate (Deut. 13:6–12; Rom. 13:3, 4 with 2 John 10, 11; Ezra 7:23, 25, 26, 27, 28; Rev. 17:12, 16, 17; Neh. 13:15, 17, 21, 22, 25, 30; 2 Kings 23:5, 6, 9, 20, 21; 2 Chron. 34:33; 2 Chron. 15:12, 13, 16; Dan. 3:29; 1 Tim. 2:2; Isa. 49:23; Zech. 13:2, 3)."
            }
          ]
        },
        {
          "id": 21,
          "title": "Of Religious Worship and the Sabbath-day",
          "sections": [
            {
              "id": 1,
              "text": "The light of nature showeth that there is a God, who hath lordship and sovereignty over all, is good, and doth good unto all, and is therefore to be feared, loved, praised, called upon, trusted in, and served, with all the heart, and with all the soul, and with all the might (Rom. 1:20; Acts 17:24; Ps. 119:68; Jer. 10:7; Ps. 31:23; Ps. 18:3; Rom. 10:12; Ps. 62:8; Josh. 24:14; Mark 12:33). But the acceptable way of worshipping the true God is instituted by Himself, and so limited by His own revealed will, that He may not be worshipped according to the imaginations and devices of men, or the suggestions of Satan, under any visible representation, or any other way not prescribed in the holy Scripture (Deut. 12:32; Matt. 15:9; Acts 17:25; Matt. 4:9, 10; Deut. 4:15–20; Exod. 20:4, 5, 6; Col. 2:23)."
            },
            {
              "id": 2,
              "text": "Religious worship is to be given to God, the Father, Son, and Holy Ghost; and to Him alone (Matt. 4:10 with John 5:23 and 2 Cor. 13:14); not to angels, saints, or any other creature (Col. 2:18, Rev. 19:10; Rom. 1:25): and since the fall, not without a Mediator; nor in the mediation of any other but of Christ alone (John 14:6; 1 Tim. 2:5; Eph. 2:18; Col. 3:17)."
            },
            {
              "id": 3,
              "text": "Prayer, with thanksgiving, being one special part of religious worship (Phil. 4:6), is by God required of all men (Ps. 65:2): and that it may be accepted, it is to be made in the name of the Son (John 14:13, 14; 1 Pet. 2:5), by the help of His Spirit (Rom. 8:26), according to His will (1 John 5:14), with understanding, reverence, humility, fervency, faith, love, and perseverance (Ps. 47:7; Eccles. 5:1, 2; Heb. 12:28; Gen. 18:27; James 5:16; James 1:6, 7; Mark 11:24; Matt. 6:12, 14, 15; Col. 4:2; Eph. 6:18); and, if vocal, in a known tongue (1 Cor. 14:14)."
            },
            {
              "id": 4,
              "text": "Prayer is to be made for things lawful (1 John 5:14); and for all sorts of men living, or that shall live hereafter (1 Tim. 2:1, 2; John 17:20; 2 Sam. 7:29; Ruth 4:12): but not for the dead (2 Sam. 12:21, 22, 23 with Luke 16:25, 26; Rev. 14:13), nor for those of whom it may be known that they have sinned the sin unto death (1 John 5:16)."
            },
            {
              "id": 5,
              "text": "The reading of the Scriptures with godly fear (Acts 15:21; Rev. 1:3), the sound preaching (2 Tim. 4:2) and conscionable hearing of the Word, in obedience unto God, with understanding, faith and reverence (James 1:22; Acts 10:33; Matt. 13:19; Heb. 4:2; Isa. 66:2); singing of psalms with grace in the heart (Col. 3:16; Eph. 5:19; James 5:13); as also, the due administration and worthy receiving of the sacraments instituted by Christ; are all parts of the ordinary religious worship of God (Matt. 28:19; 1 Cor. 11:23 to 29; Acts 2:42): beside religious oaths (Deut. 6:13 with Neh. 10:29), vows (Isa. 19:21 with Eccles. 5:4, 5), solemn fastings (Joel 2:12; Esther 4:16; Matt. 9:15; 1 Cor. 7:5), and thanksgivings, upon special occasions (Ps. 107 throughout; Esther 9:22), which are, in their several times and seasons, to be used in a holy and religious manner (Heb. 12:28)."
            },
            {
              "id": 6,
              "text": "Neither prayer, nor any other part of religious worship, is now under the Gospel either tied unto, or made more acceptable by any place in which it is performed, or towards which it is directed (John 4:21): but God is to be worshipped everywhere (Mal. 1:11; 1 Tim. 2:8), in spirit and truth (John 4:23, 24); as in private families (Jer. 10:25; Deut. 6:6, 7; Job 1:5; 2 Sam. 6:18, 20; 1 Pet. 3:7; Acts 10:2) daily (Matt. 6:11), and in secret each one by himself (Matt. 6:6; Eph. 6:18); so, more solemnly, in the public assemblies, which are not carelessly or wilfully to be neglected, or forsaken, when God, by His Word or providence, calls thereunto (Isa. 56:6, 7; Heb. 10:25; Prov. 1:20, 21, 24; Prov. 8:34; Acts 13:42; Luke 4:16; Acts 2:42)."
            },
            {
              "id": 7,
              "text": "As it is the law of nature, that, in general, a due proportion of time be set apart for the worship of God; so, in His Word, by a positive, moral, and perpetual commandment, binding all men, in all ages, He hath particularly appointed one day in seven, for a Sabbath, to be kept holy unto Him (Exod. 20:8, 10, 11; Isa. 56:2, 4, 6, 7): which, from the beginning of the world to the resurrection of Christ, was the last day of the week; and, from the resurrection of Christ, was changed into the first day of the week (Gen. 2:2, 3; 1 Cor. 16:1, 2; Acts 20:7), which, in Scripture, is called the Lord’s Day (Rev. 1:10), and is to be continued to the end of the world, as the Christian Sabbath (Exod. 20:8, 10, with Matt. 5:17, 18)."
            },
            {
              "id": 8,
              "text": "This Sabbath is then kept holy unto the Lord, when men, after a due preparing of their hearts, and ordering of their common affairs beforehand, do not only observe an holy rest, all the day, from their own works, words, and thoughts about their worldly employments and recreations (Exod. 20:8; Exod. 16:23, 25, 26, 29, 30; Exod. 31:15, 16, 17; Isa. 58:13; Neh. 13:15, 16, 17, 18, 19, 21, 22), but also are taken up the whole time in the public and private exercises of His worship, and in the duties of necessity and mercy (Isa. 58:13; Matt. 12:1–13)."
            }
          ]
        },
        {
          "id": 22,
          "title": "Of Lawful Oaths and Vows",
          "sections": [
            {
              "id": 1,
              "text": "A lawful oath is a part of religious worship (Deut. 10:20), wherein, upon just occasion, the person swearing solemnly calleth God to witness what he asserteth, or promiseth, and to judge him according to the truth or falsehood of what he sweareth (Exod. 20:7; Lev. 19:12; 2 Cor. 1:23, 2 Chron. 6:22, 23)."
            },
            {
              "id": 2,
              "text": "The name of God only is that by which men ought to swear; and therein it is to be used with all holy fear and reverence (Deut. 6:13). Therefore, to swear vainly or rashly, by that glorious and dreadful Name; or, to swear at all by any other thing, is sinful, and to be abhorred (Exod. 20:7; Jer. 5:7; Matt. 5:34, 37; James 5:12). Yet, as in matters of weight and moment, an oath is warranted by the Word of God, under the New Testament, as well as under the Old (Heb. 6:16; 2 Cor. 1:23; Isa. 65:16); so a lawful oath, being imposed by lawful authority, in such matters ought to be taken (1 Kings 8:31; Neh. 13:25; Ezra 10:5)."
            },
            {
              "id": 3,
              "text": "Whosoever taketh an oath ought duly to consider the weightiness of so solemn an act; and therein to avouch nothing, but what he is fully persuaded is the truth (Exod. 20:7; Jer. 4:2). Neither may any man bind himself by oath to anything but what is good and just, and what he believeth so to be, and what he is able and resolved to perform (Gen. 24:2, 3, 5, 6, 8, 9). Yet is it a sin to refuse an oath touching anything that is good and just, being imposed by lawful authority (Num. 5:19, 21; Neh. 5:12; Exod. 22:7, 8, 9, 10, 11)."
            },
            {
              "id": 4,
              "text": "An oath is to be taken in the plain and common sense of the words, without equivocation, or mental reservation (Jer. 4:2; Ps. 24:4). It cannot oblige to sin: but in anything not sinful, being taken, it binds to performance, although to a man’s own hurt (1 Sam. 25:22, 32, 33, 34; Ps. 15:4). Not is it to be violated, although made to heretics, or infidels (Ezek. 17:16, 18, 19; Josh. 9:18, 19 with 2 Sam. 21:1)."
            },
            {
              "id": 5,
              "text": "A vow is of the like nature with a promissory oath, and ought to be made with the like religious care, and to be performed with the like faithfulness (Isa. 19:21; Eccles. 5:4, 5, 6; Ps. 61:8; Ps. 66:13, 14)."
            },
            {
              "id": 6,
              "text": "It is not to be made to any creature, but to God alone (Ps. 76:11; Jer. 44:25, 26): and that it may be accepted, it is to be made voluntarily, out of faith, and conscience of duty, in way of thankfulness for mercy received, or for the obtaining of what we want; whereby we more strictly bind ourselves to necessary duties; or to other things, so far and so long as they may fitly conduce thereunto (Deut. 23:21, 22, 23; Ps. 50:14; Gen. 28:20, 21, 22; 1 Sam. 1:11; Ps. 66:13, 14; Ps. 132:2, 3, 4, 5)."
            },
            {
              "id": 7,
              "text": "No man may vow to do anything forbidden in the Word of God, or what would hinder any duty therein commanded, or which is not in his own power, and for the performance whereof he hath no promise of ability from God (Acts 23:12, 14; Mark 6:26; Numb. 30:5, 8, 12, 13). In which respects, Popish monastical vows of perpetual single life, professed poverty, and regular obedience, are so far from being degrees of higher perfection, that they are superstitious and sinful snares, in which no Christian may entangle himself (Matt. 19:11, 12; 1 Cor. 7:2, 9; Eph. 4:28; 1 Peter 4:2; 1 Cor. 7:23)."
            }
          ]
        },
        {
          "id": 23,
          "title": "Of the Civil Magistrate",
          "sections": [
            {
              "id": 1,
              "text": "God, the supreme Lord and King of all the world, hath ordained civil magistrates, to be, under Him, over the people, for His own glory, and the public good: and, to this end, hath armed them with the power of the sword, for the defence and encouragement of them that are good, and for the punishment of evil doers (Rom. 13:1, 2, 3, 4; 1 Pet. 2:13, 14)."
            },
            {
              "id": 2,
              "text": "It is lawful for Christians to accept and execute the office of a magistrate, when called thereunto (Prov. 8:15, 16; Rom. 13:1, 2, 4); in the managing whereof, as they ought especially to maintain piety, justice, and peace, according to the wholesome laws of each commonwealth (Ps. 2:10, 11, 12; 1 Tim. 2:2; Ps. 82:3, 4; 2 Sam. 23:3; 1 Pet. 2:13); so for that end, they may lawfully now, under the New Testament, wage war, upon just and necessary occasion (Luke 3:14; Rom. 13:4; Matt. 8:9, 10; Acts 10:1, 2; Rev. 17:14, 16)."
            },
            {
              "id": 3,
              "text": "The civil magistrate may not assume to himself the administration of the Word and sacraments, or the power of the keys of the kingdom of heaven (2 Chron. 26:18 with Matt. 18:17 and Matt. 16:19; 1 Cor. 12:28, 29; Eph. 4:11, 12; 1 Cor. 4:1, 2; Rom. 10:15; Heb. 5:4): yet he hath authority, and it is his duty, to take order, that unity and peace be. preserved in the Church, that the truth of God be kept pure and entire; that all blasphemies and heresies be suppressed; all corruptions and abuses in worship and discipline prevented or reformed; and all the ordinances of God duly settled, administrated, and observed (Isa. 49:23; Ps. 122:9; Ezra 7:23, 25, 26, 27, 28; Lev. 24:16; Deut. 13:5, 6, 12; 1 Kings 18:4; 1 Chron. 13:1–9; 2 Kings 23:1–26; 2 Chron. 34:33; 2 Chron. 15:12, 13). For the better effecting whereof, he hath power to call synods, to be present at them, and to provide that whatsoever is transacted in them be according to the mind of God (2 Chron. 19:8, 9, 10, 11; 2 Chron. 29, 30; Matt. 2:4, 5)."
            },
            {
              "id": 4,
              "text": "It is the duty of people to pray for magistrates (1 Tim. 2:1, 2), to honour their persons (1 Pet. 2:17), to pay them tribute or other dues (Rom. 13:6, 7), to obey their lawful commands, and to be subject to their authority, for conscience’ sake (Rom. 13:5; Tit. 3:1). Infidelity, or difference in religion, doth not make void the magistrates’ just and legal authority, nor free the people from their due obedience to them (1 Pet. 2:13, 14, 16): from which ecclesiastical persons are not exempted (Rom. 13:1; 1 Kings 2:35; Acts 25:9, 10, 11; 2 Pet. 2:1, 10, 11; Jude 8, 9, 10, 11), much less hath the Pope any power and jurisdiction over them in their dominions, or over any of their people; and, least of all, to deprive them of their dominions, or lives, if he shall judge them to be heretics, or upon any other pretence whatsoever (2 Thess. 2:4; Rev. 13:15, 16, 17)."
            }
          ]
        },
        {
          "id": 24,
          "title": "Of Marriage and Divorce",
          "sections": [
            {
              "id": 1,
              "text": "Marriage is to be between one man and one woman: neither is it lawful for any man to have more than one wife, nor for any woman to have more than one husband; at the same time (Gen. 2:24; Matt. 19:5, 6; Prov. 2:17)."
            },
            {
              "id": 2,
              "text": "Marriage was ordained for the mutual help of husband and wife (Gen. 2:18), for the increase of mankind with a legitimate issue, and of the Church with an holy seed (Mal. 2:15); and for preventing of uncleanness (1 Cor. 7:2, 9)."
            },
            {
              "id": 3,
              "text": "It is lawful for all sorts of people to marry, who are able with judgment to give their consent (Heb. 13:4; 1 Tim. 4:3; 1 Cor. 7:36, 37, 38; Gen. 24:57, 58). Yet is it the duty of Christians to marry only in the Lord (1 Cor. 7:39): and therefore such as profess the true reformed religion should not marry with infidels, papists, or other idolaters: neither should such as are godly be unequally yoked, by marrying with such as are notoriously wicked in their life, or maintain damnable heresies (Gen. 34:14; Exod. 34:16; Deut. 7:3, 4; 1 Kings 11:4; Neh. 13:25, 26, 27; Mal. 2:11, 12; 2 Cor. 6:14)."
            },
            {
              "id": 4,
              "text": "Marriage ought not to be within the degrees of consanguinity or affinity forbidden by the Word (Lev. 18; 1 Cor. 5:1; Amos 2:7); nor can such incestuous marriages ever be made lawful by any law of man or consent of parties, so as those persons may live together as man and wife (Mark 6:18; Lev. 18:24, 25, 26, 27, 28). The man may not marry any of his wife’s kindred nearer in blood than he may of his own; nor the woman of her husband’s kindred nearer in blood than of her own (Lev. 20:19, 20, 21)."
            },
            {
              "id": 5,
              "text": "Adultery or fornication committed after a contract, being detected before marriage, giveth just occasion to the innocent party to dissolve that contract (Matt. 1:18, 19, 20). In the case of adultery after marriage, it is lawful for the innocent party to sue out a divorce (Matt. 5:31, 32): and, after the divorce, to marry another, as if the offending party were dead (Matt. 19:9; Rom. 7:2, 3)."
            },
            {
              "id": 6,
              "text": "Although the corruption of man be such as is apt to study arguments unduly to put asunder those whom God hath joined together in marriage: yet nothing but adultery, or such wilful desertion as can no way be remedied by the Church or civil magistrate, is cause sufficient of dissolving the bond of marriage (Matt. 19:8, 9; 1 Cor. 7:15; Matt. 19:6): wherein, a public and orderly course of proceeding is to be observed; and the persons concerned in it not left to their own wills and discretion, in their own case (Deut. 24:1, 2, 3, 4)."
            }
          ]
        },
        {
          "id": 25,
          "title": "Of the Church",
          "sections": [
            {
              "id": 1,
              "text": "The catholic or universal Church which is invisible, consists of the whole number of the elect, that have been, are, or shall be gathered into one, under Christ the Head thereof; and is the spouse, the body, the fulness of Him that filleth all in all (Eph. 1:10, 22, 23; Eph. 5:23, 27, 32; Col. 1:18)."
            },
            {
              "id": 2,
              "text": "The visible Church, which is also catholic or universal under the Gospel (not confined to one nation as before under the law), consists of all those throughout the world that profess the true religion (1 Cor. 1:2; 1 Cor. 12:12, 13; Ps. 2:8; Rev. 7:9; Rom. 15:9, 10, 11, 12); and of their children (1 Cor. 7:14; Acts 2:39; Ezek. 16:20, 21; Rom. 11:16; Gen. 3:15; Gen. 17:7): and is the kingdom of the Lord Jesus Christ (Matt. 13:47; Isa. 9:7), the house and family of God (Eph. 2:19; Eph. 3:15), out of which there is no ordinary possibility of salvation (Acts 2:47)."
            },
            {
              "id": 3,
              "text": "Unto this catholic visible Church Christ hath given the ministry, oracles, and ordinances of God, for the gathering and perfecting of the saints, in this life, to the end of the world: and doth by His own presence and Spirit, according to His promise, make them effectual thereunto (1 Cor. 12:28; Eph. 4:11, 12, 13; Matt. 28:19, 20; Isa. 59:21)."
            },
            {
              "id": 4,
              "text": "This catholic Church hath been sometimes more, sometimes less visible (Rom. 11:3, 4; Rev. 12:6, 14). And particular Churches, which are members thereof, are more or less pure, according as the doctrine of the Gospel is taught and embraced, ordinances administered, and public worship performed more or less purely in them (Rev. 2, 3; 1 Cor. 5:6, 7)."
            },
            {
              "id": 5,
              "text": "The purest Churches under heaven are subject both to mixture and error (1 Cor. 13:12; Rev. 2, 3; Matt. 13:24, 25, 26, 27, 28, 29, 30, 47): and some have so degenerated, as to become no Churches of Christ, but synagogues of Satan (Rev. 18:2; Rom. 11:18, 19, 20, 21, 22). Nevertheless, there shall be always a Church on earth, to worship God according to His will (Matt. 16:18; Ps. 72:17; Ps. 102:28; Matt. 28:19, 20)."
            },
            {
              "id": 6,
              "text": "There is no other head of the Church, but the Lord Jesus Christ (Col. 1:18; Eph. 1:22); nor can the Pope of Rome, in any sense, be head thereof; but is that Antichrist, that man of sin, and son of perdition, that exalteth himself, in the Church, against Christ and all that is called God (Matt. 23:8, 9, 10; 2 Thess. 2:3, 4, 8, 9; Rev. 13:6)."
            }
          ]
        },
        {
          "id": 26,
          "title": "Of the Communion of the Saints",
          "sections": [
            {
              "id": 1,
              "text": "All saints, that are united to Jesus Christ their Head by His Spirit and by faith, have fellowship with Him in His grace, sufferings, death, resurrection, and glory (John 1:3; Eph. 3:16, 17, 18, 19; John 1:16; Eph. 2:5, 6; Phil. 3:10; Rom. 6:5, 6; 2 Tim. 2:12): and, being united to one another in love, they have communion in each other’s gifts and graces (Eph. 4:15, 16; 1 Cor. 12:7; 1 Cor. 3:21, 22, 23; Col. 2:19), and are obliged to the performance of such duties, public and private, as do conduce to their mutual good, both in the inward and outward man (1 Thess. 5:11, 14; Rom. 1:11, 12, 14; 1 John 3:16, 17, 18; Gal. 6:10)."
            },
            {
              "id": 2,
              "text": "Saints by profession are bound to maintain a holy fellowship and communion in the worship of God; and in performing such other spiritual services as tend to their mutual edification (Heb. 10:24, 25; Acts 2:42, 46; Isa. 2:3; 1 Cor. 11:20); as also in relieving each other in outward things, according to their several abilities, and necessities. Which communion, as God offereth opportunity, is to be extended unto all those who, in every place, call upon the name of the Lord Jesus (Acts 2:44, 45; 1 John 3:17; 2 Cor. 8, 9; Acts 11:29, 30)."
            },
            {
              "id": 3,
              "text": "This communion which the saints have with Christ, doth not make them, in any wise, partakers of the substance of His Godhead; or to be equal with Christ, in any respect: either of which to affirm is impious and blasphemous (Col. 1:18, 19; 1 Cor. 8:6; Isa. 42:8; 1 Tim. 6:15, 16; Ps. 45:7, with Heb. 1:8, 9). Nor doth their communion one with another, as saints, take away, or infringe the title or propriety which each man hath in his goods and possessions (Exod. 20:15; Eph. 4:28; Acts 5:4)."
            }
          ]
        },
        {
          "id": 27,
          "title": "Of the Sacraments",
          "sections": [
            {
              "id": 1,
              "text": "Sacraments are holy signs and seals of the covenant of grace (Rom. 4:11; Gen. 17:7, 10), immediately instituted by God (Matt. 28:19; 1 Cor. 11:23), to represent Christ and His benefits; and to confirm our interest in Him (1 Cor. 10:16; 1 Cor. 11:25, 26; Gal. 3:17); as also, to put a visible difference between those that belong unto the Church, and the rest of the world (Rom. 15:8; Exod. 12:48; Gen. 34:14); and solemnly to engage them to the service of God in Christ, according to His Word (Rom. 6:3, 4; 1 Cor. 10:16, 21)."
            },
            {
              "id": 2,
              "text": "There is in every sacrament a spiritual relation, or sacramental union, between the sign and the thing signified: whence it comes to pass, that the names and effects of the one are attributed to the other (Gen. 17:10; Matt. 26:27, 28; Tit. 3:5)."
            },
            {
              "id": 3,
              "text": "The grace which is exhibited in or by the sacraments rightly used, is not conferred by any power in them; neither doth the efficacy of a sacrament depend upon the piety or intention of him that doth administer it (Rom. 2:28, 29; 1 Pet. 3:21): but upon the work of the Spirit (Matt. 3:11; 1 Cor. 12:13), and the word of institution, which contains, together with a precept authorizing the use thereof, a promise of benefit to worthy receivers (Matt. 26:27, 28; Matt. 28:19, 20)."
            },
            {
              "id": 4,
              "text": "There are only two sacraments ordained by Christ our Lord in the Gospel; that is to say, Baptism and the Supper of the Lord: neither of which may be dispensed by any but by a minister of the Word lawfully ordained (Matt. 28:19; 1 Cor. 11:20, 23, 1 Cor. 4:1; Heb. 5:4)."
            },
            {
              "id": 5,
              "text": "The sacraments of the Old Testament, in regard to the spiritual things thereby signified and exhibited, were, for substance, the same with those of the New (1 Cor. 10:1, 2, 3, 4)."
            }
          ]
        },
        {
          "id": 28,
          "title": "Of Baptism",
          "sections": [
            {
              "id": 1,
              "text": "Baptism is a sacrament of the New Testament, ordained by Jesus Christ (Matt. 28:19), not only for the solemn admission of the party baptized into the visible Church (1 Cor. 12:13); but also, to be unto him a sign and seal of the covenant of grace (Rom. 4:11 with Col. 2:11, 12), of his ingrafting into Christ (Gal. 3:27; Rom. 6:5), of regeneration (Tit. 3:5), of remission of sins (Mark 1:4), and of his giving up unto God through Jesus Christ, to walk in the newness of life (Rom. 6:3, 4). Which sacrament is, by Christ’s own appointment, to be continued in His Church until the end of the world (Matt. 28:19, 20)."
            },
            {
              "id": 2,
              "text": "The outward element to be used in this sacrament is water, wherewith the party is to be baptized, in the name of the Father, and of the Son, and of the Holy Ghost, by a minister of the Gospel, lawfully called thereunto (Matt. 3:11; John 1:33; Matt. 28:19, 20)."
            },
            {
              "id": 3,
              "text": "Dipping of the person into the water is not necessary; but Baptism is rightly administered by pouring or sprinkling water upon the person (Heb. 9:10, 19, 20, 21, 22; Acts 2:41; Acts 16:33; Mark 7:4)."
            },
            {
              "id": 4,
              "text": "Not only those that do actually profess faith in and obedience unto Christ (Mark 16:15, 16; Acts 8:37, 38), but also the infants of one or both believing parents, are to be baptized (Gen. 17:7, 9, 10 with Gal. 3:9, 14 and Col. 2:11, 12 & Acts 2:38, 39 & Rom. 4:11, 12; 1 Cor. 7:14; Matt. 28:19; Mark 10:13, 14, 15, 16; Luke 18:15)."
            },
            {
              "id": 5,
              "text": "Although it be a great sin to contemn or neglect this ordinance (Luke 7:30 with Exod. 4:24, 25, 26), yet grace and salvation are not so inseparably annexed unto it, as that no person can be regenerated or saved without it (Rom. 4:11; Acts 10:2, 4, 22, 31, 45, 47); or, that all that are baptized are undoubtedly regenerated (Acts 8:13, 23)."
            },
            {
              "id": 6,
              "text": "The efficacy of Baptism is not tied to that moment of time wherein it is administered (John 3:5, 8); yet notwithstanding, by the right use of this ordinance, the grace promised is not only offered, but really exhibited and conferred, by the Holy Ghost, to such (whether of age or infants) as that grace belongeth unto, according to the counsel of God’s own will, in His appointed time (Gal. 3:27; Titus 3:5; Eph. 5:25, 26; Acts 2:38, 41)."
            },
            {
              "id": 7,
              "text": "The sacrament of Baptism is but once to be administered unto any person (Titus 3:5)."
            }
          ]
        },
        {
          "id": 29,
          "title": "Of the Lord’s Supper",
          "sections": [
            {
              "id": 1,
              "text": "Our Lord Jesus, in the night wherein He was betrayed, instituted the sacrament of His body and blood, called the Lord’s Supper, to be observed in His Church, unto the end of the world, for the perpetual remembrance of the sacrifice of Himself in His death; the sealing all benefits thereof unto true believers, their spiritual nourishment and growth in Him, their further engagement in and to all duties which they owe unto Him; and to be a bond and pledge of their communion with Him, and with each other, as members of His mystical body (1 Cor. 11:23, 24, 25, 26; 1 Cor. 10:16, 17, 21; 1 Cor. 12:13)."
            },
            {
              "id": 2,
              "text": "In this sacrament, Christ is not offered up to His Father; nor any real sacrifice made at all for remission of sins of the quick or dead (Heb. 9:22, 25, 26, 28); but only a commemoration of that one offering up of Himself, by Himself, upon the cross, once for all: and a spiritual oblation of all possible praise unto God for the same (1 Cor. 11:24, 25, 26; Matt. 26:26, 27): so that the Popish sacrifice of the mass (as they call it) is most abominably injurious to Christ’s one, only sacrifice, the alone propitiation for all the sins of His elect (Heb. 7:23, 24, 27; Heb. 10:11, 12, 14, 18)."
            },
            {
              "id": 3,
              "text": "The Lord Jesus hath, in this ordinance, appointed His ministers to declare His word of institution to the people; to pray, and bless the elements of bread and wine, and thereby to set them apart from a common to a holy use; and to take and break the bread, to take the cup, and (they communicating also themselves) to give both to the communicants (Matt. 26:26, 27, 28 & Mark 14:22, 23, 24 and Luke 22:19, 20 with 1 Cor. 11:23, 24, 25, 26); but to none who are not then present in the congregation (Acts. 20:7; 1 Cor. 11:20)."
            },
            {
              "id": 4,
              "text": "Private masses, or receiving this sacrament by a priest or any other alone (1 Cor. 10:16); as likewise, the denial of the cup to the people (Mark 14:23; 1 Cor. 11:25, 26, 27, 28, 29), worshipping the elements, the lifting them up or carrying them about for adoration, and the reserving them for any pretended religious use; are all contrary to the nature of this sacrament, and to the institution of Christ (Matt. 15:9)."
            },
            {
              "id": 5,
              "text": "The outward elements in this sacrament, duly set apart to the uses ordained by Christ, have such relation to Him crucified, as that, truly, yet sacramentally only, they are sometimes called by the name of the things they represent, to wit, the body and blood of Christ (Matt. 26:26, 27, 28); albeit in substance and nature they still remain truly and only bread and wine, as they were before (1 Cor. 11:26, 27, 28; Matt. 26:29)."
            },
            {
              "id": 6,
              "text": "That doctrine which maintains a change of the substance of bread and wine into the substance of Christ’s body and blood (commonly called transubstantiation) by consecration of a priest, or by any other way, is repugnant, not to Scripture alone, but even to common sense and reason; overthroweth the nature of the sacrament, and hath been, and is the cause of manifold superstitions; yea, of gross idolatries (Acts 3:21 with 1 Cor. 11:24, 25, 26; Luke 24:6, 39)."
            },
            {
              "id": 7,
              "text": "Worthy receivers outwardly partaking of the visible elements in this sacrament (1 Cor. 11:28), do then also, inwardly by faith, really and indeed, yet not carnally and corporally, but spiritually, receive and feed upon Christ crucified, and all benefits of His death: the body and blood of Christ being then, not corporally or carnally, in, with, or under the bread and wine; yet, as really, but spiritually, present to the faith of believers in that ordinance, as the elements themselves are to their outward senses (1 Cor. 10:16)."
            },
            {
              "id": 8,
              "text": "Although ignorant and wicked men receive the outward elements in this sacrament: yet they receive not the thing signified thereby, but by their unworthy coming thereunto are guilty of the body and blood of the Lord to their own damnation. Wherefore, all ignorant and ungodly persons, as they are unfit to enjoy communion with Him, so are they unworthy of the Lord’s table; and cannot, without great sin against Christ while they remain such, partake of these holy mysteries (1 Cor. 11:27, 28, 29; 2 Cor. 6:14, 15, 16), or be admitted thereunto (1 Cor. 5:6, 7, 13; 2 Thess. 3:6, 14, 15; Matt. 7:6)."
            }
          ]
        },
        {
          "id": 30,
          "title": "Of Church Censures",
          "sections": [
            {
              "id": 1,
              "text": "The Lord Jesus, as King and Head of His Church, hath therein appointed a government, in the hand of Church officers, distinct from the civil magistrate (Isa. 9:6, 7; 1 Tim. 5:17; 1 Thess. 5:12; Acts 20:17, 28; Heb. 13:7, 17, 24; 1 Cor. 12:28; Matt. 28:18, 19, 20)."
            },
            {
              "id": 2,
              "text": "To these officers the keys of the kingdom of heaven are committed: by virtue whereof, they have power respectively to retain, and remit sins; to shut that kingdom against the impenitent, both by the Word and censures; and to open it unto penitent sinners, by the ministry of the Gospel, and by absolution from censures, as occasion shall require (Matt. 16:19; Matt. 18:17, 18; John 20:21, 22, 23; 2 Cor. 2:6, 7, 8)."
            },
            {
              "id": 3,
              "text": "Church censures are necessary, for the reclaiming and gaining of offending brethren, for deterring of others from the like offences, for purging out of that leaven which might infect the whole lump, for vindicating the honour of Christ, and the holy profession of the Gospel, and for preventing the wrath of God, which might justly fall upon the Church, if they should suffer His covenant and the seals thereof to be profaned by notorious and obstinate offenders (1 Cor. 5 chap.; 1 Tim. 5:20; Matt. 7:6; 1 Tim. 1:20; 1 Cor. 11:27 to the end, with Jude 23)."
            },
            {
              "id": 4,
              "text": "For the better attaining of these ends, the officers of the Church are to proceed by admonition; suspension from the sacrament of the Lord’s Supper for a season; and by excommunication from the Church; according to the nature of the crime, and demerit of the person (1 Thess. 5:12; 2 Thess. 3:6, 14, 15; 1 Cor. 5:4, 5, 13; Matt. 18:17; Tit. 3:10)."
            }
          ]
        },
        {
          "id": 31,
          "title": "Of Synods and Councils",
          "sections": [
            {
              "id": 1,
              "text": "For the better government, and further edification of the Church, there ought to be such assemblies as are commonly called synods or councils (Acts 15:2, 4, 6)."
            },
            {
              "id": 2,
              "text": "As magistrates may lawfully call a synod of ministers, and other fit persons, to consult and advise with, about matters of religion (Isa. 49:23; 1 Tim. 2:1, 2; 2 Chron. 19:8, 9, 10, 11; 2 Chron. 29, 30 chaps.; Matt. 2:4, 5; Prov. 11:14); so, if magistrates be open enemies to the Church, the ministers of Christ of themselves, by virtue of their office, or they, with other fit persons upon delegation from their Churches, may meet together in such assemblies (Acts 15:2, 4, 22, 23, 25)."
            },
            {
              "id": 3,
              "text": "It belongs to synods and councils, ministerially to determine controversies of faith and cases of conscience; to set down rules and directions for the better ordering of the public worship of God, and government of his Church; to receive complaints in cases of maladministration, and authoritatively to determine the same: which decrees and determinations, if consonant to the Word of God, are to be received with reverence and submission; not only for their agreement with the Word, but also for the power whereby they are made, as being an ordinance of God appointed thereunto in His Word (Acts 15:15, 19, 24, 27, 28, 29, 30, 31; Acts 16:4; Matt. 18:17, 18, 19, 20)."
            },
            {
              "id": 4,
              "text": "All synods or councils, since the Apostles’ times, whether general or particular, may err; and many have erred. Therefore they are not to be made the rule of faith, or practice; but to be used as a help in both (Eph. 2:20; Acts 17:11; 1 Cor. 2:5; 2 Cor. 1:24)."
            },
            {
              "id": 5,
              "text": "Synods and councils are to handle, or conclude, nothing, but that which is ecclesiastical: and are not to intermeddle with civil affairs which concern the commonwealth; unless by way of humble petition, in cases extraordinary; or by way of advice, for satisfaction of conscience, if they be thereunto required by the civil magistrate (Luke 12:13, 14; John 18:36)."
            }
          ]
        },
        {
          "id": 32,
          "title": "Of the State of Man After Death, and of the Resurrection of the Dead",
          "sections": [
            {
              "id": 1,
              "text": "The bodies of men, after death, return to dust and see corruption (Gen. 3:19; Acts 13:36): but their souls (which neither die nor sleep) having an immortal subsistence, immediately return to God who gave them (Luke 23:43; Eccles. 12:7): the souls of the righteous, being then made perfect in holiness, are received into the highest heavens, where they behold the face of God, in light and glory, waiting for the full redemption of their bodies (Heb. 12:23; 2 Cor. 5:1, 6, 8; Phil. 1:23, with Acts 3:21 & Eph. 4:10). And the souls of the wicked are cast into hell, where they remain in torments and utter darkness, reserved to the judgment of the great day (Luke 16:23, 24; Acts 1:25; Jude 6, 7; 1 Pet. 3:19). Beside these two places, for souls separated from their bodies, the Scripture acknowledgeth none."
            },
            {
              "id": 2,
              "text": "At the last day, such as are found alive shall not die, but be changed (1 Thess. 4:17; 1 Cor. 15:51, 52): and all the dead shall be raised up, with the selfsame bodies, and none other, although with different qualities, which shall be united again to their souls for ever (Job 19:26, 27; 1 Cor. 15:42, 43, 44)."
            },
            {
              "id": 3,
              "text": "The bodies of the unjust shall, by the power of Christ, be raised to dishonour: the bodies of the just, by His Spirit, unto honour; and be made conformable to His own glorious body (Acts 24:15; John 5:28, 29; 1 Cor. 15:43; Phil. 3:21)."
            }
          ]
        },
        {
          "id": 33,
          "title": "Of the Last Judgment",
          "sections": [
            {
              "id": 1,
              "text": "God hath appointed a day, wherein He will judge the world in righteousness, by Jesus Christ (Acts 17:31), to whom all power and judgment is given of the Father (John 5:22, 27). In which day, not only the apostate angels shall be judged (1 Cor. 6:3; Jude 6; 2 Pet. 2:4), but likewise all persons that have lived upon earth shall appear before the tribunal of Christ, to give an account of their thoughts, words, and deeds; and to receive according to what they have done in the body, whether good or evil (2 Cor. 5:10; Eccles. 12:14; Rom. 2:16; Rom. 14:10, 12; Matt. 12:36, 37)."
            },
            {
              "id": 2,
              "text": "The end of God’s appointing this day is for the manifestation of the glory of His mercy, in the eternal salvation of the elect; and of His justice, in the damnation of the reprobate who are wicked and disobedient. For then shall the righteous go into everlasting life, and receive that fulness of joy and refreshing, which shall come from the presence of the Lord: but the wicked who know not God, and obey not the Gospel of Jesus Christ, shall be cast into eternal torments, and be punished with everlasting destruction from the presence of the Lord, and from the glory of His power (Matt. 25:31 to the end; Rom. 2:5, 6; Rom. 9:22, 23; Matt. 25:21; Acts 3:19; 2 Thess. 1:7, 8, 9, 10)."
            },
            {
              "id": 3,
              "text": "As Christ would have us to be certainly persuaded that there shall be a day of judgment, both to deter all men from sin, and for the greater consolation of the godly in their adversity (2 Pet. 3:11, 14; 2 Cor. 5:10, 11; 2 Thess. 1:5, 6, 7; Luke 21:27, 28; Rom. 8:23, 24, 25); so will He have that day unknown to men, that they may shake off all carnal security, and be always watchful, because they know not at what hour the Lord will come; and may be ever prepared to say, Come, Lord Jesus, come quickly, Amen (Matt. 24:36, 42, 43, 44; Mark 13:35, 36, 37; Luke 12:35, 36; Rev. 22:20)."
            }
          ]
        }
      ]
    }
  }
}

